.segment "BANK_16"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
; 0x02C010-0x03000F
.org $8000



.export sub_0x02C011
.export sub_0x02C0DE
.export _off006_0x02C37A_02
.export _off006_0x02C3B5_01
.export _off006_0x02C445_06
.export _off006_0x02C457_0F
.export _off006_0x02C470_04
.export _off006_0x02C76F_05
.export _off006_0x02CBEB_07
.export _off006_0x02CF04_08
.export _off006_0x02D056_09
.export _off006_0x02D14F_0A
.export _off006_0x02D4AC_0B
.export _off006_0x02D649_0E
.export _off006_0x02D9C2_10
.export _off006_0x02DBB6_11
.export _off006_0x02DC54_12
.export _off006_0x02DD14_13
.export _off006_0x02DEBE_14
.export _off006_0x02DF9E_0C
.export _off006_0x02E085_15
.export _off006_0x02E191_16
.export _off006_0x02E287_17
.export _off006_0x02E2DF_18
.export _off006_0x02E34D_19
.export _off006_0x02E3C4_1A
.export _off006_0x02E439_1B
.export _off006_0x02E4A5_1C
.export _off006_0x02E51E_1D
.export loc_0x02E6E6
.export sub_0x02E74B
.export ofs_0x02E7CA
.export ofs_0x02E830
.export ofs_0x02E86E
.export sub_0x02EA10
.export loc_0x02EB10
.export sub_0x02EE60_выбрать_палитру_уровня
.export sub_0x02EF50
.export loc_0x02EFA0
.export ofs_0x02F73B
.export _off006_0x02F990_03
.export loc_0x02FC90
.export sub_0x02FD40
.export sub_0x02FEE4
.export loc_0x02FF80



- D 0 - - - 0x02C010 0B:8000: 06        .byte con_bank_id + $06   ; 



sub_0x02C011:
; bzk garbage
- D 0 - - - 0x02C011 0B:8001: A5 22     LDA ram_0022
- - - - - - 0x02C013 0B:8003: 4A        LSR
- - - - - - 0x02C014 0B:8004: B0 12     BCS bra_8018
- - - - - - 0x02C016 0B:8006: A4 9B     LDY ram_009B
- - - - - - 0x02C018 0B:8008: F0 28     BEQ bra_8032_RTS


; bzk garbage
sub_800A:
- - - - - - 0x02C01A 0B:800A: B9 34 80  LDA tbl_8036 - $02,Y
- - - - - - 0x02C01D 0B:800D: 85 8E     STA ram_btn_press
- - - - - - 0x02C01F 0B:800F: 85 91     STA ram_btn_hold
- - - - - - 0x02C021 0B:8011: A9 00     LDA #$00
- - - - - - 0x02C023 0B:8013: 85 92     STA ram_btn_hold + $01
- - - - - - 0x02C025 0B:8015: 85 8F     STA ram_btn_press + $01
- - - - - - 0x02C027 0B:8017: 60        RTS


; bzk garbage
bra_8018:
- - - - - - 0x02C028 0B:8018: A4 9B     LDY ram_009B
- - - - - - 0x02C02A 0B:801A: F0 04     BEQ bra_8020
- - - - - - 0x02C02C 0B:801C: A5 9A     LDA ram_009A
- - - - - - 0x02C02E 0B:801E: D0 0D     BNE bra_802D
bra_8020:
- - - - - - 0x02C030 0B:8020: B9 37 80  LDA tbl_8036 + $01,Y
- - - - - - 0x02C033 0B:8023: 85 9A     STA ram_009A
- - - - - - 0x02C035 0B:8025: C9 FF     CMP #$FF
- - - - - - 0x02C037 0B:8027: F0 0A     BEQ bra_8033_FF
- - - - - - 0x02C039 0B:8029: C8        INY
- - - - - - 0x02C03A 0B:802A: C8        INY
- - - - - - 0x02C03B 0B:802B: 84 9B     STY ram_009B
bra_802D:
- - - - - - 0x02C03D 0B:802D: 20 0A 80  JSR sub_800A
- - - - - - 0x02C040 0B:8030: C6 9A     DEC ram_009A
bra_8032_RTS:
- - - - - - 0x02C042 0B:8032: 60        RTS
bra_8033_FF:
- - - - - - 0x02C043 0B:8033: E6 99     INC ram_0099
- - - - - - 0x02C045 0B:8035: 60        RTS


; bzk garbage
tbl_8036:
- - - - - - 0x02C046 0B:8036: 80        .byte $80, $90   ; 
- - - - - - 0x02C048 0B:8038: C4        .byte $C4, $10   ; 
- - - - - - 0x02C04A 0B:803A: 80        .byte $80, $00   ; 
- - - - - - 0x02C04C 0B:803C: 82        .byte $82, $25   ; 
- - - - - - 0x02C04E 0B:803E: 88        .byte $88, $11   ; 
- - - - - - 0x02C050 0B:8040: 80        .byte $80, $26   ; 
- - - - - - 0x02C052 0B:8042: 81        .byte $81, $0B   ; 
- - - - - - 0x02C054 0B:8044: 88        .byte $88, $05   ; 
- - - - - - 0x02C056 0B:8046: 81        .byte $81, $07   ; 
- - - - - - 0x02C058 0B:8048: 80        .byte $80, $19   ; 
- - - - - - 0x02C05A 0B:804A: 82        .byte $82, $05   ; 
- - - - - - 0x02C05C 0B:804C: 84        .byte $84, $0B   ; 
- - - - - - 0x02C05E 0B:804E: 82        .byte $82, $07   ; 
- - - - - - 0x02C060 0B:8050: 80        .byte $80, $0B   ; 
- - - - - - 0x02C062 0B:8052: 84        .byte $84, $0B   ; 
- - - - - - 0x02C064 0B:8054: 80        .byte $80, $37   ; 
- - - - - - 0x02C066 0B:8056: 88        .byte $88, $10   ; 
- - - - - - 0x02C068 0B:8058: 80        .byte $80, $05   ; 
- - - - - - 0x02C06A 0B:805A: 84        .byte $84, $0A   ; 
- - - - - - 0x02C06C 0B:805C: 82        .byte $82, $20   ; 
- - - - - - 0x02C06E 0B:805E: 82        .byte $82, $05   ; 
- - - - - - 0x02C070 0B:8060: C2        .byte $C2, $04   ; 
- - - - - - 0x02C072 0B:8062: 81        .byte $81, $02   ; 
- - - - - - 0x02C074 0B:8064: 80        .byte $80, $22   ; 
- - - - - - 0x02C076 0B:8066: 84        .byte $84, $0B   ; 
- - - - - - 0x02C078 0B:8068: 80        .byte $80, $15   ; 
- - - - - - 0x02C07A 0B:806A: 88        .byte $88, $08   ; 
- - - - - - 0x02C07C 0B:806C: 80        .byte $80, $0A   ; 
- - - - - - 0x02C07E 0B:806E: 84        .byte $84, $0D   ; 
- - - - - - 0x02C080 0B:8070: 82        .byte $82, $05   ; 
- - - - - - 0x02C082 0B:8072: 82        .byte $82, $25   ; 
- - - - - - 0x02C084 0B:8074: 88        .byte $88, $09   ; 
- - - - - - 0x02C086 0B:8076: 84        .byte $84, $07   ; 
- - - - - - 0x02C088 0B:8078: 81        .byte $81, $0E   ; 
- - - - - - 0x02C08A 0B:807A: 80        .byte $80, $21   ; 
- - - - - - 0x02C08C 0B:807C: 88        .byte $88, $07   ; 
- - - - - - 0x02C08E 0B:807E: 89        .byte $89, $0B   ; 
- - - - - - 0x02C090 0B:8080: 80        .byte $80, $0A   ; 
- - - - - - 0x02C092 0B:8082: 84        .byte $84, $07   ; 
- - - - - - 0x02C094 0B:8084: 88        .byte $88, $05   ; 
- - - - - - 0x02C096 0B:8086: 80        .byte $80, $19   ; 
- - - - - - 0x02C098 0B:8088: 82        .byte $82, $0C   ; 
- - - - - - 0x02C09A 0B:808A: 80        .byte $80, $31   ; 
- - - - - - 0x02C09C 0B:808C: 82        .byte $82, $18   ; 
- - - - - - 0x02C09E 0B:808E: 80        .byte $80, $09   ; 
- - - - - - 0x02C0A0 0B:8090: 88        .byte $88, $0C   ; 
- - - - - - 0x02C0A2 0B:8092: 80        .byte $80, $0A   ; 
- - - - - - 0x02C0A4 0B:8094: 84        .byte $84, $07   ; 
- - - - - - 0x02C0A6 0B:8096: 80        .byte $80, $04   ; 
- - - - - - 0x02C0A8 0B:8098: 88        .byte $88, $08   ; 
- - - - - - 0x02C0AA 0B:809A: 80        .byte $80, $07   ; 
- - - - - - 0x02C0AC 0B:809C: 81        .byte $81, $22   ; 
- - - - - - 0x02C0AE 0B:809E: 80        .byte $80, $08   ; 
- - - - - - 0x02C0B0 0B:80A0: 81        .byte $81, $07   ; 
- - - - - - 0x02C0B2 0B:80A2: 82        .byte $82, $13   ; 
- - - - - - 0x02C0B4 0B:80A4: 82        .byte $82, $23   ; 
- - - - - - 0x02C0B6 0B:80A6: 80        .byte $80, $19   ; 
- - - - - - 0x02C0B8 0B:80A8: 82        .byte $82, $0C   ; 
- - - - - - 0x02C0BA 0B:80AA: 81        .byte $81, $10   ; 
- - - - - - 0x02C0BC 0B:80AC: 88        .byte $88, $07   ; 
- - - - - - 0x02C0BE 0B:80AE: 82        .byte $82, $03   ; 
- - - - - - 0x02C0C0 0B:80B0: 80        .byte $80, $2A   ; 
- - - - - - 0x02C0C2 0B:80B2: 81        .byte $81, $14   ; 
- - - - - - 0x02C0C4 0B:80B4: 80        .byte $80, $1B   ; 
- - - - - - 0x02C0C6 0B:80B6: 81        .byte $81, $13   ; 
- - - - - - 0x02C0C8 0B:80B8: 80        .byte $80, $11   ; 
- - - - - - 0x02C0CA 0B:80BA: 82        .byte $82, $2A   ; 
- - - - - - 0x02C0CC 0B:80BC: 80        .byte $80, $0B   ; 
- - - - - - 0x02C0CE 0B:80BE: 81        .byte $81, $11   ; 
- - - - - - 0x02C0D0 0B:80C0: 80        .byte $80, $18   ; 
- - - - - - 0x02C0D2 0B:80C2: 82        .byte $82, $10   ; 
- - - - - - 0x02C0D4 0B:80C4: 80        .byte $80, $17   ; 
- - - - - - 0x02C0D6 0B:80C6: 84        .byte $84, $0C   ; 
- - - - - - 0x02C0D8 0B:80C8: 80        .byte $80, $12   ; 
- - - - - - 0x02C0DA 0B:80CA: 81        .byte $81, $0C   ; 
- - - - - - 0x02C0DC 0B:80CC: FF        .byte $FF, $FF   ; 



sub_0x02C0DE:
C - - - - - 0x02C0DE 0B:80CE: 20 D4 80  JSR sub_80D4
C - - - - - 0x02C0E1 0B:80D1: 4C D4 82  JMP loc_82D4



sub_80D4:
C - - - - - 0x02C0E4 0B:80D4: AD 3E 06  LDA ram_063E
C - - - - - 0x02C0E7 0B:80D7: 20 32 D0  JSR sub_0x03D042_поинтеры_после_JSR
- D 0 - I - 0x02C0EA 0B:80DA: E4 80     .word ofs_041_80E4_00
- D 0 - I - 0x02C0EC 0B:80DC: 06 81     .word ofs_041_8106_01
- D 0 - I - 0x02C0EE 0B:80DE: 58 81     .word ofs_041_8158_02
- D 0 - I - 0x02C0F0 0B:80E0: 5B 81     .word ofs_041_815B_03
- D 0 - I - 0x02C0F2 0B:80E2: 3C 83     .word ofs_041_833C_04



ofs_041_80E4_00:
C - - J - - 0x02C0F4 0B:80E4: 20 BE DA  JSR sub_0x03DACE_удалить_все_объекты
C - - - - - 0x02C0F7 0B:80E7: EE 3E 06  INC ram_063E
C - - - - - 0x02C0FA 0B:80EA: A9 74     LDA #$74
C - - - - - 0x02C0FC 0B:80EC: 85 32     STA ram_0032
C - - - - - 0x02C0FE 0B:80EE: 20 00 AC  JSR sub_AC00
; bzk optimize
C - - - - - 0x02C101 0B:80F1: EA        NOP
C - - - - - 0x02C102 0B:80F2: A0 02     LDY #con_0x03DC39_02
C - - - - - 0x02C104 0B:80F4: 20 04 DC  JSR sub_0x03DC14
C - - - - - 0x02C107 0B:80F7: A5 2C     LDA ram_002C
C - - - - - 0x02C109 0B:80F9: F0 03     BEQ bra_80FE
C - - - - - 0x02C10B 0B:80FB: EE E0 04  INC ram_obj_04E0
bra_80FE:
C - - - - - 0x02C10E 0B:80FE: A9 0A     LDA #con_0x03F84C_0A
C - - - - - 0x02C110 0B:8100: 20 14 F8  JSR sub_0x03F824
C - - - - - 0x02C113 0B:8103: 4C 6D D4  JMP loc_0x03D47D



ofs_041_8106_01:
C - - J - - 0x02C116 0B:8106: EE 3E 06  INC ram_063E
C - - - - - 0x02C119 0B:8109: A4 2C     LDY ram_002C
C - - - - - 0x02C11B 0B:810B: BE FA BF  LDX tbl_BFFA,Y
C - - - - - 0x02C11E 0B:810E: 20 44 F0  JSR sub_0x03F054
; bzk optimize
C - - - - - 0x02C121 0B:8111: EA        NOP
C - - - - - 0x02C122 0B:8112: A5 2C     LDA ram_002C
C - - - - - 0x02C124 0B:8114: D0 05     BNE bra_811B
C - - - - - 0x02C126 0B:8116: A2 1A     LDX #$1A
C - - - - - 0x02C128 0B:8118: 20 44 F0  JSR sub_0x03F054
bra_811B:
C - - - - - 0x02C12B 0B:811B: A0 06     LDY #$06
C - - - - - 0x02C12D 0B:811D: A9 13     LDA #$13
C - - - - - 0x02C12F 0B:811F: 20 94 D3  JSR sub_0x03D3A4
C - - - - - 0x02C132 0B:8122: A0 00     LDY #$00
C - - - - - 0x02C134 0B:8124: 8C 30 05  STY ram_obj_0530
C - - - - - 0x02C137 0B:8127: 8C 31 05  STY ram_obj_0530 + $01
C - - - - - 0x02C13A 0B:812A: C8        INY
C - - - - - 0x02C13B 0B:812B: 84 08     STY ram_0008
bra_812D_loop:
C - - - - - 0x02C13D 0B:812D: A6 08     LDX ram_0008
C - - - - - 0x02C13F 0B:812F: 20 4F 81  JSR sub_814F
C - - - - - 0x02C142 0B:8132: C6 08     DEC ram_0008
C - - - - - 0x02C144 0B:8134: 10 F7     BPL bra_812D_loop
C - - - - - 0x02C146 0B:8136: A9 37     LDA #con_0x03F6AD_37
C - - - - - 0x02C148 0B:8138: 20 90 F6  JSR sub_0x03F6A0
C - - - - - 0x02C14B 0B:813B: A2 00     LDX #$00
C - - - - - 0x02C14D 0B:813D: 20 2F 82  JSR sub_822F
C - - - - - 0x02C150 0B:8140: A5 2C     LDA ram_002C
C - - - - - 0x02C152 0B:8142: F0 08     BEQ bra_814C
C - - - - - 0x02C154 0B:8144: C9 02     CMP #$02
C - - - - - 0x02C156 0B:8146: F0 04     BEQ bra_814C
C - - - - - 0x02C158 0B:8148: E8        INX
C - - - - - 0x02C159 0B:8149: 20 2F 82  JSR sub_822F
bra_814C:
C - - - - - 0x02C15C 0B:814C: 4C 41 E1  JMP loc_0x03E151



sub_814F:
C - - - - - 0x02C15F 0B:814F: B4 A2     LDY ram_plr_id,X
C - - - - - 0x02C161 0B:8151: B9 8C E9  LDA tbl_0x03E99C,Y
C - - - - - 0x02C164 0B:8154: E8        INX
; tip_индекс_буфера_палитры + $01
; tip_индекс_буфера_палитры + $02
C - - - - - 0x02C165 0B:8155: 4C 46 D3  JMP loc_0x03D356_записать_3_цвета_в_буфер



ofs_041_8158_02:
C - - J - - 0x02C168 0B:8158: EE 3E 06  INC ram_063E
ofs_041_815B_03:
C - - - - - 0x02C16B 0B:815B: A5 2C     LDA ram_002C
C - - - - - 0x02C16D 0B:815D: C9 02     CMP #$02
C - - - - - 0x02C16F 0B:815F: F0 23     BEQ bra_8184
C - - - - - 0x02C171 0B:8161: 4C 80 BD  JMP loc_BD80



loc_8164:
C D 0 - - - 0x02C174 0B:8164: 85 A8     STA ram_00A8
bra_8166_loop:
C - - - - - 0x02C176 0B:8166: A6 A8     LDX ram_00A8
C - - - - - 0x02C178 0B:8168: 8A        TXA
C - - - - - 0x02C179 0B:8169: 29 01     AND #$01
C - - - - - 0x02C17B 0B:816B: 09 80     ORA #$80
C - - - - - 0x02C17D 0B:816D: 9D 00 05  STA ram_obj_0500,X
C - - - - - 0x02C180 0B:8170: 20 78 81  JSR sub_8178
C - - - - - 0x02C183 0B:8173: C6 A8     DEC ram_00A8
C - - - - - 0x02C185 0B:8175: 10 EF     BPL bra_8166_loop
C - - - - - 0x02C187 0B:8177: 60        RTS



sub_8178:
C - - - - - 0x02C188 0B:8178: BD 30 05  LDA ram_obj_0530,X
C - - - - - 0x02C18B 0B:817B: 20 32 D0  JSR sub_0x03D042_поинтеры_после_JSR
- D 0 - I - 0x02C18E 0B:817E: C9 81     .word ofs_040_81C9_00
- D 0 - I - 0x02C190 0B:8180: 93 82     .word ofs_040_8293_01
- D 0 - I - 0x02C192 0B:8182: BC 82     .word ofs_040_82BC_02



bra_8184:
loc_8184:
C D 0 - - - 0x02C194 0B:8184: 18        CLC
C - - - - - 0x02C195 0B:8185: AD 30 05  LDA ram_obj_0530
C - - - - - 0x02C198 0B:8188: 6D 31 05  ADC ram_obj_0530 + $01
C - - - - - 0x02C19B 0B:818B: 8D 30 05  STA ram_obj_0530
C - - - - - 0x02C19E 0B:818E: A9 00     LDA #$00
C - - - - - 0x02C1A0 0B:8190: 8D 31 05  STA ram_obj_0530 + $01
C - - - - - 0x02C1A3 0B:8193: A2 81     LDX #$81
C - - - - - 0x02C1A5 0B:8195: 8E 01 05  STX ram_obj_0500 + $01
C - - - - - 0x02C1A8 0B:8198: CA        DEX ; 80
C - - - - - 0x02C1A9 0B:8199: 8E 00 05  STX ram_obj_0500
C - - - - - 0x02C1AC 0B:819C: AD 30 05  LDA ram_obj_0530
C - - - - - 0x02C1AF 0B:819F: 20 32 D0  JSR sub_0x03D042_поинтеры_после_JSR
- D 0 - I - 0x02C1B2 0B:81A2: C5 81     .word ofs_039_81C5_00
- D 0 - I - 0x02C1B4 0B:81A4: 91 82     .word ofs_039_8291_01
- D 0 - I - 0x02C1B6 0B:81A6: AE 81     .word ofs_039_81AE_02
- D 0 - I - 0x02C1B8 0B:81A8: B6 81     .word ofs_039_81B6_03
- D 0 - I - 0x02C1BA 0B:81AA: 8D 82     .word ofs_039_828D_04
- D 0 - I - 0x02C1BC 0B:81AC: CC 82     .word ofs_039_82CC_05



ofs_039_81AE_02:
C - - J - - 0x02C1BE 0B:81AE: EE 30 05  INC ram_obj_0530
C - - - - - 0x02C1C1 0B:81B1: A2 01     LDX #$01
C - - - - - 0x02C1C3 0B:81B3: 4C 2F 82  JMP loc_822F



ofs_039_81B6_03:
C - - J - - 0x02C1C6 0B:81B6: A2 01     LDX #$01
C - - - - - 0x02C1C8 0B:81B8: 86 A8     STX ram_00A8
C - - - - - 0x02C1CA 0B:81BA: A5 8E     LDA ram_btn_press
C - - - - - 0x02C1CC 0B:81BC: 20 CB 81  JSR sub_81CB
C - - - - - 0x02C1CF 0B:81BF: A9 1A     LDA #$1A
C - - - - - 0x02C1D1 0B:81C1: 8D 01 04  STA ram_plr_anim_id + $01
bra_81C4_RTS:
C - - - - - 0x02C1D4 0B:81C4: 60        RTS



ofs_039_81C5_00:
C - - J - - 0x02C1D5 0B:81C5: A2 00     LDX #$00
C - - - - - 0x02C1D7 0B:81C7: 86 A8     STX ram_00A8
ofs_040_81C9_00:
C - - J - - 0x02C1D9 0B:81C9: B5 8E     LDA ram_btn_press,X
sub_81CB:
C - - - - - 0x02C1DB 0B:81CB: A8        TAY
C - - - - - 0x02C1DC 0B:81CC: 29 D0     AND #con_btns_AB + con_btn_Start
C - - - - - 0x02C1DE 0B:81CE: F0 03     BEQ bra_81D3
C - - - - - 0x02C1E0 0B:81D0: 4C 12 BE  JMP loc_BE12
bra_81D3:
C - - - - - 0x02C1E3 0B:81D3: 98        TYA
C - - - - - 0x02C1E4 0B:81D4: 29 0F     AND #con_btns_Dpad
C - - - - - 0x02C1E6 0B:81D6: F0 EC     BEQ bra_81C4_RTS
C - - - - - 0x02C1E8 0B:81D8: A0 FF     LDY #$FF
C - - - - - 0x02C1EA 0B:81DA: 29 09     AND #con_btn_Up + con_btn_Right
C - - - - - 0x02C1EC 0B:81DC: F0 02     BEQ bra_81E0
C - - - - - 0x02C1EE 0B:81DE: A0 01     LDY #$01
bra_81E0:
C - - - - - 0x02C1F0 0B:81E0: 84 00     STY ram_0000
bra_81E2_loop:
C - - - - - 0x02C1F2 0B:81E2: A5 00     LDA ram_0000
C - - - - - 0x02C1F4 0B:81E4: 18        CLC
C - - - - - 0x02C1F5 0B:81E5: 75 A2     ADC ram_plr_id,X
C - - - - - 0x02C1F7 0B:81E7: 20 50 AA  JSR sub_AA50_автобаланс_силы
C - - - - - 0x02C1FA 0B:81EA: D9 62 83  CMP tbl_8362,Y
C - - - - - 0x02C1FD 0B:81ED: 90 08     BCC bra_81F7
C - - - - - 0x02C1FF 0B:81EF: 10 04     BPL bra_81F5
C - - - - - 0x02C201 0B:81F1: B9 64 83  LDA tbl_8364,Y
C - - - - - 0x02C204 0B:81F4: 2C        .byte $2C   ; BIT
bra_81F5:
C - - - - - 0x02C205 0B:81F5: A9 00     LDA #$00
bra_81F7:
C - - - - - 0x02C207 0B:81F7: 95 A2     STA ram_plr_id,X
C - - - - - 0x02C209 0B:81F9: C9 0F     CMP #$0F
C - - - - - 0x02C20B 0B:81FB: D0 1B     BNE bra_8218
- - - - - - 0x02C20D 0B:81FD: A5 2C     LDA ram_002C
- - - - - - 0x02C20F 0B:81FF: C9 02     CMP #$02
- - - - - - 0x02C211 0B:8201: D0 05     BNE bra_8208
- - - - - - 0x02C213 0B:8203: AD 30 05  LDA ram_obj_0530
- - - - - - 0x02C216 0B:8206: F0 10     BEQ bra_8218
bra_8208:
- - - - - - 0x02C218 0B:8208: AD E0 04  LDA ram_obj_04E0
- - - - - - 0x02C21B 0B:820B: F0 0B     BEQ bra_8218
- - - - - - 0x02C21D 0B:820D: 8A        TXA
- - - - - - 0x02C21E 0B:820E: 49 01     EOR #$01
- - - - - - 0x02C220 0B:8210: A8        TAY
- - - - - - 0x02C221 0B:8211: B9 A2 00  LDA ram_plr_id,Y
- - - - - - 0x02C224 0B:8214: C9 05     CMP #$05
- - - - - - 0x02C226 0B:8216: F0 CA     BEQ bra_81E2_loop
bra_8218:
C - - - - - 0x02C228 0B:8218: 20 7F 82  JSR sub_827F
C - - - - - 0x02C22B 0B:821B: B0 03     BCS bra_8220
C - - - - - 0x02C22D 0B:821D: 20 4F 81  JSR sub_814F
bra_8220:
C - - - - - 0x02C230 0B:8220: A6 A8     LDX ram_00A8
C - - - - - 0x02C232 0B:8222: A9 00     LDA #$00
C - - - - - 0x02C234 0B:8224: 9D D0 05  STA ram_obj_05D0,X
C - - - - - 0x02C237 0B:8227: 9D C0 05  STA ram_obj_anim_timer,X
C - - - - - 0x02C23A 0B:822A: A9 25     LDA #con_0x03F6AD_25
C - - - - - 0x02C23C 0B:822C: 20 90 F6  JSR sub_0x03F6A0
sub_822F:
loc_822F:
; позиция курсора при выборе перса
C D 0 - - - 0x02C23F 0B:822F: B4 A2     LDY ram_plr_id,X ; 00A2 00A3 
C - - - - - 0x02C241 0B:8231: B9 50 83  LDA tbl_8350_pos_X_курсор,Y
C - - - - - 0x02C244 0B:8234: 9D 40 04  STA ram_obj_pos_X,X ; 0440 0441 
C - - - - - 0x02C247 0B:8237: B9 57 83  LDA tbl_8357_pos_Y_курсор,Y
C - - - - - 0x02C24A 0B:823A: 9D 10 04  STA ram_obj_pos_Y,X ; 0410 0411 
C - - - - - 0x02C24D 0B:823D: 20 AB 82  JSR sub_82AB
C - - - - - 0x02C250 0B:8240: B4 A2     LDY ram_plr_id,X ; 00A2 00A3 
C - - - - - 0x02C252 0B:8242: B9 49 83  LDA tbl_8349_pos_X_спрайты_портрета,Y
C - - - - - 0x02C255 0B:8245: 9D 42 04  STA ram_obj_pos_X + $02,X ; 0442 0443 
C - - - - - 0x02C258 0B:8248: B9 42 83  LDA tbl_8342_pos_Y_спрайты_портрета,Y
C - - - - - 0x02C25B 0B:824B: 9D 12 04  STA ram_obj_pos_Y + $02,X ; 0412 0413 
C - - - - - 0x02C25E 0B:824E: 98        TYA
C - - - - - 0x02C25F 0B:824F: 18        CLC
C - - - - - 0x02C260 0B:8250: 69 1B     ADC #$1B
C - - - - - 0x02C262 0B:8252: 9D 02 04  STA ram_plr_0402,X ; 0402 0403 
C - - - - - 0x02C265 0B:8255: 8A        TXA
C - - - - - 0x02C266 0B:8256: 09 82     ORA #$82
C - - - - - 0x02C268 0B:8258: 9D 02 05  STA ram_0502,X ; 0502 0503 
C - - - - - 0x02C26B 0B:825B: 20 7F 82  JSR sub_827F
C - - - - - 0x02C26E 0B:825E: B0 0E     BCS bra_826E_RTS
C - - - - - 0x02C270 0B:8260: 8A        TXA
C - - - - - 0x02C271 0B:8261: 48        PHA
C - - - - - 0x02C272 0B:8262: 18        CLC
C - - - - - 0x02C273 0B:8263: 69 06     ADC #$06
C - - - - - 0x02C275 0B:8265: AA        TAX
C - - - - - 0x02C276 0B:8266: B9 85 E9  LDA tbl_0x03E995,Y
; tip_индекс_буфера_палитры + $06
; tip_индекс_буфера_палитры + $07
C - - - - - 0x02C279 0B:8269: 20 46 D3  JSR sub_0x03D356_записать_3_цвета_в_буфер
C - - - - - 0x02C27C 0B:826C: 68        PLA
C - - - - - 0x02C27D 0B:826D: AA        TAX
bra_826E_RTS:
C - - - - - 0x02C27E 0B:826E: 60        RTS



loc_826F:
C D 0 - - - 0x02C27F 0B:826F: FE 30 05  INC ram_obj_0530,X
C - - - - - 0x02C282 0B:8272: A9 3C     LDA #$3C
C - - - - - 0x02C284 0B:8274: 9D A0 04  STA ram_obj_04A0,X
C - - - - - 0x02C287 0B:8277: B4 A2     LDY ram_plr_id,X
C - - - - - 0x02C289 0B:8279: B9 5E E1  LDA tbl_0x03E16E,Y
C - - - - - 0x02C28C 0B:827C: 4C 90 F6  JMP loc_0x03F6A0



sub_827F:
C - - - - - 0x02C28F 0B:827F: E0 01     CPX #$01
C - - - - - 0x02C291 0B:8281: D0 06     BNE bra_8289
C - - - - - 0x02C293 0B:8283: A5 A2     LDA ram_plr_id
C - - - - - 0x02C295 0B:8285: C5 A3     CMP ram_plr_id + $01
C - - - - - 0x02C297 0B:8287: F0 02     BEQ bra_828B
bra_8289:
C - - - - - 0x02C299 0B:8289: 18        CLC
C - - - - - 0x02C29A 0B:828A: 60        RTS
bra_828B:
C - - - - - 0x02C29B 0B:828B: 18        CLC
C - - - - - 0x02C29C 0B:828C: 60        RTS



ofs_039_828D_04:
C - - J - - 0x02C29D 0B:828D: A2 01     LDX #$01
C - - - - - 0x02C29F 0B:828F: D0 02     BNE bra_8293    ; jmp



ofs_039_8291_01:
C - - J - - 0x02C2A1 0B:8291: A2 00     LDX #$00
bra_8293:
ofs_040_8293_01:
C - - J - - 0x02C2A3 0B:8293: 20 AB 82  JSR sub_82AB
C - - - - - 0x02C2A6 0B:8296: BD A0 04  LDA ram_obj_04A0,X
C - - - - - 0x02C2A9 0B:8299: 4A        LSR
C - - - - - 0x02C2AA 0B:829A: 4A        LSR
C - - - - - 0x02C2AB 0B:829B: 4A        LSR
C - - - - - 0x02C2AC 0B:829C: 90 05     BCC bra_82A3
C - - - - - 0x02C2AE 0B:829E: A9 00     LDA #$00
C - - - - - 0x02C2B0 0B:82A0: 9D 00 04  STA ram_plr_anim_id,X
bra_82A3:
C - - - - - 0x02C2B3 0B:82A3: DE A0 04  DEC ram_obj_04A0,X
C - - - - - 0x02C2B6 0B:82A6: D0 13     BNE bra_82BB_RTS
C - - - - - 0x02C2B8 0B:82A8: 20 4C BF  JSR sub_BF4C
sub_82AB:
C - - - - - 0x02C2BB 0B:82AB: 8A        TXA
C - - - - - 0x02C2BC 0B:82AC: A4 2C     LDY ram_002C
C - - - - - 0x02C2BE 0B:82AE: C0 02     CPY #$02
C - - - - - 0x02C2C0 0B:82B0: D0 02     BNE bra_82B4
C - - - - - 0x02C2C2 0B:82B2: 69 01     ADC #$01
bra_82B4:
C - - - - - 0x02C2C4 0B:82B4: A8        TAY
C - - - - - 0x02C2C5 0B:82B5: B9 66 83  LDA tbl_8366,Y
C - - - - - 0x02C2C8 0B:82B8: 4C 2C BF  JMP loc_BF2C
bra_82BB_RTS:
C - - - - - 0x02C2CB 0B:82BB: 60        RTS



ofs_040_82BC_02:
C - - J - - 0x02C2CC 0B:82BC: AD E0 04  LDA ram_obj_04E0
C - - - - - 0x02C2CF 0B:82BF: F0 0B     BEQ bra_82CC
C - - - - - 0x02C2D1 0B:82C1: 8A        TXA
C - - - - - 0x02C2D2 0B:82C2: 49 01     EOR #$01
C - - - - - 0x02C2D4 0B:82C4: A8        TAY
C - - - - - 0x02C2D5 0B:82C5: B9 30 05  LDA ram_obj_0530,Y
C - - - - - 0x02C2D8 0B:82C8: C9 02     CMP #$02
C - - - - - 0x02C2DA 0B:82CA: 90 EF     BCC bra_82BB_RTS
bra_82CC:
ofs_039_82CC_05:
C - - - - - 0x02C2DC 0B:82CC: A9 04     LDA #$04
C - - - - - 0x02C2DE 0B:82CE: 8D 3E 06  STA ram_063E
C - - - - - 0x02C2E1 0B:82D1: 4C 2E E1  JMP loc_0x03E13E



loc_82D4:
C D 0 - - - 0x02C2E4 0B:82D4: A9 03     LDA #$03
C - - - - - 0x02C2E6 0B:82D6: 20 5D D2  JSR sub_0x03D26D_записать_A_в_буфер_с_чтением_индекса
C - - - - - 0x02C2E9 0B:82D9: A9 D0     LDA #< $23D0
C - - - - - 0x02C2EB 0B:82DB: 20 5F D2  JSR sub_0x03D26F_записать_A_в_буфер_без_чтения_индекса
C - - - - - 0x02C2EE 0B:82DE: A9 23     LDA #> $23D0
C - - - - - 0x02C2F0 0B:82E0: 20 5F D2  JSR sub_0x03D26F_записать_A_в_буфер_без_чтения_индекса
C - - - - - 0x02C2F3 0B:82E3: A9 1F     LDA #$1F
C - - - - - 0x02C2F5 0B:82E5: 20 5F D2  JSR sub_0x03D26F_записать_A_в_буфер_без_чтения_индекса
C - - - - - 0x02C2F8 0B:82E8: 20 59 D2  JSR sub_0x03D269_записать_FF_в_буфер_с_индексом_X
C - - - - - 0x02C2FB 0B:82EB: AE E0 04  LDX ram_obj_04E0
C - - - - - 0x02C2FE 0B:82EE: A5 2C     LDA ram_002C
C - - - - - 0x02C300 0B:82F0: C9 02     CMP #$02
C - - - - - 0x02C302 0B:82F2: D0 08     BNE bra_82FC
C - - - - - 0x02C304 0B:82F4: AD 30 05  LDA ram_obj_0530
C - - - - - 0x02C307 0B:82F7: 4A        LSR
C - - - - - 0x02C308 0B:82F8: D0 02     BNE bra_82FC
C - - - - - 0x02C30A 0B:82FA: A2 00     LDX #$00
bra_82FC:
C - - - - - 0x02C30C 0B:82FC: 86 00     STX ram_0000
bra_82FE_loop:
C - - - - - 0x02C30E 0B:82FE: A6 00     LDX ram_0000
C - - - - - 0x02C310 0B:8300: B5 A2     LDA ram_plr_id,X ; 00A2 00A3 
C - - - - - 0x02C312 0B:8302: 0A        ASL
C - - - - - 0x02C313 0B:8303: C9 08     CMP #$08
C - - - - - 0x02C315 0B:8305: 90 02     BCC bra_8309
C - - - - - 0x02C317 0B:8307: 69 08     ADC #$08
bra_8309:
C - - - - - 0x02C319 0B:8309: 18        CLC
C - - - - - 0x02C31A 0B:830A: 69 D0     ADC #< $23D0
C - - - - - 0x02C31C 0B:830C: 85 01     STA ram_0001
C - - - - - 0x02C31E 0B:830E: A8        TAY
C - - - - - 0x02C31F 0B:830F: A9 23     LDA #> $23D0
C - - - - - 0x02C321 0B:8311: 20 6B D2  JSR sub_0x03D27B_записать_адрес_2006_Y_и_A_в_буфер
C - - - - - 0x02C324 0B:8314: A6 00     LDX ram_0000
C - - - - - 0x02C326 0B:8316: 20 30 83  JSR sub_8330
C - - - - - 0x02C329 0B:8319: 18        CLC
C - - - - - 0x02C32A 0B:831A: A5 01     LDA ram_0001
C - - - - - 0x02C32C 0B:831C: 69 08     ADC #< $2308
C - - - - - 0x02C32E 0B:831E: A8        TAY
C - - - - - 0x02C32F 0B:831F: A9 23     LDA #> $2308
C - - - - - 0x02C331 0B:8321: 20 6B D2  JSR sub_0x03D27B_записать_адрес_2006_Y_и_A_в_буфер
C - - - - - 0x02C334 0B:8324: A6 00     LDX ram_0000
C - - - - - 0x02C336 0B:8326: E8        INX
C - - - - - 0x02C337 0B:8327: E8        INX
C - - - - - 0x02C338 0B:8328: 20 30 83  JSR sub_8330
C - - - - - 0x02C33B 0B:832B: C6 00     DEC ram_0000
C - - - - - 0x02C33D 0B:832D: 10 CF     BPL bra_82FE_loop
C - - - - - 0x02C33F 0B:832F: 60        RTS



sub_8330:
C - - - - - 0x02C340 0B:8330: BD 5E 83  LDA tbl_835E,X
C - - - - - 0x02C343 0B:8333: 20 5D D2  JSR sub_0x03D26D_записать_A_в_буфер_с_чтением_индекса
C - - - - - 0x02C346 0B:8336: 20 5D D2  JSR sub_0x03D26D_записать_A_в_буфер_с_чтением_индекса
C - - - - - 0x02C349 0B:8339: 4C 5B D2  JMP loc_0x03D26B_записать_FF_в_буфер



ofs_041_833C_04:
C - - J - - 0x02C34C 0B:833C: A9 00     LDA #$00
C - - - - - 0x02C34E 0B:833E: 8D 3E 06  STA ram_063E
C - - - - - 0x02C351 0B:8341: 60        RTS



tbl_8342_pos_Y_спрайты_портрета:
- D 0 - - - 0x02C352 0B:8342: 4F        .byte $4F   ; 00 leo
- D 0 - - - 0x02C353 0B:8343: 4F        .byte $4F   ; 01 raph
- D 0 - - - 0x02C354 0B:8344: 4F        .byte $4F   ; 02 mike
- D 0 - - - 0x02C355 0B:8345: 4F        .byte $4F   ; 03 don
- D 0 - - - 0x02C356 0B:8346: 97        .byte $97   ; 04 casey
- D 0 - - - 0x02C357 0B:8347: 97        .byte $97   ; 05 hot
- D 0 - - - 0x02C358 0B:8348: 97        .byte $97   ; 06 shred

tbl_8349_pos_X_спрайты_портрета:
- D 0 - - - 0x02C359 0B:8349: 18        .byte $18   ; 00 leo
- D 0 - - - 0x02C35A 0B:834A: 50        .byte $50   ; 01 raph
- D 0 - - - 0x02C35B 0B:834B: 88        .byte $88   ; 02 mike
- D 0 - - - 0x02C35C 0B:834C: C0        .byte $C0   ; 03 don
- D 0 - - - 0x02C35D 0B:834D: 30        .byte $30   ; 04 casey
- D 0 - - - 0x02C35E 0B:834E: 70        .byte $70   ; 05 hot
- D 0 - - - 0x02C35F 0B:834F: B0        .byte $B0   ; 06 shred
tbl_8350_pos_X_курсор:
- D 0 - - - 0x02C360 0B:8350: 14        .byte $14   ; 00 leo
- D 0 - - - 0x02C361 0B:8351: 4C        .byte $4C   ; 01 raph
- D 0 - - - 0x02C362 0B:8352: 84        .byte $84   ; 02 mike
- D 0 - - - 0x02C363 0B:8353: BC        .byte $BC   ; 03 don
- D 0 - - - 0x02C364 0B:8354: 2C        .byte $2C   ; 04 casey
- D 0 - - - 0x02C365 0B:8355: 6C        .byte $6C   ; 05 hot
- D 0 - - - 0x02C366 0B:8356: AC        .byte $AC   ; 06 shred

tbl_8357_pos_Y_курсор:
- D 0 - - - 0x02C367 0B:8357: 46        .byte $46   ; 00 leo
- D 0 - - - 0x02C368 0B:8358: 46        .byte $46   ; 01 raph
- D 0 - - - 0x02C369 0B:8359: 46        .byte $46   ; 02 mike
- D 0 - - - 0x02C36A 0B:835A: 46        .byte $46   ; 03 don
- D 0 - - - 0x02C36B 0B:835B: 8E        .byte $8E   ; 04 casey
- D 0 - - - 0x02C36C 0B:835C: 8E        .byte $8E   ; 05 hot
- D 0 - - - 0x02C36D 0B:835D: 8E        .byte $8E   ; 06 shred



tbl_835E:
- D 0 - - - 0x02C36E 0B:835E: 50        .byte $50   ; 00
- D 0 - - - 0x02C36F 0B:835F: A0        .byte $A0   ; 01
- D 0 - - - 0x02C370 0B:8360: 55        .byte $55   ; 02
- D 0 - - - 0x02C371 0B:8361: AA        .byte $AA   ; 03



tbl_8362:
- D 0 - - - 0x02C372 0B:8362: 04        .byte $04   ; 00
- D 0 - - - 0x02C373 0B:8363: 07        .byte $07   ; 01

tbl_8364:
- D 0 - - - 0x02C374 0B:8364: 03        .byte $03   ; 00
- D 0 - - - 0x02C375 0B:8365: 06        .byte $06   ; 01



tbl_8366:
- D 0 - - - 0x02C376 0B:8366: 16        .byte $16   ; 00
- D 0 - - - 0x02C377 0B:8367: 17        .byte $17   ; 01
- D 0 - - - 0x02C378 0B:8368: 16        .byte $16   ; 02
- D 0 - - - 0x02C379 0B:8369: 1A        .byte $1A   ; 03



_off006_0x02C37A_02:
- D 0 - I - 0x02C37A 0B:836A: 00        .byte $00, $20, $7E, $00, $7E, $00, $7E, $00, $4D, $00, $CC, $01, $86, $07, $0D, $0E   ; 
- D 0 - I - 0x02C38A 0B:837A: 0D        .byte $0D, $2A, $2B, $0E, $00, $C4, $0F, $83, $15, $13, $14, $C4, $16, $87, $0C, $14   ; 
- D 0 - I - 0x02C39A 0B:838A: 1A        .byte $1A, $1B, $2C, $0F, $2E, $0E, $00, $CC, $1C, $86, $22, $28, $29, $2D, $1C, $2F   ; 
- D 0 - I - 0x02C3AA 0B:839A: 7E        .byte $7E, $00, $7E, $00, $7E, $00, $2D, $00, $40, $FF, $FF   ; 



_off006_0x02C3B5_01:
- D 0 - I - 0x02C3B5 0B:83A5: 00        .byte $00, $20, $49, $00, $C7, $31, $83, $92, $93, $92, $C4, $94, $12, $00, $C7, $38   ; 
- D 0 - I - 0x02C3C5 0B:83B5: C9        .byte $C9, $98, $0F, $00, $C8, $3F, $C9, $A1, $0E, $00, $C9, $47, $C8, $AA, $10, $00   ; 
- D 0 - I - 0x02C3D5 0B:83C5: C8        .byte $C8, $50, $C8, $B2, $11, $00, $C3, $58, $09, $00, $C3, $BA, $10, $00, $C8, $5B   ; 
- D 0 - I - 0x02C3E5 0B:83D5: CD        .byte $CD, $BD, $08, $00, $CB, $63, $CC, $CA, $0A, $00, $CA, $6E, $CA, $D6, $0C, $00   ; 
- D 0 - I - 0x02C3F5 0B:83E5: CA        .byte $CA, $78, $CA, $E0, $0B, $00, $C3, $82, $04, $00, $C4, $85, $C6, $EA, $84, $00   ; 
- D 0 - I - 0x02C405 0B:83F5: 00        .byte $00, $F0, $90, $0B, $00, $81, $89, $05, $00, $C5, $8A, $C6, $F1, $86, $00, $00   ; 
- D 0 - I - 0x02C415 0B:8405: F7        .byte $F7, $00, $FA, $FB, $0F, $00, $8B, $8F, $90, $00, $00, $91, $00, $00, $F8, $90   ; 
- D 0 - I - 0x02C425 0B:8415: 00        .byte $00, $F9, $7E, $00, $7E, $00, $7E, $00, $70, $00, $82, $0F, $03, $0E, $00, $83   ; 
- D 0 - I - 0x02C435 0B:8425: A5        .byte $A5, $A5, $65, $03, $55, $82, $A5, $A5, $06, $AA, $82, $A2, $AA, $20, $FF, $FF   ; 



_off006_0x02C445_06:
- D 0 - I - 0x02C445 0B:8435: 00        .byte $00, $20, $7E, $00, $05, $00, $81, $4F, $0B, $3F, $82, $00, $00, $0B, $3F, $81   ; 
- D 0 - I - 0x02C455 0B:8445: 47        .byte $47, $7F   ; общие данные
_off006_0x02C457_0F:
- D 0 - I - 0x02C457 0B:8447: 2C        .byte $2C, $23, $C5, $31, $81, $36, $C4, $2A, $16, $00, $C6, $41, $C3, $2E, $81, $40   ; 
- D 0 - I - 0x02C467 0B:8457: 15        .byte $15, $00, $CB, $50, $16, $00, $CA, $61, $FF   ; 



_off006_0x02C470_04:
- D 0 - I - 0x02C470 0B:8460: 00        .byte $00, $20, $7E, $00, $42, $00, $C3, $01, $0D, $03, $C3, $01, $0D, $03, $82, $04   ; 
- D 0 - I - 0x02C480 0B:8470: 05        .byte $05, $0E, $03, $82, $04, $05, $0E, $03, $84, $06, $07, $03, $03, $C3, $08, $09   ; 
- D 0 - I - 0x02C490 0B:8480: 03        .byte $03, $84, $06, $07, $03, $03, $C3, $08, $09, $03, $CB, $0B, $81, $15, $C3, $15   ; 
- D 0 - I - 0x02C4A0 0B:8490: 81        .byte $81, $15, $C8, $0B, $08, $15, $86, $18, $0C, $00, $19, $1A, $10, $C9, $1B, $89   ; 
- D 0 - I - 0x02C4B0 0B:84A0: 1F        .byte $1F, $18, $0C, $00, $19, $1A, $10, $1B, $1C, $08, $20, $8A, $24, $0C, $00, $25   ; 
- D 0 - I - 0x02C4C0 0B:84B0: 00        .byte $00, $00, $26, $27, $06, $07, $C3, $28, $8B, $10, $2B, $2C, $24, $0C, $00, $25   ; 
- D 0 - I - 0x02C4D0 0B:84C0: 00        .byte $00, $00, $26, $27, $08, $20, $84, $24, $0C, $2D, $00, $C3, $2E, $8D, $27, $24   ; 
- D 0 - I - 0x02C4E0 0B:84D0: 0C        .byte $0C, $00, $31, $32, $10, $1B, $1C, $24, $0C, $2D, $00, $C3, $2E, $81, $27, $C3   ; 
- D 0 - I - 0x02C4F0 0B:84E0: 3F        .byte $3F, $05, $20, $8C, $00, $33, $34, $00, $35, $36, $30, $27, $2D, $37, $00, $00   ; 
- D 0 - I - 0x02C500 0B:84F0: C3        .byte $C3, $38, $8B, $27, $00, $33, $34, $00, $35, $36, $30, $27, $33, $00, $C3, $42   ; 
- D 0 - I - 0x02C510 0B:8500: 03        .byte $03, $44, $82, $3B, $3C, $03, $00, $8D, $3B, $00, $27, $00, $00, $3C, $00, $00   ; 
- D 0 - I - 0x02C520 0B:8510: 3C        .byte $3C, $00, $27, $3B, $3C, $03, $00, $87, $3B, $00, $27, $3C, $00, $45, $00, $C4   ; 
- D 0 - I - 0x02C530 0B:8520: 46        .byte $46, $83, $00, $00, $3D, $08, $00, $83, $3C, $00, $3E, $04, $00, $81, $3D, $06   ; 
- D 0 - I - 0x02C540 0B:8530: 00        .byte $00, $82, $3D, $3B, $05, $00, $C6, $73, $83, $78, $78, $79, $C3, $74, $C6, $73   ; 
- D 0 - I - 0x02C550 0B:8540: 83        .byte $83, $78, $78, $79, $C3, $74, $C6, $73, $84, $78, $78, $7A, $7B, $C7, $7B, $85   ; 
- D 0 - I - 0x02C560 0B:8550: 7B        .byte $7B, $7B, $7C, $7A, $7B, $C7, $7B, $85, $7B, $7B, $7C, $7A, $7B, $C6, $7B, $81   ; 
- D 0 - I - 0x02C570 0B:8560: 82        .byte $82, $03, $83, $C5, $84, $03, $83, $81, $82, $03, $83, $C5, $84, $03, $83, $81   ; 
- D 0 - I - 0x02C580 0B:8570: 82        .byte $82, $03, $83, $C4, $84, $C3, $89, $C6, $8B, $83, $8B, $8B, $91, $C3, $89, $C6   ; 
- D 0 - I - 0x02C590 0B:8580: 8B        .byte $8B, $03, $8B, $C3, $89, $81, $91, $C4, $8C, $08, $92, $C3, $93, $82, $94, $96   ; 
- D 0 - I - 0x02C5A0 0B:8590: 06        .byte $06, $92, $82, $A5, $A6, $07, $92, $81, $A7, $03, $92, $05, $97, $86, $98, $97   ; 
- D 0 - I - 0x02C5B0 0B:85A0: 99        .byte $99, $9A, $99, $9B, $06, $97, $88, $A8, $97, $A9, $97, $A9, $97, $97, $98, $03   ; 
- D 0 - I - 0x02C5C0 0B:85B0: 97        .byte $97, $81, $AA, $03, $97, $05, $9C, $C3, $9D, $82, $9E, $A0, $08, $9C, $84, $AB   ; 
- D 0 - I - 0x02C5D0 0B:85C0: A0        .byte $A0, $AB, $A0, $06, $9C, $81, $AC, $03, $9C, $04, $03, $86, $A1, $A2, $A1, $A2   ; 
- D 0 - I - 0x02C5E0 0B:85D0: 03        .byte $03, $A3, $04, $03, $81, $A4, $03, $03, $82, $AD, $A4, $08, $03, $84, $AE, $03   ; 
- D 0 - I - 0x02C5F0 0B:85E0: 03        .byte $03, $A3, $7E, $00, $42, $00, $08, $FF, $08, $AF, $08, $AA, $88, $FA, $BA, $FA   ; 
- D 0 - I - 0x02C600 0B:85F0: BA        .byte $BA, $FA, $BA, $FA, $AA, $08, $55, $08, $00, $10, $FF, $7F, $00, $24, $7E, $00   ; 
- D 0 - I - 0x02C610 0B:8600: 42        .byte $42, $00, $04, $03, $82, $4A, $4B, $04, $03, $82, $4C, $4D, $0C, $03, $08, $00   ; 
- D 0 - I - 0x02C620 0B:8610: 04        .byte $04, $03, $82, $4E, $4F, $04, $03, $82, $50, $51, $0C, $03, $08, $00, $04, $03   ; 
- D 0 - I - 0x02C630 0B:8620: 82        .byte $82, $52, $53, $04, $03, $82, $54, $55, $0C, $03, $08, $00, $04, $15, $82, $56   ; 
- D 0 - I - 0x02C640 0B:8630: 57        .byte $57, $12, $15, $08, $00, $04, $20, $82, $58, $59, $0B, $20, $87, $6D, $6E, $20   ; 
- D 0 - I - 0x02C650 0B:8640: 20        .byte $20, $6D, $6E, $20, $08, $00, $04, $20, $82, $5A, $5B, $09, $20, $89, $41, $3F   ; 
- D 0 - I - 0x02C660 0B:8650: 6F        .byte $6F, $40, $41, $3F, $6F, $40, $41, $08, $00, $04, $20, $C3, $5C, $07, $20, $8A   ; 
- D 0 - I - 0x02C670 0B:8660: 41        .byte $41, $5F, $70, $00, $00, $71, $70, $00, $00, $71, $08, $00, $03, $44, $C4, $60   ; 
- D 0 - I - 0x02C680 0B:8670: 83        .byte $83, $41, $64, $41, $C3, $65, $04, $00, $86, $72, $33, $00, $00, $72, $33, $09   ; 
- D 0 - I - 0x02C690 0B:8680: 00        .byte $00, $84, $47, $68, $69, $00, $C3, $6A, $03, $00, $82, $3C, $45, $04, $00, $87   ; 
- D 0 - I - 0x02C6A0 0B:8690: 45        .byte $45, $00, $45, $00, $45, $00, $45, $11, $00, $81, $3C, $04, $00, $81, $45, $03   ; 
- D 0 - I - 0x02C6B0 0B:86A0: 00        .byte $00, $81, $3D, $03, $00, $81, $3D, $0A, $00, $81, $79, $C3, $74, $C6, $73, $83   ; 
- D 0 - I - 0x02C6C0 0B:86B0: 78        .byte $78, $78, $79, $C3, $74, $C6, $73, $82, $78, $78, $08, $00, $86, $81, $7B, $7B   ; 
- D 0 - I - 0x02C6D0 0B:86C0: 7C        .byte $7C, $7A, $7B, $C7, $7B, $85, $7B, $7B, $7C, $7A, $7B, $C6, $7B, $08, $00, $81   ; 
- D 0 - I - 0x02C6E0 0B:86D0: 88        .byte $88, $03, $83, $81, $82, $03, $83, $C5, $84, $03, $83, $81, $82, $03, $83, $C4   ; 
- D 0 - I - 0x02C6F0 0B:86E0: 84        .byte $84, $08, $00, $84, $90, $8A, $8B, $91, $C3, $89, $C6, $8B, $83, $8B, $8B, $91   ; 
- D 0 - I - 0x02C700 0B:86F0: C3        .byte $C3, $89, $81, $91, $C4, $8C, $08, $00, $04, $92, $81, $AF, $07, $92, $84, $B0   ; 
- D 0 - I - 0x02C710 0B:8700: B1        .byte $B1, $B0, $B1, $10, $92, $8A, $97, $97, $B2, $B3, $B2, $B3, $97, $98, $97, $A8   ; 
- D 0 - I - 0x02C720 0B:8710: 03        .byte $03, $97, $84, $B4, $B5, $B4, $B5, $0F, $97, $03, $9C, $83, $B6, $9C, $B6, $09   ; 
- D 0 - I - 0x02C730 0B:8720: 9C        .byte $9C, $84, $B7, $BA, $B7, $BA, $0D, $9C, $05, $03, $82, $B8, $B9, $04, $03, $8C   ; 
- D 0 - I - 0x02C740 0B:8730: A4        .byte $A4, $03, $03, $A3, $03, $BB, $BC, $BB, $BC, $03, $03, $A4, $09, $03, $7E, $00   ; 
- D 0 - I - 0x02C750 0B:8740: 42        .byte $42, $00, $08, $FF, $06, $AF, $82, $FF, $FF, $06, $AA, $84, $FF, $FF, $AA, $AA   ; 
- D 0 - I - 0x02C760 0B:8750: 04        .byte $04, $FA, $82, $FF, $FF, $06, $55, $82, $FF, $FF, $08, $00, $10, $FF, $FF   ; 



_off006_0x02C76F_05:
- D 0 - I - 0x02C76F 0B:875F: 00        .byte $00, $20, $7E, $00, $42, $00, $83, $01, $02, $00, $C4, $03, $03, $00, $C4, $03   ; 
- D 0 - I - 0x02C77F 0B:876F: 81        .byte $81, $00, $C3, $00, $82, $00, $00, $C5, $35, $05, $39, $82, $3A, $00, $CA, $07   ; 
- D 0 - I - 0x02C78F 0B:877F: C4        .byte $C4, $0A, $84, $11, $12, $07, $08, $C7, $3B, $05, $41, $82, $42, $3B, $CB, $13   ; 
- D 0 - I - 0x02C79F 0B:878F: C3        .byte $C3, $17, $C4, $11, $C3, $43, $83, $38, $46, $47, $04, $00, $C4, $48, $82, $07   ; 
- D 0 - I - 0x02C7AF 0B:879F: 08        .byte $08, $C4, $1E, $03, $1A, $81, $1E, $C3, $22, $89, $1A, $11, $12, $07, $08, $00   ; 
- D 0 - I - 0x02C7BF 0B:87AF: 00        .byte $00, $3F, $40, $C4, $4C, $82, $00, $00, $C4, $50, $82, $07, $08, $0C, $1A, $8A   ; 
- D 0 - I - 0x02C7CF 0B:87BF: 11        .byte $11, $12, $07, $08, $00, $54, $55, $00, $00, $56, $08, $00, $C3, $25, $0B, $27   ; 
- D 0 - I - 0x02C7DF 0B:87CF: 89        .byte $89, $28, $29, $25, $26, $57, $58, $57, $00, $59, $09, $00, $83, $07, $08, $1A   ; 
- D 0 - I - 0x02C7EF 0B:87DF: C3        .byte $C3, $2A, $05, $1A, $8C, $2A, $2B, $1A, $11, $12, $07, $08, $58, $57, $00, $5A   ; 
- D 0 - I - 0x02C7FF 0B:87EF: 5B        .byte $5B, $09, $00, $85, $2D, $14, $1A, $2E, $2F, $03, $1A, $8E, $2A, $2B, $1A, $2E   ; 
- D 0 - I - 0x02C80F 0B:87FF: 2F        .byte $2F, $1A, $11, $12, $2D, $14, $57, $58, $00, $5C, $0A, $00, $82, $07, $08, $06   ; 
- D 0 - I - 0x02C81F 0B:880F: 1A        .byte $1A, $82, $2E, $2F, $04, $1A, $84, $11, $12, $07, $08, $C4, $5D, $0A, $00, $C4   ; 
- D 0 - I - 0x02C82F 0B:881F: 30        .byte $30, $8F, $32, $33, $32, $33, $32, $33, $32, $33, $32, $33, $32, $34, $30, $31   ; 
- D 0 - I - 0x02C83F 0B:882F: 61        .byte $61, $C3, $61, $0A, $00, $C6, $81, $C6, $81, $C6, $81, $C6, $81, $C6, $81, $9E   ; 
- D 0 - I - 0x02C84F 0B:883F: 84        .byte $84, $85, $87, $88, $87, $89, $87, $88, $87, $89, $87, $88, $87, $89, $87, $88   ; 
- D 0 - I - 0x02C85F 0B:884F: 87        .byte $87, $89, $87, $88, $87, $89, $87, $88, $87, $89, $87, $88, $87, $89, $C3, $87   ; 
- D 0 - I - 0x02C86F 0B:885F: 81        .byte $81, $87, $C4, $8A, $C4, $8A, $C4, $8A, $C4, $8A, $C4, $8A, $C4, $8A, $C4, $8A   ; 
- D 0 - I - 0x02C87F 0B:886F: C8        .byte $C8, $8A, $C4, $8E, $C4, $8E, $C4, $8E, $C4, $8E, $C4, $8E, $C4, $8E, $C6, $8E   ; 
- D 0 - I - 0x02C88F 0B:887F: 83        .byte $83, $92, $94, $92, $C3, $95, $82, $92, $92, $C4, $98, $92, $94, $92, $95, $96   ; 
- D 0 - I - 0x02C89F 0B:888F: 92        .byte $92, $A1, $9A, $94, $92, $95, $96, $92, $97, $92, $A2, $92, $94, $92, $04, $9C   ; 
- D 0 - I - 0x02C8AF 0B:889F: 81        .byte $81, $9D, $04, $9C, $82, $9E, $9F, $04, $9C, $81, $9D, $03, $9C, $84, $A3, $9C   ; 
- D 0 - I - 0x02C8BF 0B:88AF: 9C        .byte $9C, $9D, $05, $9C, $8B, $A4, $9C, $9C, $9D, $92, $92, $A0, $92, $95, $96, $92   ; 
- D 0 - I - 0x02C8CF 0B:88BF: C3        .byte $C3, $98, $8B, $92, $94, $92, $95, $96, $A0, $92, $92, $A1, $9A, $93, $03, $92   ; 
- D 0 - I - 0x02C8DF 0B:88CF: 88        .byte $88, $94, $92, $95, $96, $A2, $95, $96, $A0, $06, $9C, $82, $9E, $9F, $04, $9C   ; 
- D 0 - I - 0x02C8EF 0B:88DF: 81        .byte $81, $9D, $05, $9C, $81, $A3, $06, $9C, $84, $9D, $9C, $9C, $A4, $03, $9C, $7E   ; 
- D 0 - I - 0x02C8FF 0B:88EF: 00        .byte $00, $42, $00, $08, $FF, $81, $4F, $03, $5F, $81, $4F, $03, $5F, $81, $44, $03   ; 
- D 0 - I - 0x02C90F 0B:88FF: 55        .byte $55, $85, $88, $A5, $A6, $A5, $44, $03, $55, $81, $88, $03, $AA, $08, $50, $08   ; 
- D 0 - I - 0x02C91F 0B:890F: 00        .byte $00, $10, $FF, $7F, $00, $24, $7E, $00, $44, $00, $88, $64, $00, $65, $66, $00   ; 
- D 0 - I - 0x02C92F 0B:891F: 00        .byte $00, $07, $08, $05, $67, $83, $68, $07, $08, $05, $67, $81, $68, $08, $00, $82   ; 
- D 0 - I - 0x02C93F 0B:892F: 69        .byte $69, $3C, $C4, $6A, $84, $3B, $3C, $07, $08, $05, $6E, $83, $6F, $07, $08, $05   ; 
- D 0 - I - 0x02C94F 0B:893F: 6E        .byte $6E, $81, $6F, $08, $00, $8A, $70, $39, $71, $39, $72, $73, $43, $44, $13, $14   ; 
- D 0 - I - 0x02C95F 0B:894F: 05        .byte $05, $74, $C3, $12, $06, $74, $08, $00, $81, $75, $03, $41, $86, $76, $77, $00   ; 
- D 0 - I - 0x02C96F 0B:895F: 00        .byte $00, $07, $08, $04, $1A, $84, $11, $12, $07, $08, $05, $1A, $81, $11, $0B, $00   ; 
- D 0 - I - 0x02C97F 0B:896F: 82        .byte $82, $54, $55, $03, $00, $82, $07, $08, $04, $1A, $84, $11, $12, $07, $08, $05   ; 
- D 0 - I - 0x02C98F 0B:897F: 1A        .byte $1A, $81, $11, $0A, $00, $86, $57, $58, $57, $58, $00, $00, $C3, $25, $03, $27   ; 
- D 0 - I - 0x02C99F 0B:898F: 82        .byte $82, $28, $29, $C3, $25, $05, $27, $09, $00, $97, $78, $58, $57, $58, $57, $00   ; 
- D 0 - I - 0x02C9AF 0B:899F: 00        .byte $00, $07, $08, $1A, $1A, $2A, $2B, $11, $12, $07, $08, $1A, $1A, $2A, $2B, $11   ; 
- D 0 - I - 0x02C9BF 0B:89AF: 12        .byte $12, $09, $00, $97, $79, $57, $58, $57, $58, $00, $00, $2D, $14, $1A, $1A, $2E   ; 
- D 0 - I - 0x02C9CF 0B:89BF: 2F        .byte $2F, $11, $12, $2D, $14, $1A, $1A, $2E, $2F, $11, $12, $09, $00, $C4, $7A, $85   ; 
- D 0 - I - 0x02C9DF 0B:89CF: 7C        .byte $7C, $7E, $00, $07, $08, $04, $1A, $84, $11, $12, $07, $08, $04, $1A, $82, $11   ; 
- D 0 - I - 0x02C9EF 0B:89DF: 12        .byte $12, $09, $00, $81, $7F, $04, $61, $82, $80, $00, $C4, $30, $84, $32, $33, $32   ; 
- D 0 - I - 0x02C9FF 0B:89EF: 34        .byte $34, $C4, $30, $84, $32, $33, $32, $34, $08, $00, $81, $86, $C3, $84, $C3, $84   ; 
- D 0 - I - 0x02CA0F 0B:89FF: C3        .byte $C3, $84, $C6, $81, $C6, $81, $82, $81, $82, $08, $00, $82, $88, $89, $C3, $87   ; 
- D 0 - I - 0x02CA1F 0B:8A0F: C3        .byte $C3, $87, $90, $87, $88, $87, $89, $87, $88, $87, $89, $87, $88, $87, $89, $87   ; 
- D 0 - I - 0x02CA2F 0B:8A1F: 88        .byte $88, $87, $89, $08, $00, $C4, $8A, $C4, $8A, $C4, $8A, $C4, $8A, $C4, $8A, $C4   ; 
- D 0 - I - 0x02CA3F 0B:8A2F: 8A        .byte $8A, $86, $8C, $8D, $8C, $8D, $8C, $8D, $C6, $8C, $C4, $8E, $C4, $8E, $C4, $8E   ; 
- D 0 - I - 0x02CA4F 0B:8A3F: C4        .byte $C4, $8E, $C4, $8E, $A8, $90, $91, $90, $91, $90, $91, $90, $91, $95, $92, $93   ; 
- D 0 - I - 0x02CA5F 0B:8A4F: 92        .byte $92, $A5, $92, $94, $92, $95, $96, $A0, $92, $A6, $A7, $92, $92, $A0, $92, $92   ; 
- D 0 - I - 0x02CA6F 0B:8A5F: 94        .byte $94, $92, $93, $92, $94, $92, $95, $92, $92, $94, $92, $95, $92, $04, $9C, $84   ; 
- D 0 - I - 0x02CA7F 0B:8A6F: A8        .byte $A8, $9C, $9C, $9D, $05, $9C, $82, $A9, $AA, $09, $9C, $81, $9D, $04, $9C, $89   ; 
- D 0 - I - 0x02CA8F 0B:8A7F: 9D        .byte $9D, $9C, $9C, $92, $92, $94, $92, $95, $A5, $03, $92, $8E, $94, $92, $95, $92   ; 
- D 0 - I - 0x02CA9F 0B:8A8F: 9B        .byte $9B, $92, $A6, $A7, $92, $92, $94, $94, $92, $95, $04, $92, $85, $93, $92, $97   ; 
- D 0 - I - 0x02CAAF 0B:8A9F: 92        .byte $92, $92, $03, $9C, $83, $9D, $9C, $A8, $04, $9C, $81, $9D, $05, $9C, $82, $A9   ; 
- D 0 - I - 0x02CABF 0B:8AAF: AA        .byte $AA, $03, $9C, $81, $9D, $0A, $9C, $7E, $00, $42, $00, $08, $FF, $82, $5F, $5F   ; 
- D 0 - I - 0x02CACF 0B:8ABF: 04        .byte $04, $0F, $92, $FF, $FF, $A5, $A9, $44, $55, $44, $55, $FF, $FF, $AA, $AA, $44   ; 
- D 0 - I - 0x02CADF 0B:8ACF: 55        .byte $55, $44, $55, $FF, $FF, $06, $50, $82, $5F, $5F, $08, $00, $10, $FF, $FF   ; 


; bzk garbage
- - - - - - 0x02CAEE 0B:8ADE: FF        .byte $FF, $FF   ; 
- - - - - - 0x02CAF0 0B:8AE0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CB00 0B:8AF0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CB10 0B:8B00: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CB20 0B:8B10: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CB30 0B:8B20: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CB40 0B:8B30: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CB50 0B:8B40: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CB60 0B:8B50: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CB70 0B:8B60: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CB80 0B:8B70: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CB90 0B:8B80: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CBA0 0B:8B90: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CBB0 0B:8BA0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CBC0 0B:8BB0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CBD0 0B:8BC0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02CBE0 0B:8BD0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



_off006_0x02CBEB_07:
- D 0 - I - 0x02CBEB 0B:8BDB: 00        .byte $00, $20, $7E, $00, $42, $00, $13, $01, $C4, $3D, $85, $00, $40, $40, $00, $3F   ; 
- D 0 - I - 0x02CBFB 0B:8BEB: 04        .byte $04, $00, $03, $02, $C4, $03, $81, $02, $C4, $07, $88, $02, $0B, $05, $05, $06   ; 
- D 0 - I - 0x02CC0B 0B:8BFB: 41        .byte $41, $42, $3D, $C4, $43, $84, $45, $45, $46, $44, $C4, $47, $03, $02, $85, $0C   ; 
- D 0 - I - 0x02CC1B 0B:8C0B: 0D        .byte $0D, $0D, $0E, $02, $C4, $0F, $87, $02, $0C, $0D, $0D, $0E, $4B, $4C, $C3, $3D   ; 
- D 0 - I - 0x02CC2B 0B:8C1B: 86        .byte $86, $4D, $4E, $4D, $4F, $50, $3F, $C4, $51, $03, $02, $84, $0C, $0D, $0D, $0E   ; 
- D 0 - I - 0x02CC3B 0B:8C2B: C6        .byte $C6, $13, $8F, $0C, $0D, $0D, $0E, $55, $56, $3D, $43, $44, $57, $58, $57, $59   ; 
- D 0 - I - 0x02CC4B 0B:8C3B: 46        .byte $46, $44, $C4, $5A, $03, $19, $85, $1A, $1B, $1B, $1C, $19, $C4, $1D, $C3, $19   ; 
- D 0 - I - 0x02CC5B 0B:8C4B: 8E        .byte $8E, $1B, $1C, $19, $19, $5E, $3E, $3F, $00, $4D, $4E, $5F, $5F, $3F, $5A, $C3   ; 
- D 0 - I - 0x02CC6B 0B:8C5B: 60        .byte $60, $03, $19, $85, $1A, $1B, $1B, $1C, $19, $C4, $21, $C3, $19, $91, $1B, $1C   ; 
- D 0 - I - 0x02CC7B 0B:8C6B: 19        .byte $19, $19, $5E, $43, $44, $46, $57, $58, $63, $63, $44, $64, $65, $52, $52, $03   ; 
- D 0 - I - 0x02CC8B 0B:8C7B: 19        .byte $19, $84, $25, $26, $26, $27, $06, $19, $87, $25, $26, $26, $27, $19, $19, $5E   ; 
- D 0 - I - 0x02CC9B 0B:8C8B: C3        .byte $C3, $66, $81, $68, $03, $00, $81, $3F, $04, $00, $05, $19, $C3, $28, $8C, $29   ; 
- D 0 - I - 0x02CCAB 0B:8C9B: 2A        .byte $2A, $29, $2B, $2C, $2C, $2D, $2C, $2C, $69, $19, $5E, $C3, $6A, $85, $6C, $6D   ; 
- D 0 - I - 0x02CCBB 0B:8CAB: 6D        .byte $6D, $00, $6E, $04, $00, $85, $2E, $2F, $2E, $2F, $2E, $C3, $30, $8D, $31, $32   ; 
- D 0 - I - 0x02CCCB 0B:8CBB: 31        .byte $31, $33, $34, $34, $35, $34, $34, $6F, $70, $5E, $71, $0B, $72, $85, $2F, $2E   ; 
- D 0 - I - 0x02CCDB 0B:8CCB: 2F        .byte $2F, $2E, $2F, $C3, $36, $83, $37, $38, $37, $C4, $39, $85, $3B, $3B, $73, $74   ; 
- D 0 - I - 0x02CCEB 0B:8CDB: 5E        .byte $5E, $C3, $75, $81, $75, $C3, $75, $81, $75, $C3, $75, $86, $75, $2E, $2F, $2E   ; 
- D 0 - I - 0x02CCFB 0B:8CEB: 2F        .byte $2F, $2E, $C3, $7F, $C8, $80, $C3, $A1, $81, $5E, $C3, $A4, $81, $A4, $C3, $A4   ; 
- D 0 - I - 0x02CD0B 0B:8CFB: 81        .byte $81, $A4, $C3, $A4, $89, $A4, $2F, $2E, $2F, $2E, $2F, $2E, $88, $89, $C6, $88   ; 
- D 0 - I - 0x02CD1B 0B:8D0B: 82        .byte $82, $02, $02, $C3, $A7, $8D, $5E, $AA, $AB, $A4, $A4, $AA, $AB, $A4, $A4, $AA   ; 
- D 0 - I - 0x02CD2B 0B:8D1B: AB        .byte $AB, $A4, $A4, $0A, $8E, $C5, $8F, $81, $93, $C4, $AC, $C3, $AF, $81, $AF, $C3   ; 
- D 0 - I - 0x02CD3B 0B:8D2B: AF        .byte $AF, $81, $AF, $C3, $AF, $81, $AF, $0A, $94, $C5, $95, $81, $99, $C3, $B2, $0D   ; 
- D 0 - I - 0x02CD4B 0B:8D3B: 94        .byte $94, $0F, $9A, $81, $9B, $0C, $9A, $81, $B5, $03, $9A, $0F, $9C, $81, $9D, $0C   ; 
- D 0 - I - 0x02CD5B 0B:8D4B: 9C        .byte $9C, $81, $B6, $03, $9C, $0E, $9E, $81, $9F, $0D, $9E, $81, $B7, $03, $9E, $0E   ; 
- D 0 - I - 0x02CD6B 0B:8D5B: 19        .byte $19, $81, $A0, $0D, $19, $81, $B8, $03, $19, $7E, $00, $42, $00, $08, $FF, $05   ; 
- D 0 - I - 0x02CD7B 0B:8D6B: AF        .byte $AF, $87, $0F, $0F, $AF, $00, $22, $00, $88, $03, $00, $81, $AA, $10, $00, $08   ; 
- D 0 - I - 0x02CD8B 0B:8D7B: 55        .byte $55, $10, $FF, $7F, $00, $24, $7E, $00, $44, $00, $8D, $3F, $00, $5F, $40, $3F   ; 
- D 0 - I - 0x02CD9B 0B:8D8B: 00        .byte $00, $5F, $00, $5F, $40, $3F, $3E, $3D, $09, $01, $08, $00, $91, $78, $79, $44   ; 
- D 0 - I - 0x02CDAB 0B:8D9B: 46        .byte $46, $63, $45, $44, $46, $63, $46, $63, $45, $44, $43, $3D, $41, $42, $C4, $03   ; 
- D 0 - I - 0x02CDBB 0B:8DAB: 83        .byte $83, $02, $07, $08, $08, $00, $98, $52, $7A, $3F, $40, $00, $40, $3F, $00, $40   ; 
- D 0 - I - 0x02CDCB 0B:8DBB: 00        .byte $00, $40, $40, $3F, $3E, $3D, $4B, $4C, $0C, $0D, $0D, $0E, $02, $0F, $10, $08   ; 
- D 0 - I - 0x02CDDB 0B:8DCB: 00        .byte $00, $82, $7B, $7A, $C3, $44, $90, $45, $44, $46, $45, $46, $45, $45, $44, $43   ; 
- D 0 - I - 0x02CDEB 0B:8DDB: 3D        .byte $3D, $55, $56, $0C, $0D, $0D, $0E, $C3, $13, $08, $00, $90, $7C, $7A, $3F, $4D   ; 
- D 0 - I - 0x02CDFB 0B:8DEB: 4F        .byte $4F, $50, $3F, $40, $00, $4D, $4F, $50, $3F, $3E, $5E, $19, $C3, $19, $85, $1B   ; 
- D 0 - I - 0x02CE0B 0B:8DFB: 1C        .byte $1C, $19, $1D, $1E, $08, $00, $86, $52, $7D, $44, $57, $59, $46, $C3, $44, $87   ; 
- D 0 - I - 0x02CE1B 0B:8E0B: 57        .byte $57, $59, $46, $44, $43, $5E, $19, $C3, $19, $85, $1B, $1C, $19, $21, $22, $0A   ; 
- D 0 - I - 0x02CE2B 0B:8E1B: 00        .byte $00, $86, $3F, $00, $68, $68, $66, $67, $C3, $66, $8A, $66, $67, $00, $5E, $19   ; 
- D 0 - I - 0x02CE3B 0B:8E2B: 19        .byte $19, $25, $26, $26, $27, $03, $19, $0A, $00, $86, $6E, $6D, $6C, $6C, $6A, $6B   ; 
- D 0 - I - 0x02CE4B 0B:8E3B: C3        .byte $C3, $6A, $84, $6A, $6B, $00, $5E, $09, $19, $08, $00, $0D, $72, $8B, $7E, $5E   ; 
- D 0 - I - 0x02CE5B 0B:8E4B: 2E        .byte $2E, $2F, $2E, $2F, $2E, $2F, $2E, $2F, $2E, $08, $00, $C3, $75, $81, $75, $C3   ; 
- D 0 - I - 0x02CE6B 0B:8E5B: 75        .byte $75, $81, $75, $C3, $75, $03, $75, $8A, $5E, $2F, $2E, $2F, $2E, $2F, $2E, $2F   ; 
- D 0 - I - 0x02CE7B 0B:8E6B: 2E        .byte $2E, $2F, $08, $00, $C3, $A4, $81, $A4, $C3, $A4, $81, $A4, $C3, $A4, $03, $A4   ; 
- D 0 - I - 0x02CE8B 0B:8E7B: 8A        .byte $8A, $5E, $2E, $2F, $2E, $2F, $2E, $2F, $2E, $2F, $2E, $08, $00, $8A, $AA, $AB   ; 
- D 0 - I - 0x02CE9B 0B:8E8B: A4        .byte $A4, $A4, $AA, $AB, $A4, $A4, $AA, $AB, $04, $A4, $8A, $5E, $2F, $2E, $2F, $2E   ; 
- D 0 - I - 0x02CEAB 0B:8E9B: 2F        .byte $2F, $2E, $2F, $2E, $2F, $08, $00, $C3, $AF, $81, $AF, $C3, $AF, $81, $AF, $C3   ; 
- D 0 - I - 0x02CEBB 0B:8EAB: AF        .byte $AF, $0D, $AF, $08, $00, $18, $94, $08, $00, $08, $9A, $81, $B9, $17, $9A, $08   ; 
- D 0 - I - 0x02CECB 0B:8EBB: 9C        .byte $9C, $82, $BA, $BB, $16, $9C, $09, $9E, $81, $BC, $16, $9E, $09, $19, $82, $BD   ; 
- D 0 - I - 0x02CEDB 0B:8ECB: BE        .byte $BE, $15, $19, $7E, $00, $42, $00, $08, $FF, $89, $2F, $0F, $0F, $8F, $AF, $AF   ; 
- D 0 - I - 0x02CEEB 0B:8EDB: FF        .byte $FF, $FF, $22, $03, $00, $84, $88, $00, $FF, $FF, $06, $00, $82, $FF, $FF, $06   ; 
- D 0 - I - 0x02CEFB 0B:8EEB: 00        .byte $00, $82, $FF, $FF, $08, $55, $10, $FF, $FF   ; 



_off006_0x02CF04_08:
- D 0 - I - 0x02CF04 0B:8EF4: 00        .byte $00, $20, $7E, $00, $06, $00, $C3, $80, $81, $00, $C6, $84, $8F, $80, $81, $00   ; 
- D 0 - I - 0x02CF14 0B:8F04: 8C        .byte $8C, $8D, $88, $89, $82, $00, $88, $89, $8E, $8F, $A0, $A1, $07, $00, $CA, $90   ; 
- D 0 - I - 0x02CF24 0B:8F14: 8F        .byte $8F, $90, $9B, $00, $9C, $9D, $98, $99, $92, $93, $98, $99, $9E, $9F, $B0, $B1   ; 
- D 0 - I - 0x02CF34 0B:8F24: 46        .byte $46, $00, $83, $96, $8F, $99, $04, $00, $84, $9C, $8B, $9A, $92, $03, $00, $84   ; 
- D 0 - I - 0x02CF44 0B:8F34: 97        .byte $97, $93, $95, $8F, $03, $00, $83, $8E, $99, $98, $28, $00, $86, $01, $02, $09   ; 
- D 0 - I - 0x02CF54 0B:8F44: 0A        .byte $0A, $03, $00, $C3, $00, $84, $09, $0A, $03, $00, $C3, $00, $8A, $1A, $1B, $03   ; 
- D 0 - I - 0x02CF64 0B:8F54: 00        .byte $00, $00, $01, $38, $39, $02, $03, $06, $00, $81, $04, $C4, $0B, $83, $00, $00   ; 
- D 0 - I - 0x02CF74 0B:8F64: 04        .byte $04, $C4, $3A, $83, $00, $00, $04, $C3, $1C, $84, $08, $00, $00, $04, $C3, $2B   ; 
- D 0 - I - 0x02CF84 0B:8F74: 81        .byte $81, $08, $06, $00, $81, $04, $C4, $0F, $83, $00, $00, $04, $C4, $3E, $83, $00   ; 
- D 0 - I - 0x02CF94 0B:8F84: 00        .byte $00, $04, $C4, $1F, $83, $00, $00, $04, $C3, $2E, $81, $08, $06, $00, $81, $04   ; 
- D 0 - I - 0x02CFA4 0B:8F94: C4        .byte $C4, $13, $83, $00, $00, $04, $C4, $42, $83, $00, $00, $04, $C4, $23, $83, $00   ; 
- D 0 - I - 0x02CFB4 0B:8FA4: 00        .byte $00, $04, $C3, $31, $81, $08, $06, $00, $82, $05, $06, $C3, $17, $84, $00, $00   ; 
- D 0 - I - 0x02CFC4 0B:8FB4: 05        .byte $05, $06, $C3, $46, $83, $00, $00, $05, $C4, $27, $83, $00, $00, $05, $C4, $34   ; 
- D 0 - I - 0x02CFD4 0B:8FC4: 49        .byte $49, $00, $85, $8D, $8B, $9D, $8F, $A3, $03, $00, $83, $92, $99, $9E, $05, $00   ; 
- D 0 - I - 0x02CFE4 0B:8FD4: 85        .byte $85, $9D, $92, $9C, $8F, $8E, $2B, $00, $85, $01, $02, $49, $4A, $03, $03, $00   ; 
- D 0 - I - 0x02CFF4 0B:8FE4: 81        .byte $81, $01, $C4, $56, $03, $00, $85, $01, $69, $6A, $02, $03, $0B, $00, $85, $04   ; 
- D 0 - I - 0x02D004 0B:8FF4: 00        .byte $00, $4B, $4C, $08, $03, $00, $81, $04, $C4, $5A, $03, $00, $C4, $6B, $81, $08   ; 
- D 0 - I - 0x02D014 0B:9004: 0B        .byte $0B, $00, $81, $04, $C3, $4D, $81, $08, $03, $00, $81, $04, $C4, $5E, $03, $00   ; 
- D 0 - I - 0x02D024 0B:9014: C4        .byte $C4, $6F, $81, $08, $0B, $00, $81, $04, $C3, $50, $81, $08, $03, $00, $81, $04   ; 
- D 0 - I - 0x02D034 0B:9024: C4        .byte $C4, $62, $03, $00, $C4, $73, $81, $08, $0B, $00, $81, $05, $C3, $53, $81, $07   ; 
- D 0 - I - 0x02D044 0B:9034: 03        .byte $03, $00, $82, $05, $06, $C3, $66, $03, $00, $C5, $77, $7E, $00, $57, $00, $30   ; 
- D 0 - I - 0x02D054 0B:9044: FF        .byte $FF, $FF   ; 



_off006_0x02D056_09:
- D 0 - I - 0x02D056 0B:9046: 00        .byte $00, $20, $64, $00, $87, $82, $9A, $96, $8B, $A3, $8F, $9C, $0A, $00, $87, $83   ; 
- D 0 - I - 0x02D066 0B:9056: 9A        .byte $9A, $96, $8B, $A3, $8F, $9C, $7E, $00, $15, $00, $82, $7C, $7D, $1E, $00, $82   ; 
- D 0 - I - 0x02D076 0B:9066: 7E        .byte $7E, $7F, $5B, $00, $88, $9D, $9E, $9C, $8F, $98, $91, $9E, $92, $10, $00, $C7   ; 
- D 0 - I - 0x02D086 0B:9076: 82        .byte $82, $0A, $00, $C7, $82, $4E, $00, $8C, $9D, $9E, $8B, $91, $8F, $00, $9D, $8F   ; 
- D 0 - I - 0x02D096 0B:9086: 96        .byte $96, $8F, $8D, $9E, $77, $00, $C3, $0D, $C3, $80, $10, $00, $CD, $13, $CC, $90   ; 
- D 0 - I - 0x02D0A6 0B:9096: 07        .byte $07, $00, $CD, $23, $CC, $A0, $0E, $00, $C6, $3A, $C6, $B0, $13, $00, $C7, $49   ; 
- D 0 - I - 0x02D0B6 0B:90A6: C7        .byte $C7, $C0, $11, $00, $C8, $58, $C8, $D0, $0A, $00, $CE, $62, $C8, $E0, $0B, $00   ; 
- D 0 - I - 0x02D0C6 0B:90B6: CD        .byte $CD, $73, $CE, $F0, $0A, $00, $10, $88, $28, $00, $09, $FF, $8F, $00, $00, $FF   ; 
- D 0 - I - 0x02D0D6 0B:90C6: FF        .byte $FF, $AA, $AA, $EE, $33, $00, $00, $F7, $FD, $AA, $AA, $EE, $03, $FF, $82, $F5   ; 
- D 0 - I - 0x02D0E6 0B:90D6: F5        .byte $F5, $05, $FF, $03, $F5, $81, $FD, $1A, $FF, $FF   ; 


; bzk garbage
- - - - - - 0x02D0F0 0B:90E0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02D100 0B:90F0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02D110 0B:9100: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02D120 0B:9110: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02D130 0B:9120: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02D140 0B:9130: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



_off006_0x02D14F_0A:
- D 0 - I - 0x02D14F 0B:913F: 00        .byte $00, $20, $7E, $00, $42, $00, $C6, $01, $C9, $01, $0A, $09, $81, $3A, $06, $09   ; 
- D 0 - I - 0x02D15F 0B:914F: C5        .byte $C5, $0A, $81, $01, $C5, $0A, $81, $01, $C4, $0F, $91, $3B, $3C, $11, $12, $3B   ; 
- D 0 - I - 0x02D16F 0B:915F: 3C        .byte $3C, $11, $12, $3B, $18, $11, $12, $3B, $3C, $11, $12, $01, $C5, $13, $81, $01   ; 
- D 0 - I - 0x02D17F 0B:916F: C4        .byte $C4, $13, $C3, $06, $12, $18, $81, $0A, $C4, $19, $82, $01, $0A, $C4, $19, $83   ; 
- D 0 - I - 0x02D18F 0B:917F: 01        .byte $01, $0F, $10, $12, $1D, $81, $01, $C4, $1E, $82, $06, $01, $C4, $1E, $89, $17   ; 
- D 0 - I - 0x02D19F 0B:918F: 07        .byte $07, $08, $22, $23, $3D, $3E, $3E, $3F, $07, $23, $C3, $3D, $83, $23, $23, $0A   ; 
- D 0 - I - 0x02D1AF 0B:919F: C4        .byte $C4, $24, $82, $01, $0A, $C4, $24, $95, $01, $0F, $10, $28, $29, $40, $41, $41   ; 
- D 0 - I - 0x02D1BF 0B:91AF: 42        .byte $42, $29, $40, $40, $43, $40, $40, $29, $44, $41, $42, $40, $43, $C3, $2A, $C3   ; 
- D 0 - I - 0x02D1CF 0B:91BF: 2C        .byte $2C, $C3, $2A, $C3, $2C, $86, $07, $08, $2F, $30, $45, $46, $04, $30, $9B, $47   ; 
- D 0 - I - 0x02D1DF 0B:91CF: 48        .byte $48, $46, $45, $30, $30, $49, $4A, $47, $48, $31, $2A, $2E, $2A, $2E, $2A, $2E   ; 
- D 0 - I - 0x02D1EF 0B:91DF: 2A        .byte $2A, $2E, $2A, $2E, $2A, $0F, $10, $32, $18, $18, $C7, $4B, $81, $4B, $03, $18   ; 
- D 0 - I - 0x02D1FF 0B:91EF: 86        .byte $86, $52, $18, $53, $51, $33, $34, $05, $33, $81, $34, $05, $33, $C3, $34, $83   ; 
- D 0 - I - 0x02D20F 0B:91FF: 46        .byte $46, $30, $30, $C4, $54, $81, $48, $03, $30, $87, $46, $58, $30, $47, $48, $37   ; 
- D 0 - I - 0x02D21F 0B:920F: 38        .byte $38, $05, $37, $81, $38, $05, $37, $84, $38, $39, $18, $4B, $C4, $59, $83, $4B   ; 
- D 0 - I - 0x02D22F 0B:921F: 53        .byte $53, $51, $03, $18, $87, $4B, $18, $18, $53, $51, $37, $38, $05, $37, $81, $38   ; 
- D 0 - I - 0x02D23F 0B:922F: 05        .byte $05, $37, $82, $38, $83, $07, $84, $82, $99, $9A, $06, $84, $84, $99, $9A, $37   ; 
- D 0 - I - 0x02D24F 0B:923F: 38        .byte $38, $05, $37, $81, $38, $05, $37, $83, $38, $85, $86, $C3, $9B, $82, $85, $86   ; 
- D 0 - I - 0x02D25F 0B:924F: C3        .byte $C3, $9B, $82, $85, $86, $C3, $9B, $85, $85, $86, $9B, $37, $38, $05, $37, $82   ; 
- D 0 - I - 0x02D26F 0B:925F: 38        .byte $38, $87, $04, $37, $83, $38, $88, $89, $C3, $9E, $82, $88, $89, $C3, $9E, $82   ; 
- D 0 - I - 0x02D27F 0B:926F: 88        .byte $88, $89, $C3, $9E, $85, $88, $89, $9E, $8A, $8B, $05, $8A, $82, $8B, $8C, $04   ; 
- D 0 - I - 0x02D28F 0B:927F: 8A        .byte $8A, $83, $8B, $8D, $8E, $C3, $A1, $82, $8D, $8E, $C3, $A1, $82, $8D, $8E, $C3   ; 
- D 0 - I - 0x02D29F 0B:928F: A1        .byte $A1, $83, $8D, $8E, $A1, $0A, $8F, $C4, $90, $05, $8F, $82, $A4, $A5, $07, $8F   ; 
- D 0 - I - 0x02D2AF 0B:929F: 81        .byte $81, $A6, $03, $8F, $09, $94, $82, $95, $96, $04, $94, $81, $97, $03, $94, $81   ; 
- D 0 - I - 0x02D2BF 0B:92AF: A7        .byte $A7, $08, $94, $84, $A8, $97, $94, $94, $07, $8F, $C3, $90, $07, $8F, $83, $93   ; 
- D 0 - I - 0x02D2CF 0B:92BF: A9        .byte $A9, $A5, $08, $8F, $84, $A6, $8F, $93, $8F, $06, $94, $84, $95, $96, $94, $98   ; 
- D 0 - I - 0x02D2DF 0B:92CF: 08        .byte $08, $94, $81, $A7, $09, $94, $81, $A8, $03, $94, $7E, $00, $42, $00, $08, $FF   ; 
- D 0 - I - 0x02D2EF 0B:92DF: 08        .byte $08, $5F, $84, $11, $55, $44, $15, $07, $05, $81, $01, $0C, $00, $08, $AA, $10   ; 
- D 0 - I - 0x02D2FF 0B:92EF: FF        .byte $FF, $7F, $00, $24, $7E, $00, $42, $00, $84, $09, $3A, $09, $09, $C4, $5D, $86   ; 
- D 0 - I - 0x02D30F 0B:92FF: 01        .byte $01, $17, $01, $17, $01, $17, $C6, $01, $C4, $01, $08, $00, $8E, $3B, $18, $11   ; 
- D 0 - I - 0x02D31F 0B:930F: 3C        .byte $3C, $61, $62, $5F, $60, $17, $01, $17, $01, $06, $01, $C5, $0A, $81, $01, $C4   ; 
- D 0 - I - 0x02D32F 0B:931F: 0A        .byte $0A, $08, $00, $04, $18, $C4, $5D, $81, $01, $C5, $63, $81, $01, $C5, $13, $81   ; 
- D 0 - I - 0x02D33F 0B:932F: 01        .byte $01, $C3, $13, $08, $00, $04, $1D, $85, $61, $62, $68, $69, $06, $C5, $6A, $81   ; 
- D 0 - I - 0x02D34F 0B:933F: 0A        .byte $0A, $C4, $19, $82, $01, $0A, $C3, $19, $08, $00, $84, $23, $23, $6F, $00, $C4   ; 
- D 0 - I - 0x02D35F 0B:934F: 5D        .byte $5D, $83, $01, $70, $00, $C3, $71, $81, $01, $C4, $1E, $82, $17, $01, $C3, $1E   ; 
- D 0 - I - 0x02D36F 0B:935F: 08        .byte $08, $00, $89, $40, $29, $74, $00, $61, $62, $5F, $60, $17, $C3, $75, $83, $72   ; 
- D 0 - I - 0x02D37F 0B:936F: 73        .byte $73, $0A, $C4, $24, $82, $01, $0A, $C3, $24, $08, $00, $84, $45, $46, $79, $00   ; 
- D 0 - I - 0x02D38F 0B:937F: C4        .byte $C4, $5D, $82, $01, $70, $C3, $7A, $81, $73, $C3, $2A, $C3, $2C, $C3, $2A, $81   ; 
- D 0 - I - 0x02D39F 0B:938F: 2C        .byte $2C, $08, $00, $98, $18, $4B, $53, $00, $61, $62, $5F, $60, $17, $70, $77, $77   ; 
- D 0 - I - 0x02D3AF 0B:939F: 78        .byte $78, $73, $31, $2A, $2E, $2A, $2E, $2A, $2E, $2A, $2E, $2A, $08, $00, $84, $30   ; 
- D 0 - I - 0x02D3BF 0B:93AF: 30        .byte $30, $79, $00, $C4, $5D, $84, $01, $70, $7A, $7B, $C3, $7D, $05, $33, $81, $34   ; 
- D 0 - I - 0x02D3CF 0B:93BF: 03        .byte $03, $82, $08, $00, $8F, $18, $18, $53, $00, $61, $62, $68, $69, $06, $70, $80   ; 
- D 0 - I - 0x02D3DF 0B:93CF: 77        .byte $77, $78, $00, $81, $05, $37, $81, $38, $03, $37, $08, $00, $84, $84, $84, $99   ; 
- D 0 - I - 0x02D3EF 0B:93DF: 00        .byte $00, $C4, $5D, $87, $2A, $70, $00, $AA, $AB, $00, $81, $05, $37, $81, $38, $03   ; 
- D 0 - I - 0x02D3FF 0B:93EF: 37        .byte $37, $08, $00, $89, $9C, $9D, $AC, $00, $61, $62, $5F, $60, $31, $C3, $AD, $83   ; 
- D 0 - I - 0x02D40F 0B:93FF: 00        .byte $00, $00, $81, $05, $37, $81, $38, $03, $37, $08, $00, $83, $9F, $A0, $B0, $03   ; 
- D 0 - I - 0x02D41F 0B:940F: 00        .byte $00, $83, $B1, $B2, $00, $C3, $B3, $84, $00, $00, $81, $87, $04, $37, $81, $38   ; 
- D 0 - I - 0x02D42F 0B:941F: 03        .byte $03, $37, $08, $00, $83, $A2, $A3, $8D, $0B, $00, $82, $B6, $8C, $04, $8A, $81   ; 
- D 0 - I - 0x02D43F 0B:942F: 8B        .byte $8B, $03, $8A, $08, $00, $04, $8F, $81, $B7, $07, $8F, $84, $B8, $B9, $8F, $93   ; 
- D 0 - I - 0x02D44F 0B:943F: 10        .byte $10, $8F, $04, $94, $82, $BA, $BB, $05, $94, $84, $97, $94, $BC, $BD, $06, $94   ; 
- D 0 - I - 0x02D45F 0B:944F: 81        .byte $81, $97, $03, $94, $81, $97, $03, $94, $83, $97, $94, $94, $05, $8F, $81, $B7   ; 
- D 0 - I - 0x02D46F 0B:945F: 09        .byte $09, $8F, $82, $B8, $B9, $0F, $8F, $05, $94, $82, $BA, $BB, $09, $94, $84, $BC   ; 
- D 0 - I - 0x02D47F 0B:946F: BD        .byte $BD, $94, $98, $0C, $94, $7E, $00, $42, $00, $08, $FF, $06, $5F, $83, $FF, $FF   ; 
- D 0 - I - 0x02D48F 0B:947F: 05        .byte $05, $03, $55, $94, $44, $11, $FF, $FF, $00, $55, $55, $15, $05, $05, $FF, $FF   ; 
- D 0 - I - 0x02D49F 0B:948F: 00        .byte $00, $65, $55, $11, $00, $00, $FF, $FF, $08, $AA, $10, $FF, $FF   ; 



_off006_0x02D4AC_0B:
- D 0 - I - 0x02D4AC 0B:949C: 00        .byte $00, $20, $40, $00, $86, $BB, $BA, $BB, $E6, $00, $00, $C4, $A0, $9C, $82, $A5   ; 
- D 0 - I - 0x02D4BC 0B:94AC: 80        .byte $80, $81, $A6, $A7, $84, $85, $A8, $A9, $88, $89, $A6, $A7, $A0, $A1, $00, $00   ; 
- D 0 - I - 0x02D4CC 0B:94BC: AC        .byte $AC, $BA, $BB, $BA, $AA, $AB, $AA, $AB, $E7, $00, $C4, $B0, $9C, $9E, $B5, $90   ; 
- D 0 - I - 0x02D4DC 0B:94CC: 9B        .byte $9B, $B6, $B7, $94, $95, $B8, $B9, $98, $99, $B6, $B7, $B0, $B1, $00, $BC, $AA   ; 
- D 0 - I - 0x02D4EC 0B:94DC: AB        .byte $AB, $AA, $AB, $BA, $BB, $BA, $BB, $BA, $F6, $04, $00, $8C, $88, $AF, $84, $85   ; 
- D 0 - I - 0x02D4FC 0B:94EC: A0        .byte $A0, $A1, $A0, $A1, $82, $00, $88, $89, $04, $00, $8D, $AD, $BB, $BA, $BB, $BA   ; 
- D 0 - I - 0x02D50C 0B:94FC: BB        .byte $BB, $AB, $AA, $AB, $AA, $AB, $AA, $F7, $03, $00, $8C, $98, $BF, $94, $95, $B0   ; 
- D 0 - I - 0x02D51C 0B:950C: B1        .byte $B1, $B0, $B1, $92, $93, $98, $99, $03, $00, $87, $BD, $AB, $AA, $AB, $AA, $AB   ; 
- D 0 - I - 0x02D52C 0B:951C: AA        .byte $AA, $0F, $00, $C3, $CC, $1D, $00, $C4, $DC, $1C, $00, $C3, $E0, $1D, $00, $C3   ; 
- D 0 - I - 0x02D53C 0B:952C: F0        .byte $F0, $3E, $00, $81, $E3, $18, $00, $81, $E4, $06, $F4, $81, $F3, $06, $F4, $81   ; 
- D 0 - I - 0x02D54C 0B:953C: E5        .byte $E5, $11, $00, $81, $CF, $0D, $00, $81, $CF, $11, $00, $81, $CF, $0D, $00, $81   ; 
- D 0 - I - 0x02D55C 0B:954C: CF        .byte $CF, $11, $00, $81, $CF, $0D, $00, $81, $CF, $0D, $00, $81, $E4, $03, $F4, $81   ; 
- D 0 - I - 0x02D56C 0B:955C: F3        .byte $F3, $03, $F4, $81, $E5, $05, $00, $81, $E4, $03, $F4, $81, $F3, $03, $F4, $81   ; 
- D 0 - I - 0x02D57C 0B:956C: E5        .byte $E5, $09, $00, $81, $CF, $07, $00, $81, $CF, $05, $00, $81, $CF, $07, $00, $81   ; 
- D 0 - I - 0x02D58C 0B:957C: CF        .byte $CF, $09, $00, $81, $CF, $07, $00, $81, $CF, $05, $00, $81, $CF, $07, $00, $81   ; 
- D 0 - I - 0x02D59C 0B:958C: CF        .byte $CF, $09, $00, $81, $F5, $07, $00, $81, $F5, $05, $00, $81, $F5, $07, $00, $81   ; 
- D 0 - I - 0x02D5AC 0B:959C: F5        .byte $F5, $7E, $00, $46, $00, $BE, $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB   ; 
- D 0 - I - 0x02D5BC 0B:95AC: AA        .byte $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB   ; 
- D 0 - I - 0x02D5CC 0B:95BC: AA        .byte $AA, $AB, $AA, $AB, $AA, $AB, $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB   ; 
- D 0 - I - 0x02D5DC 0B:95CC: BA        .byte $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB   ; 
- D 0 - I - 0x02D5EC 0B:95DC: BA        .byte $BA, $BB, $BA, $BB, $BE, $BA, $BB, $AB, $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB   ; 
- D 0 - I - 0x02D5FC 0B:95EC: AA        .byte $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB, $AA, $AB   ; 
- D 0 - I - 0x02D60C 0B:95FC: AA        .byte $AA, $AB, $AA, $AB, $AA, $AB, $AA, $BB, $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB   ; 
- D 0 - I - 0x02D61C 0B:960C: BA        .byte $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB, $BA, $BB   ; 
- D 0 - I - 0x02D62C 0B:961C: BA        .byte $BA, $BB, $BA, $84, $BB, $BA, $BB, $BA, $0B, $00, $82, $40, $50, $06, $00, $82   ; 
- D 0 - I - 0x02D63C 0B:962C: 04        .byte $04, $25, $03, $00, $10, $AA, $08, $FF, $08, $0F, $08, $00, $FF   ; 



_off006_0x02D649_0E:
- D 0 - I - 0x02D649 0B:9639: 00        .byte $00, $20, $7E, $00, $43, $00, $BE, $3A, $00, $00, $3B, $3A, $3C, $00, $00, $3A   ; 
- D 0 - I - 0x02D659 0B:9649: 00        .byte $00, $00, $3B, $3A, $3C, $00, $00, $39, $02, $00, $3B, $3A, $3C, $00, $00, $39   ; 
- D 0 - I - 0x02D669 0B:9659: 02        .byte $02, $00, $3B, $3A, $3C, $00, $00, $44, $00, $00, $45, $44, $46, $00, $00, $44   ; 
- D 0 - I - 0x02D679 0B:9669: 00        .byte $00, $00, $45, $44, $46, $00, $39, $02, $02, $00, $45, $44, $46, $00, $39, $02   ; 
- D 0 - I - 0x02D689 0B:9679: 02        .byte $02, $00, $45, $44, $46, $82, $00, $40, $C4, $3D, $C4, $3D, $C4, $3D, $C3, $3D   ; 
- D 0 - I - 0x02D699 0B:9689: 03        .byte $03, $02, $82, $00, $40, $C3, $3D, $03, $02, $82, $00, $40, $C3, $3D, $90, $38   ; 
- D 0 - I - 0x02D6A9 0B:9699: 34        .byte $34, $42, $43, $38, $34, $35, $43, $38, $34, $42, $43, $38, $34, $35, $43, $03   ; 
- D 0 - I - 0x02D6B9 0B:96A9: 02        .byte $02, $85, $00, $38, $34, $35, $43, $03, $02, $85, $00, $38, $34, $35, $43, $10   ; 
- D 0 - I - 0x02D6C9 0B:96B9: 00        .byte $00, $03, $02, $05, $00, $03, $02, $05, $00, $05, $2A, $81, $2B, $0A, $00, $03   ; 
- D 0 - I - 0x02D6D9 0B:96C9: 02        .byte $02, $05, $00, $03, $02, $05, $00, $C4, $30, $82, $30, $2C, $0A, $10, $03, $02   ; 
- D 0 - I - 0x02D6E9 0B:96D9: 81        .byte $81, $00, $04, $10, $03, $02, $81, $00, $04, $10, $81, $30, $C3, $2D, $82, $1C   ; 
- D 0 - I - 0x02D6F9 0B:96E9: 2C        .byte $2C, $0A, $30, $03, $02, $81, $00, $04, $30, $03, $02, $81, $00, $05, $30, $C4   ; 
- D 0 - I - 0x02D709 0B:96F9: 1D        .byte $1D, $9C, $2C, $11, $12, $30, $30, $11, $12, $30, $30, $11, $12, $03, $01, $02   ; 
- D 0 - I - 0x02D719 0B:9709: 00        .byte $00, $30, $30, $11, $12, $03, $01, $02, $00, $30, $30, $11, $12, $30, $C3, $21   ; 
- D 0 - I - 0x02D729 0B:9719: 82        .byte $82, $20, $2C, $C4, $13, $C4, $13, $93, $13, $14, $04, $04, $03, $09, $15, $16   ; 
- D 0 - I - 0x02D739 0B:9729: 13        .byte $13, $14, $04, $04, $03, $09, $15, $16, $13, $14, $30, $C4, $26, $81, $2C, $0A   ; 
- D 0 - I - 0x02D749 0B:9739: 00        .byte $00, $03, $04, $81, $0A, $04, $00, $03, $04, $81, $0A, $04, $00, $05, $30, $84   ; 
- D 0 - I - 0x02D759 0B:9749: 2C        .byte $2C, $00, $00, $17, $03, $00, $81, $17, $03, $00, $03, $04, $82, $0A, $17, $03   ; 
- D 0 - I - 0x02D769 0B:9759: 00        .byte $00, $03, $04, $82, $0A, $17, $03, $00, $05, $30, $82, $2C, $18, $C3, $18, $81   ; 
- D 0 - I - 0x02D779 0B:9769: 18        .byte $18, $C3, $18, $82, $18, $18, $03, $04, $85, $0A, $19, $1A, $18, $18, $03, $04   ; 
- D 0 - I - 0x02D789 0B:9779: 85        .byte $85, $0A, $19, $1A, $18, $18, $05, $30, $84, $2C, $00, $00, $1B, $03, $00, $81   ; 
- D 0 - I - 0x02D799 0B:9789: 1B        .byte $1B, $03, $00, $03, $04, $82, $0A, $1B, $03, $00, $03, $04, $82, $0A, $1B, $03   ; 
- D 0 - I - 0x02D7A9 0B:9799: 00        .byte $00, $10, $05, $84, $07, $04, $04, $0A, $04, $05, $84, $07, $04, $04, $0A, $15   ; 
- D 0 - I - 0x02D7B9 0B:97A9: 05        .byte $05, $83, $07, $04, $0A, $05, $05, $83, $07, $04, $0A, $04, $05, $12, $06, $82   ; 
- D 0 - I - 0x02D7C9 0B:97B9: 08        .byte $08, $0A, $06, $06, $82, $08, $0A, $04, $06, $20, $0B, $7E, $00, $42, $00, $08   ; 
- D 0 - I - 0x02D7D9 0B:97C9: FF        .byte $FF, $08, $0F, $82, $A0, $20, $06, $00, $8A, $AA, $66, $55, $55, $00, $55, $00   ; 
- D 0 - I - 0x02D7E9 0B:97D9: 55        .byte $55, $AA, $22, $0E, $00, $10, $FF, $7F, $00, $24, $7E, $00, $43, $00, $BE, $39   ; 
- D 0 - I - 0x02D7F9 0B:97E9: 02        .byte $02, $00, $3B, $3A, $3C, $00, $00, $39, $02, $00, $3B, $3A, $3C, $00, $00, $39   ; 
- D 0 - I - 0x02D809 0B:97F9: 02        .byte $02, $00, $3B, $3A, $3C, $00, $00, $3A, $00, $00, $3B, $3A, $3C, $00, $39, $02   ; 
- D 0 - I - 0x02D819 0B:9809: 02        .byte $02, $00, $45, $44, $46, $00, $39, $02, $02, $00, $45, $44, $46, $00, $39, $02   ; 
- D 0 - I - 0x02D829 0B:9819: 02        .byte $02, $00, $45, $44, $46, $00, $00, $44, $00, $00, $45, $44, $46, $81, $00, $03   ; 
- D 0 - I - 0x02D839 0B:9829: 02        .byte $02, $82, $00, $40, $C3, $3D, $03, $02, $82, $00, $40, $C3, $3D, $03, $02, $82   ; 
- D 0 - I - 0x02D849 0B:9839: 00        .byte $00, $40, $C4, $3D, $84, $3D, $3E, $3E, $40, $C3, $3D, $03, $02, $85, $00, $38   ; 
- D 0 - I - 0x02D859 0B:9849: 34        .byte $34, $35, $43, $03, $02, $85, $00, $38, $34, $35, $43, $03, $02, $8D, $00, $38   ; 
- D 0 - I - 0x02D869 0B:9859: 34        .byte $34, $35, $43, $38, $34, $42, $42, $38, $34, $35, $43, $03, $02, $05, $00, $03   ; 
- D 0 - I - 0x02D879 0B:9869: 02        .byte $02, $05, $00, $03, $02, $0D, $00, $03, $02, $05, $00, $03, $02, $05, $00, $03   ; 
- D 0 - I - 0x02D889 0B:9879: 02        .byte $02, $07, $00, $81, $24, $05, $2A, $03, $02, $81, $00, $04, $10, $03, $02, $81   ; 
- D 0 - I - 0x02D899 0B:9889: 00        .byte $00, $04, $10, $03, $02, $81, $00, $06, $10, $81, $25, $C3, $31, $82, $30, $30   ; 
- D 0 - I - 0x02D8A9 0B:9899: 03        .byte $03, $02, $81, $00, $04, $30, $03, $02, $81, $00, $04, $30, $03, $02, $81, $00   ; 
- D 0 - I - 0x02D8B9 0B:98A9: 06        .byte $06, $30, $81, $25, $C3, $2D, $9D, $1C, $30, $03, $01, $02, $00, $30, $30, $11   ; 
- D 0 - I - 0x02D8C9 0B:98B9: 12        .byte $12, $03, $01, $02, $00, $30, $30, $11, $12, $03, $01, $02, $00, $30, $30, $11   ; 
- D 0 - I - 0x02D8D9 0B:98C9: 12        .byte $12, $30, $30, $25, $C4, $1D, $97, $30, $04, $04, $03, $09, $15, $16, $13, $14   ; 
- D 0 - I - 0x02D8E9 0B:98D9: 04        .byte $04, $04, $03, $09, $15, $16, $13, $14, $04, $04, $03, $09, $15, $16, $C4, $13   ; 
- D 0 - I - 0x02D8F9 0B:98E9: 81        .byte $81, $25, $C3, $21, $82, $20, $30, $03, $04, $81, $0A, $04, $00, $03, $04, $81   ; 
- D 0 - I - 0x02D909 0B:98F9: 0A        .byte $0A, $04, $00, $03, $04, $81, $0A, $06, $00, $C5, $25, $81, $30, $03, $04, $82   ; 
- D 0 - I - 0x02D919 0B:9909: 0A        .byte $0A, $17, $03, $00, $03, $04, $82, $0A, $17, $03, $00, $03, $04, $82, $0A, $17   ; 
- D 0 - I - 0x02D929 0B:9919: 03        .byte $03, $00, $83, $17, $00, $25, $05, $30, $03, $04, $85, $0A, $19, $1A, $18, $18   ; 
- D 0 - I - 0x02D939 0B:9929: 03        .byte $03, $04, $85, $0A, $19, $1A, $18, $18, $03, $04, $84, $0A, $19, $1A, $18, $C3   ; 
- D 0 - I - 0x02D949 0B:9939: 18        .byte $18, $81, $25, $05, $30, $03, $04, $82, $0A, $1B, $03, $00, $03, $04, $82, $0A   ; 
- D 0 - I - 0x02D959 0B:9949: 1B        .byte $1B, $03, $00, $03, $04, $82, $0A, $1B, $03, $00, $83, $1B, $00, $25, $05, $30   ; 
- D 0 - I - 0x02D969 0B:9959: 84        .byte $84, $07, $04, $04, $0A, $04, $05, $84, $07, $04, $04, $0A, $04, $05, $84, $07   ; 
- D 0 - I - 0x02D979 0B:9969: 04        .byte $04, $04, $0A, $0D, $05, $83, $07, $04, $0A, $05, $05, $83, $07, $04, $0A, $05   ; 
- D 0 - I - 0x02D989 0B:9979: 05        .byte $05, $83, $07, $04, $0A, $0C, $05, $84, $06, $06, $08, $0A, $06, $06, $82, $08   ; 
- D 0 - I - 0x02D999 0B:9989: 0A        .byte $0A, $06, $06, $82, $08, $0A, $0C, $06, $20, $0B, $7E, $00, $42, $00, $08, $FF   ; 
- D 0 - I - 0x02D9A9 0B:9999: 08        .byte $08, $0F, $06, $00, $8A, $80, $A0, $00, $55, $00, $55, $00, $55, $99, $AA, $06   ; 
- D 0 - I - 0x02D9B9 0B:99A9: 00        .byte $00, $82, $88, $AA, $08, $00, $10, $FF, $FF   ; 



_off006_0x02D9C2_10:
- D 0 - I - 0x02D9C2 0B:99B2: 00        .byte $00, $20, $20, $00, $20, $26, $22, $00, $81, $02, $08, $03, $81, $04, $07, $00   ; 
- D 0 - I - 0x02D9D2 0B:99C2: 81        .byte $81, $1E, $09, $1F, $81, $20, $04, $00, $8A, $05, $82, $01, $9A, $96, $8B, $A3   ; 
- D 0 - I - 0x02D9E2 0B:99D2: 8F        .byte $8F, $9C, $06, $07, $00, $81, $21, $09, $01, $81, $22, $04, $00, $81, $07, $08   ; 
- D 0 - I - 0x02D9F2 0B:99E2: 08        .byte $08, $81, $09, $07, $00, $81, $21, $09, $01, $81, $22, $15, $00, $81, $21, $09   ; 
- D 0 - I - 0x02DA02 0B:99F2: 01        .byte $01, $81, $22, $03, $00, $81, $0A, $11, $0B, $81, $23, $09, $01, $85, $24, $0B   ; 
- D 0 - I - 0x02DA12 0B:9A02: 0B        .byte $0B, $00, $0C, $11, $00, $81, $25, $09, $01, $81, $28, $03, $00, $83, $0C, $00   ; 
- D 0 - I - 0x02DA22 0B:9A12: 00        .byte $00, $C3, $0D, $89, $00, $00, $11, $00, $12, $00, $13, $14, $10, $03, $00, $81   ; 
- D 0 - I - 0x02DA32 0B:9A22: 25        .byte $25, $09, $01, $81, $28, $03, $00, $81, $15, $11, $26, $81, $29, $09, $01, $83   ; 
- D 0 - I - 0x02DA42 0B:9A32: 2A        .byte $2A, $26, $26, $13, $00, $81, $21, $09, $01, $81, $22, $07, $00, $81, $16, $06   ; 
- D 0 - I - 0x02DA52 0B:9A42: 17        .byte $17, $81, $18, $03, $00, $84, $71, $71, $72, $21, $09, $01, $81, $22, $07, $00   ; 
- D 0 - I - 0x02DA62 0B:9A52: 81        .byte $81, $19, $06, $01, $81, $1A, $03, $00, $84, $71, $71, $72, $21, $09, $01, $81   ; 
- D 0 - I - 0x02DA72 0B:9A62: 22        .byte $22, $07, $00, $81, $1B, $06, $1C, $81, $1D, $03, $00, $84, $71, $71, $72, $21   ; 
- D 0 - I - 0x02DA82 0B:9A72: 09        .byte $09, $01, $81, $22, $15, $00, $81, $2B, $09, $2C, $81, $2D, $23, $00, $81, $2E   ; 
- D 0 - I - 0x02DA92 0B:9A82: 1D        .byte $1D, $2F, $82, $40, $00, $C4, $30, $BD, $32, $33, $32, $33, $32, $33, $32, $33   ; 
- D 0 - I - 0x02DAA2 0B:9A92: 32        .byte $32, $33, $32, $33, $32, $33, $32, $33, $32, $33, $32, $33, $32, $33, $32, $33   ; 
- D 0 - I - 0x02DAB2 0B:9AA2: 32        .byte $32, $41, $42, $00, $30, $34, $47, $35, $48, $35, $49, $35, $4A, $35, $4B, $35   ; 
- D 0 - I - 0x02DAC2 0B:9AB2: 4C        .byte $4C, $35, $4D, $35, $4E, $35, $4F, $35, $50, $35, $00, $35, $00, $35, $00, $35   ; 
- D 0 - I - 0x02DAD2 0B:9AC2: 00        .byte $00, $43, $42, $00, $30, $C3, $36, $BD, $37, $38, $37, $38, $37, $38, $37, $38   ; 
- D 0 - I - 0x02DAE2 0B:9AD2: 37        .byte $37, $38, $37, $38, $37, $38, $37, $38, $37, $38, $37, $38, $37, $38, $37, $38   ; 
- D 0 - I - 0x02DAF2 0B:9AE2: 37        .byte $37, $44, $42, $00, $30, $34, $55, $35, $56, $35, $57, $35, $58, $35, $59, $35   ; 
- D 0 - I - 0x02DB02 0B:9AF2: 5A        .byte $5A, $35, $5B, $35, $5C, $35, $5D, $35, $5E, $35, $5F, $35, $60, $35, $61, $35   ; 
- D 0 - I - 0x02DB12 0B:9B02: 62        .byte $62, $43, $42, $00, $30, $C3, $36, $BD, $37, $38, $37, $38, $37, $38, $37, $38   ; 
- D 0 - I - 0x02DB22 0B:9B12: 37        .byte $37, $38, $37, $38, $37, $38, $37, $45, $37, $38, $37, $38, $37, $38, $37, $38   ; 
- D 0 - I - 0x02DB32 0B:9B22: 37        .byte $37, $44, $42, $00, $30, $34, $63, $35, $64, $35, $65, $35, $66, $35, $67, $35   ; 
- D 0 - I - 0x02DB42 0B:9B32: 68        .byte $68, $35, $69, $35, $6A, $35, $6B, $35, $6C, $35, $6D, $35, $6E, $35, $6F, $35   ; 
- D 0 - I - 0x02DB52 0B:9B42: 70        .byte $70, $43, $42, $00, $30, $C3, $39, $9D, $3A, $3B, $3A, $3B, $3A, $3B, $3A, $3B   ; 
- D 0 - I - 0x02DB62 0B:9B52: 3A        .byte $3A, $3B, $3A, $3B, $3A, $3B, $3A, $3B, $3A, $3B, $3A, $3B, $3A, $3B, $3A, $3B   ; 
- D 0 - I - 0x02DB72 0B:9B62: 3A        .byte $3A, $46, $42, $00, $3C, $04, $3D, $81, $3E, $13, $3D, $81, $3E, $04, $3D, $81   ; 
- D 0 - I - 0x02DB82 0B:9B72: 27        .byte $27, $06, $00, $81, $3F, $13, $00, $81, $3F, $0B, $00, $81, $3F, $13, $00, $81   ; 
- D 0 - I - 0x02DB92 0B:9B82: 3F        .byte $3F, $0B, $00, $81, $3F, $13, $00, $81, $3F, $0B, $00, $81, $3F, $13, $00, $81   ; 
- D 0 - I - 0x02DBA2 0B:9B92: 3F        .byte $3F, $05, $00, $83, $2A, $0A, $0A, $05, $AA, $83, $A2, $A0, $A0, $06, $AA, $81   ; 
- D 0 - I - 0x02DBB2 0B:9BA2: A5        .byte $A5, $2E, $AA, $FF   ; 



_off006_0x02DBB6_11:
- D 0 - I - 0x02DBB6 0B:9BA6: 00        .byte $00, $20, $7E, $00, $0A, $00, $08, $01, $81, $8F, $C7, $41, $10, $00, $08, $01   ; 
- D 0 - I - 0x02DBC6 0B:9BB6: 81        .byte $81, $8F, $C7, $48, $10, $00, $81, $01, $C4, $01, $03, $01, $81, $8F, $C3, $4F   ; 
- D 0 - I - 0x02DBD6 0B:9BC6: 81        .byte $81, $01, $C3, $52, $10, $00, $82, $01, $01, $C3, $05, $03, $01, $81, $8F, $C7   ; 
- D 0 - I - 0x02DBE6 0B:9BD6: 55        .byte $55, $10, $00, $81, $01, $C5, $08, $83, $01, $01, $8F, $C7, $5C, $10, $00, $C8   ; 
- D 0 - I - 0x02DBF6 0B:9BE6: 0D        .byte $0D, $82, $8F, $8F, $C5, $63, $81, $40, $10, $00, $C8, $15, $84, $68, $01, $69   ; 
- D 0 - I - 0x02DC06 0B:9BF6: 40        .byte $40, $C4, $6A, $10, $00, $C8, $1D, $82, $6E, $01, $C4, $6F, $82, $00, $73, $10   ; 
- D 0 - I - 0x02DC16 0B:9C06: 00        .byte $00, $C6, $25, $03, $01, $C7, $74, $10, $00, $81, $01, $C6, $2B, $03, $01, $C5   ; 
- D 0 - I - 0x02DC26 0B:9C16: 7B        .byte $7B, $11, $00, $C8, $31, $82, $80, $01, $C6, $81, $10, $00, $C8, $39, $C8, $87   ; 
- D 0 - I - 0x02DC36 0B:9C26: 7E        .byte $7E, $00, $7E, $00, $7E, $00, $4E, $00, $0A, $AA, $82, $00, $00, $06, $AA, $84   ; 
- D 0 - I - 0x02DC46 0B:9C36: 40        .byte $40, $10, $CE, $FF, $04, $AA, $84, $A0, $F1, $FF, $BF, $22, $AA, $FF   ; 



_off006_0x02DC54_12:
- D 0 - I - 0x02DC54 0B:9C44: 00        .byte $00, $20, $7E, $00, $08, $00, $05, $01, $C4, $02, $0B, $01, $0C, $00, $03, $01   ; 
- D 0 - I - 0x02DC64 0B:9C54: C7        .byte $C7, $06, $84, $01, $01, $59, $5A, $06, $01, $0C, $00, $82, $01, $01, $C8, $0D   ; 
- D 0 - I - 0x02DC74 0B:9C64: C4        .byte $C4, $5B, $06, $01, $0C, $00, $82, $01, $01, $C8, $15, $C5, $5F, $05, $01, $0C   ; 
- D 0 - I - 0x02DC84 0B:9C74: 00        .byte $00, $82, $01, $01, $C6, $1D, $82, $01, $23, $C7, $64, $03, $01, $0C, $00, $03   ; 
- D 0 - I - 0x02DC94 0B:9C84: 01        .byte $01, $C7, $24, $C8, $6B, $82, $01, $01, $0C, $00, $82, $01, $01, $C8, $2B, $C8   ; 
- D 0 - I - 0x02DCA4 0B:9C94: 73        .byte $73, $82, $01, $01, $0C, $00, $82, $01, $01, $C3, $33, $81, $01, $C4, $36, $C9   ; 
- D 0 - I - 0x02DCB4 0B:9CA4: 7B        .byte $7B, $81, $01, $0C, $00, $82, $01, $01, $C8, $3A, $CA, $84, $0C, $00, $82, $01   ; 
- D 0 - I - 0x02DCC4 0B:9CB4: 01        .byte $01, $C8, $42, $CA, $8E, $0C, $00, $82, $01, $01, $C8, $4A, $CA, $98, $0C, $00   ; 
- D 0 - I - 0x02DCD4 0B:9CC4: 82        .byte $82, $01, $01, $C4, $52, $81, $01, $C3, $56, $CA, $A2, $0C, $00, $81, $01, $C5   ; 
- D 0 - I - 0x02DCE4 0B:9CD4: AC        .byte $AC, $81, $01, $C3, $B1, $82, $BE, $00, $C5, $BF, $03, $01, $0C, $00, $81, $01   ; 
- D 0 - I - 0x02DCF4 0B:9CE4: C9        .byte $C9, $B4, $C7, $C4, $03, $01, $7E, $00, $7E, $00, $7E, $00, $20, $00, $81, $0C   ; 
- D 0 - I - 0x02DD04 0B:9CF4: 05        .byte $05, $00, $84, $55, $45, $31, $3D, $03, $00, $83, $08, $0A, $0C, $1C, $00, $FF   ; 



_off006_0x02DD14_13:
- D 0 - I - 0x02DD14 0B:9D04: 00        .byte $00, $20, $08, $08, $81, $C4, $04, $24, $05, $08, $81, $D8, $04, $D9, $81, $DA   ; 
- D 0 - I - 0x02DD24 0B:9D14: 08        .byte $08, $08, $08, $C6, $82, $C7, $C4, $03, $24, $04, $08, $82, $DB, $D8, $03, $D9   ; 
- D 0 - I - 0x02DD34 0B:9D24: 82        .byte $82, $DA, $EB, $08, $C6, $87, $08, $C8, $C9, $08, $08, $C8, $C9, $03, $08, $8C   ; 
- D 0 - I - 0x02DD44 0B:9D34: C4        .byte $C4, $24, $24, $CA, $CB, $C1, $C2, $F9, $FA, $D9, $D9, $DA, $03, $08, $BE, $C8   ; 
- D 0 - I - 0x02DD54 0B:9D44: C9        .byte $C9, $08, $08, $C8, $C9, $08, $C9, $08, $08, $C8, $C9, $08, $08, $C8, $C9, $08   ; 
- D 0 - I - 0x02DD64 0B:9D54: 08        .byte $08, $C4, $24, $E9, $EA, $D1, $D2, $FB, $FC, $D9, $DA, $08, $08, $C8, $C9, $08   ; 
- D 0 - I - 0x02DD74 0B:9D64: 08        .byte $08, $C8, $C9, $08, $08, $C8, $EB, $C6, $C6, $C7, $EC, $ED, $ED, $D3, $EB, $C6   ; 
- D 0 - I - 0x02DD84 0B:9D74: C6        .byte $C6, $C7, $C4, $08, $08, $D4, $FD, $08, $D8, $DA, $EB, $C6, $C6, $89, $C7, $EC   ; 
- D 0 - I - 0x02DD94 0B:9D84: ED        .byte $ED, $ED, $D3, $EB, $C6, $C6, $C7, $0C, $D5, $81, $D6, $05, $D5, $81, $EE, $0D   ; 
- D 0 - I - 0x02DDA4 0B:9D94: D5        .byte $D5, $83, $00, $6F, $70, $1A, $00, $85, $6C, $6D, $00, $00, $71, $1C, $00, $81   ; 
- D 0 - I - 0x02DDB4 0B:9DA4: 6E        .byte $6E, $04, $00, $84, $82, $9D, $9E, $80, $53, $00, $C3, $01, $06, $00, $84, $83   ; 
- D 0 - I - 0x02DDC4 0B:9DB4: 98        .byte $98, $8E, $80, $11, $00, $C4, $04, $82, $75, $09, $04, $00, $83, $80, $00, $80   ; 
- D 0 - I - 0x02DDD4 0B:9DC4: 13        .byte $13, $00, $C6, $0A, $19, $00, $C8, $10, $04, $00, $83, $84, $9C, $8E, $11, $00   ; 
- D 0 - I - 0x02DDE4 0B:9DD4: C8        .byte $C8, $18, $18, $00, $C8, $20, $19, $00, $C6, $28, $05, $00, $83, $85, $9E, $92   ; 
- D 0 - I - 0x02DDF4 0B:9DE4: 10        .byte $10, $00, $C7, $2E, $81, $6B, $04, $00, $83, $80, $00, $80, $10, $00, $C3, $35   ; 
- D 0 - I - 0x02DE04 0B:9DF4: 81        .byte $81, $00, $C5, $38, $17, $00, $C9, $3D, $05, $00, $83, $86, $9E, $92, $0F, $00   ; 
- D 0 - I - 0x02DE14 0B:9E04: C9        .byte $C9, $46, $17, $00, $C9, $4F, $03, $00, $81, $72, $13, $00, $C9, $58, $03, $00   ; 
- D 0 - I - 0x02DE24 0B:9E14: 82        .byte $82, $73, $70, $12, $00, $CA, $61, $81, $00, $20, $D5, $81, $DB, $03, $08, $98   ; 
- D 0 - I - 0x02DE34 0B:9E24: EF        .byte $EF, $D4, $FE, $FD, $FF, $08, $08, $DB, $08, $08, $DB, $08, $08, $DB, $08, $08   ; 
- D 0 - I - 0x02DE44 0B:9E34: DB        .byte $DB, $08, $08, $EF, $D4, $FE, $FD, $FF, $03, $08, $86, $DB, $C6, $C7, $08, $EF   ; 
- D 0 - I - 0x02DE54 0B:9E44: 24        .byte $24, $03, $08, $90, $D9, $FF, $EB, $C6, $C7, $EC, $ED, $D3, $EC, $ED, $D3, $EB   ; 
- D 0 - I - 0x02DE64 0B:9E54: C6        .byte $C6, $C7, $EF, $24, $03, $08, $92, $D9, $FF, $08, $EB, $C6, $C7, $08, $EF, $24   ; 
- D 0 - I - 0x02DE74 0B:9E64: 24        .byte $24, $DB, $08, $08, $D9, $D9, $FF, $08, $EB, $06, $C6, $8D, $C7, $08, $EF, $24   ; 
- D 0 - I - 0x02DE84 0B:9E74: 24        .byte $24, $08, $08, $DB, $D9, $D9, $FF, $08, $EB, $20, $D5, $20, $00, $88, $50, $50   ; 
- D 0 - I - 0x02DE94 0B:9E84: 10        .byte $10, $00, $00, $40, $50, $50, $05, $A0, $85, $00, $00, $A0, $22, $00, $03, $AA   ; 
- D 0 - I - 0x02DEA4 0B:9E94: 03        .byte $03, $FF, $82, $22, $88, $03, $AA, $03, $FF, $82, $22, $88, $03, $AA, $03, $FF   ; 
- D 0 - I - 0x02DEB4 0B:9EA4: 82        .byte $82, $A2, $A8, $03, $AA, $03, $FF, $10, $00, $FF   ; 



_off006_0x02DEBE_14:
- D 0 - I - 0x02DEBE 0B:9EAE: 00        .byte $00, $24, $21, $00, $81, $77, $08, $7B, $81, $78, $16, $00, $81, $7D, $08, $00   ; 
- D 0 - I - 0x02DECE 0B:9EBE: 81        .byte $81, $7E, $16, $00, $81, $7D, $08, $00, $81, $7E, $16, $00, $81, $7D, $08, $00   ; 
- D 0 - I - 0x02DEDE 0B:9ECE: 81        .byte $81, $7E, $16, $00, $81, $7D, $08, $00, $81, $7E, $16, $00, $81, $7D, $08, $00   ; 
- D 0 - I - 0x02DEEE 0B:9EDE: 81        .byte $81, $7E, $16, $00, $81, $7D, $08, $00, $81, $7E, $16, $00, $81, $7D, $08, $00   ; 
- D 0 - I - 0x02DEFE 0B:9EEE: 81        .byte $81, $7E, $16, $00, $81, $7D, $08, $00, $81, $7E, $16, $00, $81, $79, $08, $7C   ; 
- D 0 - I - 0x02DF0E 0B:9EFE: 81        .byte $81, $7A, $42, $00, $82, $C0, $00, $C4, $C1, $1A, $00, $C6, $C5, $1A, $00, $C6   ; 
- D 0 - I - 0x02DF1E 0B:9F0E: CB        .byte $CB, $1A, $00, $C6, $D1, $42, $00, $81, $77, $08, $7B, $81, $78, $16, $00, $81   ; 
- D 0 - I - 0x02DF2E 0B:9F1E: 7D        .byte $7D, $08, $00, $81, $7E, $16, $00, $81, $7D, $08, $00, $81, $7E, $16, $00, $81   ; 
- D 0 - I - 0x02DF3E 0B:9F2E: 7D        .byte $7D, $08, $00, $81, $7E, $16, $00, $81, $7D, $08, $00, $81, $7E, $16, $00, $81   ; 
- D 0 - I - 0x02DF4E 0B:9F3E: 7D        .byte $7D, $08, $00, $81, $7E, $16, $00, $81, $7D, $08, $00, $81, $7E, $16, $00, $81   ; 
- D 0 - I - 0x02DF5E 0B:9F4E: 7D        .byte $7D, $08, $00, $81, $7E, $16, $00, $81, $7D, $08, $00, $81, $7E, $16, $00, $81   ; 
- D 0 - I - 0x02DF6E 0B:9F5E: 79        .byte $79, $08, $7C, $81, $7A, $61, $00, $83, $3F, $0F, $CF, $05, $00, $83, $33, $00   ; 
- D 0 - I - 0x02DF7E 0B:9F6E: CC        .byte $CC, $05, $00, $83, $F3, $F0, $FC, $05, $00, $08, $AA, $05, $00, $83, $7F, $5F   ; 
- D 0 - I - 0x02DF8E 0B:9F7E: DF        .byte $DF, $05, $00, $83, $77, $55, $DD, $05, $00, $83, $F7, $F5, $FD, $08, $00, $FF   ; 



_off006_0x02DF9E_0C:
- D 0 - I - 0x02DF9E 0B:9F8E: 00        .byte $00, $20, $66, $00, $8A, $8E, $93, $90, $90, $93, $8D, $9F, $96, $9E, $A3, $36   ; 
- D 0 - I - 0x02DFAE 0B:9F9E: 00        .byte $00, $84, $9D, $95, $93, $98, $3C, $00, $85, $9D, $9A, $8F, $8F, $8E, $3B, $00   ; 
- D 0 - I - 0x02DFBE 0B:9FAE: 85        .byte $85, $9E, $93, $97, $8F, $9C, $3B, $00, $86, $92, $8F, $8B, $96, $9E, $92, $27   ; 
- D 0 - I - 0x02DFCE 0B:9FBE: 00        .byte $00, $81, $7D, $14, $00, $C2, $61, $09, $00, $C3, $7E, $83, $00, $81, $82, $0E   ; 
- D 0 - I - 0x02DFDE 0B:9FCE: 00        .byte $00, $C4, $63, $08, $00, $C7, $83, $0D, $00, $C7, $67, $07, $00, $C5, $8A, $0D   ; 
- D 0 - I - 0x02DFEE 0B:9FDE: 00        .byte $00, $C7, $6E, $08, $00, $C5, $8F, $0B, $00, $C8, $75, $08, $00, $C5, $94, $0B   ; 
- D 0 - I - 0x02DFFE 0B:9FEE: 00        .byte $00, $C8, $B6, $08, $00, $C6, $99, $0A, $00, $C8, $BE, $07, $00, $C7, $9F, $0A   ; 
- D 0 - I - 0x02E00E 0B:9FFE: 00        .byte $00, $C9, $C6, $05, $00, $C8, $A6, $0A, $00, $C5, $CF, $81, $00, $C3, $D4, $05   ; 
- D 1 - I - 0x02E01E 0B:A00E: 00        .byte $00, $C6, $AE, $0E, $00, $C3, $D7, $02, $00, $C3, $DA, $07, $00, $C2, $B4, $0F   ; 
- D 1 - I - 0x02E02E 0B:A01E: 00        .byte $00, $C3, $DD, $02, $00, $C3, $E0, $07, $00, $C2, $EC, $0F, $00, $C3, $E3, $0C   ; 
- D 1 - I - 0x02E03E 0B:A02E: 00        .byte $00, $C2, $EE, $0F, $00, $C2, $E6, $0C, $00, $C2, $F0, $10, $00, $C2, $E8, $0B   ; 
- D 1 - I - 0x02E04E 0B:A03E: 00        .byte $00, $C3, $F2, $10, $00, $C2, $EA, $0C, $00, $C2, $F5, $54, $00, $81, $30, $0B   ; 
- D 1 - I - 0x02E05E 0B:A04E: 00        .byte $00, $17, $55, $81, $41, $06, $55, $82, $15, $00, $08, $55, $FF   ; 


; bzk garbage
- - - - - - 0x02E06B 0B:A05B: FF        .byte $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E070 0B:A060: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E080 0B:A070: FF        .byte $FF, $FF, $FF, $FF, $FF   ; 



_off006_0x02E085_15:
- D 1 - I - 0x02E085 0B:A075: 00        .byte $00, $20, $65, $00, $81, $9F, $14, $A0, $81, $A1, $0A, $00, $81, $A2, $0D, $02   ; 
- D 1 - I - 0x02E095 0B:A085: C3        .byte $C3, $CC, $04, $02, $81, $A3, $0A, $00, $81, $A2, $0D, $A7, $83, $CF, $D0, $00   ; 
- D 1 - I - 0x02E0A5 0B:A095: 04        .byte $04, $A7, $81, $A3, $0A, $00, $81, $A2, $04, $01, $C3, $A8, $04, $01, $C4, $D1   ; 
- D 1 - I - 0x02E0B5 0B:A0A5: 81        .byte $81, $B1, $04, $01, $81, $A3, $0A, $00, $81, $A2, $04, $01, $C4, $AB, $03, $01   ; 
- D 1 - I - 0x02E0C5 0B:A0B5: C4        .byte $C4, $D5, $81, $00, $03, $01, $82, $D9, $A3, $0A, $00, $81, $A2, $04, $01, $C4   ; 
- D 1 - I - 0x02E0D5 0B:A0C5: AF        .byte $AF, $03, $01, $8A, $DA, $DB, $D7, $D4, $BD, $01, $01, $DC, $DD, $A3, $0A, $00   ; 
- D 1 - I - 0x02E0E5 0B:A0D5: 81        .byte $81, $A2, $03, $01, $C5, $B3, $82, $01, $01, $C3, $DE, $88, $D7, $E1, $00, $E2   ; 
- D 1 - I - 0x02E0F5 0B:A0E5: 01        .byte $01, $E3, $E4, $A3, $0A, $00, $81, $A2, $C5, $B8, $81, $B5, $C4, $BD, $8B, $E5   ; 
- D 1 - I - 0x02E105 0B:A0F5: DA        .byte $DA, $DB, $D7, $E1, $00, $B8, $B9, $E6, $E7, $A3, $0A, $00, $81, $A2, $C3, $C1   ; 
- D 1 - I - 0x02E115 0B:A105: 92        .byte $92, $00, $BC, $B5, $00, $C4, $C5, $BD, $E8, $DF, $E0, $D7, $D4, $B1, $C9, $CA   ; 
- D 1 - I - 0x02E125 0B:A115: E9        .byte $E9, $EA, $A3, $0A, $00, $90, $A2, $C1, $C2, $B6, $B1, $C6, $B5, $C7, $00, $C8   ; 
- D 1 - I - 0x02E135 0B:A125: 00        .byte $00, $E8, $DA, $E0, $EB, $EC, $03, $00, $83, $B6, $00, $A3, $0A, $00, $83, $A2   ; 
- D 1 - I - 0x02E145 0B:A135: C9        .byte $C9, $CA, $03, $00, $85, $CB, $B6, $00, $00, $C7, $C3, $ED, $07, $00, $81, $A3   ; 
- D 1 - I - 0x02E155 0B:A145: 0A        .byte $0A, $00, $81, $A2, $14, $00, $81, $A3, $0A, $00, $81, $A2, $14, $00, $81, $A3   ; 
- D 1 - I - 0x02E165 0B:A155: 0A        .byte $0A, $00, $81, $A4, $14, $A5, $81, $A6, $7E, $00, $7E, $00, $7E, $00, $2B, $00   ; 
- D 1 - I - 0x02E175 0B:A165: 09        .byte $09, $FF, $82, $7B, $1A, $03, $5A, $91, $CE, $FF, $FF, $77, $21, $95, $55, $55   ; 
- D 1 - I - 0x02E185 0B:A175: CC        .byte $CC, $FF, $FF, $37, $00, $59, $55, $55, $DD, $21, $FF, $FF   ; 



_off006_0x02E191_16:
- D 1 - I - 0x02E191 0B:A181: 00        .byte $00, $20, $67, $00, $81, $01, $10, $03, $81, $02, $0E, $00, $81, $04, $05, $00   ; 
- D 1 - I - 0x02E1A1 0B:A191: 85        .byte $85, $09, $00, $0A, $35, $00, $C4, $36, $83, $00, $00, $05, $0E, $00, $83, $04   ; 
- D 1 - I - 0x02E1B1 0B:A1A1: 00        .byte $00, $00, $C6, $0B, $84, $36, $37, $3A, $3B, $04, $00, $81, $05, $0E, $00, $82   ; 
- D 1 - I - 0x02E1C1 0B:A1B1: 04        .byte $04, $00, $C7, $11, $83, $3A, $3B, $00, $C3, $3C, $83, $00, $00, $05, $0E, $00   ; 
- D 1 - I - 0x02E1D1 0B:A1C1: 84        .byte $84, $04, $18, $19, $00, $C5, $1A, $C8, $3F, $81, $05, $0E, $00, $82, $04, $1F   ; 
- D 1 - I - 0x02E1E1 0B:A1D1: 06        .byte $06, $00, $81, $20, $C8, $47, $81, $05, $0E, $00, $82, $04, $21, $04, $00, $83   ; 
- D 1 - I - 0x02E1F1 0B:A1E1: 22        .byte $22, $00, $23, $C8, $4F, $81, $05, $0E, $00, $89, $04, $24, $00, $00, $25, $00   ; 
- D 1 - I - 0x02E201 0B:A1F1: 26        .byte $26, $00, $27, $C8, $57, $81, $05, $0E, $00, $83, $04, $00, $28, $03, $00, $83   ; 
- D 1 - I - 0x02E211 0B:A201: 29        .byte $29, $00, $2A, $C5, $5F, $84, $54, $64, $46, $05, $0E, $00, $83, $04, $00, $2B   ; 
- D 1 - I - 0x02E221 0B:A211: 06        .byte $06, $00, $03, $65, $C4, $66, $82, $00, $05, $0E, $00, $81, $04, $03, $00, $C4   ; 
- D 1 - I - 0x02E231 0B:A221: 2C        .byte $2C, $82, $00, $6A, $03, $6B, $85, $6C, $6D, $46, $00, $05, $0E, $00, $81, $04   ; 
- D 1 - I - 0x02E241 0B:A231: 05        .byte $05, $00, $C3, $30, $C3, $6E, $C3, $6E, $83, $32, $6E, $05, $0E, $00, $81, $04   ; 
- D 1 - I - 0x02E251 0B:A241: 06        .byte $06, $00, $8B, $33, $34, $33, $71, $34, $33, $71, $34, $71, $34, $05, $0E, $00   ; 
- D 1 - I - 0x02E261 0B:A251: 81        .byte $81, $06, $10, $07, $81, $08, $7E, $00, $7E, $00, $7E, $00, $2D, $00, $0A, $FF   ; 
- D 1 - I - 0x02E271 0B:A261: 84        .byte $84, $80, $AA, $6A, $12, $04, $FF, $84, $44, $55, $55, $11, $04, $FF, $84, $08   ; 
- D 1 - I - 0x02E281 0B:A271: AA        .byte $AA, $A0, $A0, $22, $FF, $FF   ; 



_off006_0x02E287_17:
- D 1 - I - 0x02E287 0B:A277: 00        .byte $00, $20, $7E, $00, $4E, $00, $81, $C1, $C3, $C1, $C3, $DD, $81, $C1, $18, $00   ; 
- D 1 - I - 0x02E297 0B:A287: 88        .byte $88, $C1, $C1, $C4, $C5, $E0, $E1, $C1, $C1, $18, $00, $81, $C1, $C3, $C6, $C3   ; 
- D 1 - I - 0x02E2A7 0B:A297: E2        .byte $E2, $81, $C1, $18, $00, $C4, $C9, $C4, $E5, $18, $00, $C4, $CD, $C4, $E9, $18   ; 
- D 1 - I - 0x02E2B7 0B:A2A7: 00        .byte $00, $C4, $D1, $C4, $ED, $18, $00, $C4, $D5, $C3, $F1, $81, $D5, $18, $00, $C4   ; 
- D 1 - I - 0x02E2C7 0B:A2B7: D9        .byte $D9, $C4, $F4, $7E, $00, $7E, $00, $7E, $00, $7E, $00, $27, $00, $82, $10, $40   ; 
- D 1 - I - 0x02E2D7 0B:A2C7: 06        .byte $06, $00, $82, $05, $05, $23, $00, $FF   ; 



_off006_0x02E2DF_18:
- D 1 - I - 0x02E2DF 0B:A2CF: 00        .byte $00, $20, $7E, $00, $82, $00, $00, $30, $01, $C4, $1A, $0C, $01, $0F, $02, $81   ; 
- D 1 - I - 0x02E2EF 0B:A2DF: 04        .byte $04, $C5, $1E, $1A, $02, $81, $05, $C5, $23, $0B, $02, $0E, $01, $85, $06, $07   ; 
- D 1 - I - 0x02E2FF 0B:A2EF: 28        .byte $28, $00, $29, $0D, $01, $0D, $02, $C3, $08, $83, $00, $00, $2A, $0D, $02, $0D   ; 
- D 1 - I - 0x02E30F 0B:A2FF: 03        .byte $03, $C3, $0B, $82, $2B, $00, $C3, $2C, $0B, $03, $0D, $01, $C3, $0E, $C5, $2F   ; 
- D 1 - I - 0x02E31F 0B:A30F: 18        .byte $18, $01, $C3, $11, $82, $34, $01, $C3, $35, $18, $01, $82, $14, $15, $03, $01   ; 
- D 1 - I - 0x02E32F 0B:A31F: 82        .byte $82, $38, $39, $18, $01, $82, $16, $17, $04, $01, $C3, $3A, $17, $01, $82, $18   ; 
- D 1 - I - 0x02E33F 0B:A32F: 19        .byte $19, $12, $01, $7E, $00, $7E, $00, $7E, $00, $7E, $00, $08, $00, $FF   ; 



_off006_0x02E34D_19:
- D 1 - I - 0x02E34D 0B:A33D: 00        .byte $00, $20, $7E, $00, $82, $00, $00, $0C, $01, $8A, $3D, $3E, $01, $3F, $55, $56   ; 
- D 1 - I - 0x02E35D 0B:A34D: 01        .byte $01, $01, $57, $58, $16, $01, $84, $40, $41, $01, $42, $C3, $59, $83, $01, $5C   ; 
- D 1 - I - 0x02E36D 0B:A35D: 5D        .byte $5D, $0A, $01, $0C, $02, $C4, $43, $C5, $5E, $18, $02, $C3, $47, $82, $00, $00   ; 
- D 1 - I - 0x02E37D 0B:A36D: C3        .byte $C3, $63, $0B, $02, $0D, $01, $C3, $4A, $84, $66, $00, $67, $68, $0C, $01, $0D   ; 
- D 1 - I - 0x02E38D 0B:A37D: 02        .byte $02, $C3, $4D, $82, $69, $6A, $0E, $02, $0D, $03, $C3, $50, $82, $6B, $6C, $0E   ; 
- D 1 - I - 0x02E39D 0B:A38D: 03        .byte $03, $0F, $01, $81, $53, $C3, $6D, $1D, $01, $C3, $70, $1D, $01, $C3, $73, $1C   ; 
- D 1 - I - 0x02E3AD 0B:A39D: 01        .byte $01, $83, $54, $76, $77, $1E, $01, $82, $78, $79, $0E, $01, $7E, $00, $7E, $00   ; 
- D 1 - I - 0x02E3BD 0B:A3AD: 7E        .byte $7E, $00, $7E, $00, $08, $00, $FF   ; 



_off006_0x02E3C4_1A:
- D 1 - I - 0x02E3C4 0B:A3B4: 00        .byte $00, $20, $7E, $00, $82, $00, $00, $0D, $01, $86, $7A, $7B, $01, $91, $01, $92   ; 
- D 1 - I - 0x02E3D4 0B:A3C4: 1A        .byte $1A, $01, $C3, $7C, $C3, $93, $0D, $01, $0D, $02, $83, $7F, $81, $82, $C3, $96   ; 
- D 1 - I - 0x02E3E4 0B:A3D4: 1B        .byte $1B, $02, $85, $83, $84, $99, $00, $9A, $0D, $02, $0E, $01, $85, $85, $86, $00   ; 
- D 1 - I - 0x02E3F4 0B:A3E4: 00        .byte $00, $9B, $0D, $01, $0E, $02, $85, $87, $88, $9C, $00, $9D, $0D, $02, $0E, $03   ; 
- D 1 - I - 0x02E404 0B:A3F4: 82        .byte $82, $89, $8A, $C3, $9E, $0D, $03, $0E, $01, $82, $8B, $8C, $C3, $A1, $1B, $01   ; 
- D 1 - I - 0x02E414 0B:A404: 85        .byte $85, $8D, $8E, $01, $A4, $A5, $1B, $01, $85, $8F, $90, $01, $A6, $A7, $1E, $01   ; 
- D 1 - I - 0x02E424 0B:A414: 82        .byte $82, $A8, $A9, $1E, $01, $82, $AA, $AB, $0D, $01, $7E, $00, $7E, $00, $7E, $00   ; 
- D 1 - I - 0x02E434 0B:A424: 7E        .byte $7E, $00, $08, $00, $FF   ; 



_off006_0x02E439_1B:
- D 1 - I - 0x02E439 0B:A429: 00        .byte $00, $20, $7E, $00, $82, $00, $00, $13, $01, $82, $CE, $CF, $17, $01, $C4, $AC   ; 
- D 1 - I - 0x02E449 0B:A439: 04        .byte $04, $01, $81, $D0, $0B, $01, $0B, $02, $C5, $B0, $85, $D1, $D2, $02, $D3, $D4   ; 
- D 1 - I - 0x02E459 0B:A449: 17        .byte $17, $02, $C4, $B5, $C5, $D5, $0B, $02, $0C, $01, $82, $B9, $BA, $03, $00, $C3   ; 
- D 1 - I - 0x02E469 0B:A459: DA        .byte $DA, $0C, $01, $0C, $02, $C4, $BB, $C4, $DD, $0C, $02, $0E, $03, $82, $BF, $C0   ; 
- D 1 - I - 0x02E479 0B:A469: C4        .byte $C4, $E1, $0C, $03, $0D, $01, $85, $C1, $C2, $00, $E5, $E6, $1B, $01, $C3, $C3   ; 
- D 1 - I - 0x02E489 0B:A479: 81        .byte $81, $E7, $1C, $01, $C3, $C6, $1D, $01, $C3, $C9, $1E, $01, $82, $CC, $CD, $10   ; 
- D 1 - I - 0x02E499 0B:A489: 01        .byte $01, $7E, $00, $7E, $00, $7E, $00, $7E, $00, $08, $00, $FF   ; 



_off006_0x02E4A5_1C:
- D 1 - I - 0x02E4A5 0B:A495: 00        .byte $00, $20, $7E, $00, $82, $00, $00, $0D, $01, $87, $04, $05, $01, $1E, $1F, $01   ; 
- D 1 - I - 0x02E4B5 0B:A4A5: 20        .byte $20, $19, $01, $C3, $06, $C4, $21, $0C, $01, $0D, $02, $C3, $09, $C4, $25, $19   ; 
- D 1 - I - 0x02E4C5 0B:A4B5: 02        .byte $02, $84, $0C, $0D, $00, $00, $C3, $29, $0C, $02, $0D, $01, $C3, $0E, $82, $2C   ; 
- D 1 - I - 0x02E4D5 0B:A4C5: 2D        .byte $2D, $0E, $01, $0D, $02, $84, $00, $11, $12, $2E, $0F, $02, $0D, $03, $C3, $13   ; 
- D 1 - I - 0x02E4E5 0B:A4D5: 81        .byte $81, $2F, $0F, $03, $0F, $01, $83, $16, $30, $31, $1C, $01, $84, $17, $18, $32   ; 
- D 1 - I - 0x02E4F5 0B:A4E5: 33        .byte $33, $1B, $01, $C3, $19, $82, $34, $35, $1B, $01, $85, $1C, $1D, $01, $36, $37   ; 
- D 1 - I - 0x02E505 0B:A4F5: 1E        .byte $1E, $01, $C3, $38, $0D, $01, $7E, $00, $7E, $00, $7E, $00, $59, $00, $82, $55   ; 
- D 1 - I - 0x02E515 0B:A505: 11        .byte $11, $06, $00, $82, $55, $51, $23, $00, $FF   ; 



_off006_0x02E51E_1D:
- D 1 - I - 0x02E51E 0B:A50E: 00        .byte $00, $20, $7E, $00, $82, $00, $00, $0C, $01, $C5, $3B, $86, $62, $63, $01, $01   ; 
- D 1 - I - 0x02E52E 0B:A51E: 64        .byte $64, $65, $16, $01, $C4, $40, $C5, $66, $0A, $01, $0D, $02, $C4, $44, $C5, $6B   ; 
- D 1 - I - 0x02E53E 0B:A52E: 17        .byte $17, $02, $C4, $48, $C6, $70, $09, $02, $0E, $01, $C3, $4C, $C6, $76, $09, $01   ; 
- D 1 - I - 0x02E54E 0B:A53E: 0E        .byte $0E, $02, $83, $4F, $02, $50, $C4, $7C, $82, $81, $82, $09, $02, $0E, $03, $C3   ; 
- D 1 - I - 0x02E55E 0B:A54E: 51        .byte $51, $C5, $83, $0A, $03, $0E, $01, $C3, $54, $C5, $88, $18, $01, $C3, $57, $C5   ; 
- D 1 - I - 0x02E56E 0B:A55E: 8D        .byte $8D, $18, $01, $83, $5A, $5B, $01, $C6, $92, $16, $01, $C3, $5C, $03, $01, $C4   ; 
- D 1 - I - 0x02E57E 0B:A56E: 98        .byte $98, $16, $01, $C3, $5F, $04, $01, $C3, $9C, $09, $01, $7E, $00, $7E, $00, $7E   ; 
- D 1 - I - 0x02E58E 0B:A57E: 00        .byte $00, $51, $00, $82, $01, $44, $08, $00, $81, $01, $05, $00, $83, $54, $40, $55   ; 
- D 1 - I - 0x02E59E 0B:A58E: 22        .byte $22, $00, $FF   ; 



sub_A591:
C - - - - - 0x02E5A1 0B:A591: A4 A9     LDY ram_00A9
C - - - - - 0x02E5A3 0B:A593: BD 40 04  LDA ram_obj_pos_X,X
C - - - - - 0x02E5A6 0B:A596: D9 40 04  CMP ram_obj_pos_X,Y
C - - - - - 0x02E5A9 0B:A599: A9 00     LDA #$00
C - - - - - 0x02E5AB 0B:A59B: 6A        ROR
C - - - - - 0x02E5AC 0B:A59C: 6A        ROR
C - - - - - 0x02E5AD 0B:A59D: DD 10 05  CMP ram_obj_0510,X
C - - - - - 0x02E5B0 0B:A5A0: 60        RTS


; bzk garbage
- - - - - - 0x02E5B1 0B:A5A1: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E5C0 0B:A5B0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E5D0 0B:A5C0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E5E0 0B:A5D0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E5F0 0B:A5E0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E600 0B:A5F0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E610 0B:A600: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E620 0B:A610: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E630 0B:A620: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E640 0B:A630: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E650 0B:A640: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E660 0B:A650: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E670 0B:A660: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E680 0B:A670: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E690 0B:A680: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E6A0 0B:A690: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E6B0 0B:A6A0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E6C0 0B:A6B0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E6D0 0B:A6C0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E6E0 0B:A6D0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF   ; 



loc_0x02E6E6:
C D 1 - - - 0x02E6E6 0B:A6D6: 20 91 A5  JSR sub_A591
C - - - - - 0x02E6E9 0B:A6D9: D0 13     BNE bra_A6EE
C - - - - - 0x02E6EB 0B:A6DB: B9 10 04  LDA ram_obj_pos_Y,Y
C - - - - - 0x02E6EE 0B:A6DE: C9 B0     CMP #$B0
C - - - - - 0x02E6F0 0B:A6E0: 90 0C     BCC bra_A6EE
C - - - - - 0x02E6F2 0B:A6E2: B9 80 05  LDA ram_obj_0580,Y
C - - - - - 0x02E6F5 0B:A6E5: D0 07     BNE bra_A6EE
C - - - - - 0x02E6F7 0B:A6E7: AC 38 06  LDY ram_0638
C - - - - - 0x02E6FA 0B:A6EA: C0 10     CPY #$10
C - - - - - 0x02E6FC 0B:A6EC: 90 03     BCC bra_A6F1
bra_A6EE:
C - - - - - 0x02E6FE 0B:A6EE: A9 23     LDA #$23
C - - - - - 0x02E700 0B:A6F0: 18        CLC
bra_A6F1:
C - - - - - 0x02E701 0B:A6F1: 7D 50 05  ADC ram_obj_id,X
C - - - - - 0x02E704 0B:A6F4: 85 12     STA ram_0012
C - - - - - 0x02E706 0B:A6F6: 4C 17 F6  JMP loc_0x03F627_restore_prg


; bzk garbage
- - - - - - 0x02E709 0B:A6F9: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E710 0B:A700: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E720 0B:A710: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E730 0B:A720: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E740 0B:A730: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



sub_0x02E74B:
- - - - - - 0x02E74B 0B:A73B: 05 AF     ORA ram_00AF
- - - - - - 0x02E74D 0B:A73D: 8D 0F 01  STA ram_010F
- - - - - - 0x02E750 0B:A740: A5 B0     LDA ram_00B0
- - - - - - 0x02E752 0B:A742: 20 02 D2  JSR sub_0x03D212_ASLx4
- - - - - - 0x02E755 0B:A745: 05 B1     ORA ram_00B1
- - - - - - 0x02E757 0B:A747: 8D 10 01  STA ram_0110
- - - - - - 0x02E75A 0B:A74A: 20 09 DE  JSR sub_0x03DE19_очистить_00AE_00B5
- - - - - - 0x02E75D 0B:A74D: 4C 17 F6  JMP loc_0x03F627_restore_prg


; bzk garbage
- - - - - - 0x02E760 0B:A750: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E770 0B:A760: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E780 0B:A770: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E790 0B:A780: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E7A0 0B:A790: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E7B0 0B:A7A0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E7C0 0B:A7B0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



ofs_0x02E7CA:
; бряк срабатывает после нанесения урона персу обычными ударами
; не суперкой, не мячом
C - - - - - 0x02E7CA 0B:A7BA: BC 50 05  LDY ram_obj_id,X
C - - - - - 0x02E7CD 0B:A7BD: B9 E0 B5  LDA tbl_B5E0_lo,Y
C - - - - - 0x02E7D0 0B:A7C0: 85 00     STA ram_0000
C - - - - - 0x02E7D2 0B:A7C2: B9 E7 B5  LDA tbl_B5E7_hi,Y
C - - - - - 0x02E7D5 0B:A7C5: 85 01     STA ram_0001
C - - - - - 0x02E7D7 0B:A7C7: A4 A9     LDY ram_00A9
C - - - - - 0x02E7D9 0B:A7C9: B9 12 06  LDA ram_plr_0612,Y
C - - - - - 0x02E7DC 0B:A7CC: 0A        ASL
C - - - - - 0x02E7DD 0B:A7CD: A8        TAY
C - - - - - 0x02E7DE 0B:A7CE: BD C0 04  LDA ram_obj_04C0,X
C - - - - - 0x02E7E1 0B:A7D1: 4A        LSR
C - - - - - 0x02E7E2 0B:A7D2: B0 06     BCS bra_A7DA
C - - - - - 0x02E7E4 0B:A7D4: C8        INY
C - - - - - 0x02E7E5 0B:A7D5: A9 14     LDA #$14
C - - - - - 0x02E7E7 0B:A7D7: 9D F0 05  STA ram_obj_05F0,X
bra_A7DA:
C - - - - - 0x02E7EA 0B:A7DA: B1 00     LDA (ram_0000),Y
C - - - - - 0x02E7EC 0B:A7DC: 9D D0 04  STA ram_obj_04D0,X
C - - - - - 0x02E7EF 0B:A7DF: FE 40 05  INC ram_obj_0540,X
C - - - - - 0x02E7F2 0B:A7E2: BD 00 06  LDA ram_plr_0600,X
C - - - - - 0x02E7F5 0B:A7E5: C0 11     CPY #$11
C - - - - - 0x02E7F7 0B:A7E7: D0 03     BNE bra_A7EC
C - - - - - 0x02E7F9 0B:A7E9: 09 10     ORA #$10
C - - - - - 0x02E7FB 0B:A7EB: 2C        .byte $2C   ; BIT
bra_A7EC:
C - - - - - 0x02E7FC 0B:A7EC: 29 EF     AND #$EF
C - - - - - 0x02E7FE 0B:A7EE: 9D 00 06  STA ram_plr_0600,X
C - - - - - 0x02E801 0B:A7F1: 4C 17 F6  JMP loc_0x03F627_restore_prg


; bzk garbage
- - - - - - 0x02E804 0B:A7F4: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E810 0B:A800: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E820 0B:A810: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



ofs_0x02E830:
C - - - - - 0x02E830 0B:A820: 8A        TXA
C - - - - - 0x02E831 0B:A821: 49 05     EOR #$05
C - - - - - 0x02E833 0B:A823: A8        TAY
C - - - - - 0x02E834 0B:A824: B9 50 05  LDA ram_obj_id,Y
C - - - - - 0x02E837 0B:A827: A8        TAY
C - - - - - 0x02E838 0B:A828: B9 31 A8  LDA tbl_A831,Y
C - - - - - 0x02E83B 0B:A82B: 9D B0 05  STA ram_obj_05B0,X
C - - - - - 0x02E83E 0B:A82E: 4C 17 F6  JMP loc_0x03F627_restore_prg



tbl_A831:
- D 1 - - - 0x02E841 0B:A831: 20        .byte $20   ; 00 leo
- - - - - - 0x02E842 0B:A832: 20        .byte $20   ; 01 raph
- D 1 - - - 0x02E843 0B:A833: 20        .byte $20   ; 02 mike
- - - - - - 0x02E844 0B:A834: 20        .byte $20   ; 03 don
- D 1 - - - 0x02E845 0B:A835: 24        .byte $24   ; 04 casey
- - - - - - 0x02E846 0B:A836: 24        .byte $24   ; 05 hot
- D 1 - - - 0x02E847 0B:A837: 22        .byte $22   ; 06 shred


; bzk garbage
- - - - - - 0x02E848 0B:A838: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E850 0B:A840: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E860 0B:A850: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



ofs_0x02E86E:
C - - - - - 0x02E86E 0B:A85E: B5 91     LDA ram_btn_hold,X
C - - - - - 0x02E870 0B:A860: 29 08     AND #con_btn_Up
C - - - - - 0x02E872 0B:A862: F0 1C     BEQ bra_A880
C - - - - - 0x02E874 0B:A864: A4 A9     LDY ram_00A9
C - - - - - 0x02E876 0B:A866: B9 20 05  LDA ram_obj_0520,Y
C - - - - - 0x02E879 0B:A869: C9 03     CMP #$03
C - - - - - 0x02E87B 0B:A86B: D0 13     BNE bra_A880
C - - - - - 0x02E87D 0B:A86D: B9 C0 04  LDA ram_obj_04C0,Y
C - - - - - 0x02E880 0B:A870: C9 04     CMP #$04
C - - - - - 0x02E882 0B:A872: B0 0C     BCS bra_A880
C - - - - - 0x02E884 0B:A874: C9 02     CMP #$02
C - - - - - 0x02E886 0B:A876: F0 08     BEQ bra_A880
C - - - - - 0x02E888 0B:A878: BC 50 05  LDY ram_obj_id,X
C - - - - - 0x02E88B 0B:A87B: B9 9C A8  LDA tbl_A89C,Y
C - - - - - 0x02E88E 0B:A87E: D0 06     BNE bra_A886
bra_A880:
C - - - - - 0x02E890 0B:A880: BC 50 05  LDY ram_obj_id,X
C - - - - - 0x02E893 0B:A883: B9 A6 A8  LDA tbl_A8A6,Y
bra_A886:
C - - - - - 0x02E896 0B:A886: 9D 60 05  STA ram_obj_0560,X
C - - - - - 0x02E899 0B:A889: A9 86     LDA #> (ofs_0x024635 - $01)
C - - - - - 0x02E89B 0B:A88B: 48        PHA
C - - - - - 0x02E89C 0B:A88C: A9 24     LDA #< (ofs_0x024635 - $01)
C - - - - - 0x02E89E 0B:A88E: 48        PHA
C - - - - - 0x02E89F 0B:A88F: 4C 17 F6  JMP loc_0x03F627_restore_prg


; bzk garbage
- - - - - - 0x02E8A2 0B:A892: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



tbl_A89C:
- D 1 - - - 0x02E8AC 0B:A89C: 04        .byte $04   ; 00 leo
- - - - - - 0x02E8AD 0B:A89D: 05        .byte $05   ; 01 raph
- - - - - - 0x02E8AE 0B:A89E: 04        .byte $04   ; 02 mike
- D 1 - - - 0x02E8AF 0B:A89F: 05        .byte $05   ; 03 don
- - - - - - 0x02E8B0 0B:A8A0: 05        .byte $05   ; 04 casey
- - - - - - 0x02E8B1 0B:A8A1: 09        .byte $09   ; 05 hot
- - - - - - 0x02E8B2 0B:A8A2: 06        .byte $06   ; 06 shred


; bzk garbage
- - - - - - 0x02E8B3 0B:A8A3: FF        .byte $FF, $FF, $FF   ; 



tbl_A8A6:
- D 1 - - - 0x02E8B6 0B:A8A6: 05        .byte $05   ; 00 leo
- D 1 - - - 0x02E8B7 0B:A8A7: 06        .byte $06   ; 01 raph
- D 1 - - - 0x02E8B8 0B:A8A8: 05        .byte $05   ; 02 mike
- D 1 - - - 0x02E8B9 0B:A8A9: 06        .byte $06   ; 03 don
- D 1 - - - 0x02E8BA 0B:A8AA: 05        .byte $05   ; 04 casey
- D 1 - - - 0x02E8BB 0B:A8AB: 09        .byte $09   ; 05 hot
- D 1 - - - 0x02E8BC 0B:A8AC: 07        .byte $07   ; 06 shred


; bzk garbage
- - - - - - 0x02E8BD 0B:A8AD: FF        .byte $FF, $FF, $FF   ; 
- - - - - - 0x02E8C0 0B:A8B0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E8D0 0B:A8C0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E8E0 0B:A8D0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E8F0 0B:A8E0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E900 0B:A8F0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E910 0B:A900: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E920 0B:A910: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E930 0B:A920: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E940 0B:A930: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E950 0B:A940: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E960 0B:A950: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E970 0B:A960: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E980 0B:A970: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E990 0B:A980: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E9A0 0B:A990: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E9B0 0B:A9A0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E9C0 0B:A9B0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E9D0 0B:A9C0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E9E0 0B:A9D0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02E9F0 0B:A9E0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EA00 0B:A9F0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



sub_0x02EA10:
C - - - - - 0x02EA10 0B:AA00: BD 6B E4  LDA tbl_0x03E47B,X
C - - - - - 0x02EA13 0B:AA03: 9D 10 05  STA ram_obj_0510,X
C - - - - - 0x02EA16 0B:AA06: A5 2C     LDA ram_002C
C - - - - - 0x02EA18 0B:AA08: 49 03     EOR #$03
C - - - - - 0x02EA1A 0B:AA0A: D0 20     BNE bra_AA2C
C - - - - - 0x02EA1C 0B:AA0C: AD 51 01  LDA ram_0151
C - - - - - 0x02EA1F 0B:AA0F: 49 01     EOR #$01
C - - - - - 0x02EA21 0B:AA11: F0 17     BEQ bra_AA2A
C - - - - - 0x02EA23 0B:AA13: AD 2B 01  LDA ram_option_misc
C - - - - - 0x02EA26 0B:AA16: 29 08     AND #$08
C - - - - - 0x02EA28 0B:AA18: F0 12     BEQ bra_AA2C
C - - - - - 0x02EA2A 0B:AA1A: 8A        TXA
C - - - - - 0x02EA2B 0B:AA1B: 49 01     EOR #$01
C - - - - - 0x02EA2D 0B:AA1D: A8        TAY
C - - - - - 0x02EA2E 0B:AA1E: B9 A2 00  LDA ram_plr_id,Y
C - - - - - 0x02EA31 0B:AA21: 0A        ASL
C - - - - - 0x02EA32 0B:AA22: 0A        ASL
C - - - - - 0x02EA33 0B:AA23: 0A        ASL
C - - - - - 0x02EA34 0B:AA24: 75 A2     ADC ram_plr_id,X
C - - - - - 0x02EA36 0B:AA26: A8        TAY
C - - - - - 0x02EA37 0B:AA27: B9 90 AA  LDA tbl_AA90_автобаланс,Y
bra_AA2A:
C - - - - - 0x02EA3A 0B:AA2A: 95 A0     STA ram_strength,X
bra_AA2C:
C - - - - - 0x02EA3C 0B:AA2C: A0 01     LDY #$01
C - - - - - 0x02EA3E 0B:AA2E: 4C 68 F7  JMP loc_0x03F778


; bzk garbage
- - - - - - 0x02EA41 0B:AA31: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EA50 0B:AA40: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



sub_AA50_автобаланс_силы:
C - - - - - 0x02EA60 0B:AA50: 48        PHA
C - - - - - 0x02EA61 0B:AA51: AD 2B 01  LDA ram_option_misc
C - - - - - 0x02EA64 0B:AA54: 29 08     AND #$08
C - - - - - 0x02EA66 0B:AA56: C9 08     CMP #$08
C - - - - - 0x02EA68 0B:AA58: 68        PLA
C - - - - - 0x02EA69 0B:AA59: 90 31     BCC bra_AA8C
C - - - - - 0x02EA6B 0B:AA5B: A4 27     LDY ram_0027
C - - - - - 0x02EA6D 0B:AA5D: C0 01     CPY #$01
C - - - - - 0x02EA6F 0B:AA5F: D0 2B     BNE bra_AA8C
C - - - - - 0x02EA71 0B:AA61: 86 9C     STX ram_009C
C - - - - - 0x02EA73 0B:AA63: A0 01     LDY #$01
C - - - - - 0x02EA75 0B:AA65: 84 9D     STY ram_009D
C - - - - - 0x02EA77 0B:AA67: C9 FF     CMP #$FF
C - - - - - 0x02EA79 0B:AA69: D0 02     BNE bra_AA6D
C - - - - - 0x02EA7B 0B:AA6B: A9 06     LDA #$06
bra_AA6D:
C - - - - - 0x02EA7D 0B:AA6D: 95 A2     STA ram_plr_id,X
bra_AA6F_loop:
C - - - - - 0x02EA7F 0B:AA6F: 8D 50 05  STA ram_obj_id
C - - - - - 0x02EA82 0B:AA72: 8A        TXA
C - - - - - 0x02EA83 0B:AA73: 49 01     EOR #$01
C - - - - - 0x02EA85 0B:AA75: AA        TAX
C - - - - - 0x02EA86 0B:AA76: AD 50 05  LDA ram_obj_id
C - - - - - 0x02EA89 0B:AA79: 0A        ASL
C - - - - - 0x02EA8A 0B:AA7A: 0A        ASL
C - - - - - 0x02EA8B 0B:AA7B: 0A        ASL
C - - - - - 0x02EA8C 0B:AA7C: 75 A2     ADC ram_plr_id,X
C - - - - - 0x02EA8E 0B:AA7E: A8        TAY
C - - - - - 0x02EA8F 0B:AA7F: B9 90 AA  LDA tbl_AA90_автобаланс,Y
C - - - - - 0x02EA92 0B:AA82: 95 A0     STA ram_strength,X
C - - - - - 0x02EA94 0B:AA84: B5 A2     LDA ram_plr_id,X
C - - - - - 0x02EA96 0B:AA86: C6 9D     DEC ram_009D
C - - - - - 0x02EA98 0B:AA88: 10 E5     BPL bra_AA6F_loop
C - - - - - 0x02EA9A 0B:AA8A: A6 9C     LDX ram_009C
bra_AA8C:
C - - - - - 0x02EA9C 0B:AA8C: AC E0 04  LDY ram_obj_04E0
C - - - - - 0x02EA9F 0B:AA8F: 60        RTS



; bzk optimize, переделать под нормальную таблицу
; предположительно сейчас не так вычисляется как я написал
tbl_AA90_автобаланс:
;                                              +---------------------------------------- 00 leo
;                                              |    +----------------------------------- 01 raph
;                                              |    |    +------------------------------ 02 mike
;                                              |    |    |    +------------------------- 03 don
;                                              |    |    |    |    +-------------------- 04 casey
;                                              |    |    |    |    |    +--------------- 05 hot
;                                              |    |    |    |    |    |    +---------- 06 shred
;                                              |    |    |    |    |    |    |    +----- 07 placeholder
;                                              |    |    |    |    |    |    |    |
- D 1 - - - 0x02EAA0 0B:AA90: 00        .byte $00, $00, $01, $00, $01, $FE, $FD, $00   ; 00 leo
- D 1 - - - 0x02EAA8 0B:AA98: 00        .byte $00, $00, $01, $00, $01, $FE, $FD, $00   ; 01 raph
- D 1 - - - 0x02EAB0 0B:AAA0: 00        .byte $00, $00, $00, $00, $00, $FD, $FD, $00   ; 02 mike
- D 1 - - - 0x02EAB8 0B:AAA8: 00        .byte $00, $00, $01, $00, $01, $FE, $FD, $00   ; 03 don
- D 1 - - - 0x02EAC0 0B:AAB0: 00        .byte $00, $00, $01, $00, $01, $FE, $FE, $00   ; 04 casey
- D 1 - - - 0x02EAC8 0B:AAB8: 01        .byte $01, $01, $02, $02, $01, $FE, $FE, $01   ; 05 hot
- D 1 - - - 0x02EAD0 0B:AAC0: 02        .byte $02, $02, $03, $03, $03, $00, $FE, $02   ; 06 shred
- - - - - - 0x02EAD8 0B:AAC8: 00        .byte $00, $00, $01, $00, $01, $FE, $FD, $00   ; 07 placeholder


; bzk garbage
- - - - - - 0x02EAE0 0B:AAD0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EAF0 0B:AAE0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EB00 0B:AAF0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



loc_0x02EB10:
C D 1 - - - 0x02EB10 0B:AB00: A9 00     LDA #$00
C - - - - - 0x02EB12 0B:AB02: 85 1C     STA ram_001C
C - - - - - 0x02EB14 0B:AB04: 8A        TXA
C - - - - - 0x02EB15 0B:AB05: 49 01     EOR #$01
C - - - - - 0x02EB17 0B:AB07: A8        TAY
C - - - - - 0x02EB18 0B:AB08: 84 1A     STY ram_001A
; * 07
C - - - - - 0x02EB1A 0B:AB0A: B9 50 05  LDA ram_obj_id,Y
C - - - - - 0x02EB1D 0B:AB0D: 0A        ASL
C - - - - - 0x02EB1E 0B:AB0E: 0A        ASL
C - - - - - 0x02EB1F 0B:AB0F: 0A        ASL
C - - - - - 0x02EB20 0B:AB10: 38        SEC
C - - - - - 0x02EB21 0B:AB11: F9 50 05  SBC ram_obj_id,Y
C - - - - - 0x02EB24 0B:AB14: 18        CLC
C - - - - - 0x02EB25 0B:AB15: 7D 50 05  ADC ram_obj_id,X
C - - - - - 0x02EB28 0B:AB18: C9 21     CMP #$21
C - - - - - 0x02EB2A 0B:AB1A: D0 29     BNE bra_AB45
C - - - - - 0x02EB2C 0B:AB1C: 48        PHA
C - - - - - 0x02EB2D 0B:AB1D: B9 0D 01  LDA ram_010D,Y
C - - - - - 0x02EB30 0B:AB20: F0 03     BEQ bra_AB25
- - - - - - 0x02EB32 0B:AB22: 20 70 AB  JSR sub_AB70
bra_AB25:
C - - - - - 0x02EB35 0B:AB25: 85 1B     STA ram_001B
C - - - - - 0x02EB37 0B:AB27: A4 1A     LDY ram_001A
C - - - - - 0x02EB39 0B:AB29: B9 90 05  LDA ram_obj_0590,Y
C - - - - - 0x02EB3C 0B:AB2C: 20 70 AB  JSR sub_AB70
C - - - - - 0x02EB3F 0B:AB2F: 18        CLC
C - - - - - 0x02EB40 0B:AB30: 65 1B     ADC ram_001B
C - - - - - 0x02EB42 0B:AB32: C9 90     CMP #$90
C - - - - - 0x02EB44 0B:AB34: B0 0E     BCS bra_AB44
C - - - - - 0x02EB46 0B:AB36: E6 1C     INC ram_001C
C - - - - - 0x02EB48 0B:AB38: C9 60     CMP #$60
C - - - - - 0x02EB4A 0B:AB3A: B0 08     BCS bra_AB44
- - - - - - 0x02EB4C 0B:AB3C: E6 1C     INC ram_001C
- - - - - - 0x02EB4E 0B:AB3E: C9 30     CMP #$30
- - - - - - 0x02EB50 0B:AB40: B0 02     BCS bra_AB44
- - - - - - 0x02EB52 0B:AB42: E6 1C     INC ram_001C
bra_AB44:
C - - - - - 0x02EB54 0B:AB44: 68        PLA
bra_AB45:
C - - - - - 0x02EB55 0B:AB45: A8        TAY
C - - - - - 0x02EB56 0B:AB46: 68        PLA
C - - - - - 0x02EB57 0B:AB47: 18        CLC
C - - - - - 0x02EB58 0B:AB48: 65 1C     ADC ram_001C
C - - - - - 0x02EB5A 0B:AB4A: 65 1C     ADC ram_001C
C - - - - - 0x02EB5C 0B:AB4C: 38        SEC
C - - - - - 0x02EB5D 0B:AB4D: F9 B6 DD  SBC tbl_0x03DDC6,Y
C - - - - - 0x02EB60 0B:AB50: 48        PHA
C - - - - - 0x02EB61 0B:AB51: A9 DE     LDA #> (ofs_0x03DE76 - $01)
C - - - - - 0x02EB63 0B:AB53: 48        PHA
C - - - - - 0x02EB64 0B:AB54: A9 65     LDA #< (ofs_0x03DE76 - $01)
C - - - - - 0x02EB66 0B:AB56: 48        PHA
C - - - - - 0x02EB67 0B:AB57: 4C 17 F6  JMP loc_0x03F627_restore_prg


; bzk garbage
- - - - - - 0x02EB6A 0B:AB5A: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EB70 0B:AB60: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



sub_AB70:
C - - - - - 0x02EB80 0B:AB70: AC 28 01  LDY ram_option_health
C - - - - - 0x02EB83 0B:AB73: F0 16     BEQ bra_AB8B
- - - - - - 0x02EB85 0B:AB75: 88        DEY
- - - - - - 0x02EB86 0B:AB76: D0 12     BNE bra_AB8A
- - - - - - 0x02EB88 0B:AB78: 85 03     STA ram_0003
- - - - - - 0x02EB8A 0B:AB7A: 4A        LSR
- - - - - - 0x02EB8B 0B:AB7B: 69 21     ADC #$21
- - - - - - 0x02EB8D 0B:AB7D: 4A        LSR
- - - - - - 0x02EB8E 0B:AB7E: A0 03     LDY #$03
bra_AB80_loop:
- - - - - - 0x02EB90 0B:AB80: 18        CLC
- - - - - - 0x02EB91 0B:AB81: 65 03     ADC ram_0003
- - - - - - 0x02EB93 0B:AB83: 6A        ROR
- - - - - - 0x02EB94 0B:AB84: 4A        LSR
- - - - - - 0x02EB95 0B:AB85: 88        DEY
- - - - - - 0x02EB96 0B:AB86: D0 F8     BNE bra_AB80_loop
- - - - - - 0x02EB98 0B:AB88: 0A        ASL
- - - - - - 0x02EB99 0B:AB89: 60        RTS
bra_AB8A:
- - - - - - 0x02EB9A 0B:AB8A: 4A        LSR
bra_AB8B:
C - - - - - 0x02EB9B 0B:AB8B: 4A        LSR
C - - - - - 0x02EB9C 0B:AB8C: 0A        ASL
C - - - - - 0x02EB9D 0B:AB8D: 60        RTS


; bzk garbage
- - - - - - 0x02EB9E 0B:AB8E: FF        .byte $FF, $FF   ; 
- - - - - - 0x02EBA0 0B:AB90: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EBB0 0B:ABA0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EBC0 0B:ABB0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EBD0 0B:ABC0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EBE0 0B:ABD0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EBF0 0B:ABE0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EC00 0B:ABF0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



tbl_ABFC:
- D 1 - - - 0x02EC0C 0B:ABFC: 58        .byte $58   ; 00
- D 1 - - - 0x02EC0D 0B:ABFD: 58        .byte $58   ; 01
- D 1 - - - 0x02EC0E 0B:ABFE: 58        .byte $58   ; 02
- D 1 - - - 0x02EC0F 0B:ABFF: 76        .byte $76   ; 03



sub_AC00:
C - - - - - 0x02EC10 0B:AC00: A4 2C     LDY ram_002C
C - - - - - 0x02EC12 0B:AC02: B9 FC AB  LDA tbl_ABFC,Y
C - - - - - 0x02EC15 0B:AC05: 85 33     STA ram_0033
C - - - - - 0x02EC17 0B:AC07: 60        RTS


; bzk garbage
- - - - - - 0x02EC18 0B:AC08: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EC20 0B:AC10: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EC30 0B:AC20: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EC40 0B:AC30: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EC50 0B:AC40: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EC60 0B:AC50: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EC70 0B:AC60: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EC80 0B:AC70: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EC90 0B:AC80: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02ECA0 0B:AC90: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02ECB0 0B:ACA0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



tbl_ACB0:
; green, original
- D 1 - - - 0x02ECC0 0B:ACB0: 00        .word off_AD00_00
- D 1 - - - 0x02ECC1 0B:ACB1: 0C        .word off_AD0C_01
- D 1 - - - 0x02ECC2 0B:ACB2: 00        .word off_AD00_02
- D 1 - - - 0x02ECC3 0B:ACB3: 0C        .word off_AD0C_03
- D 1 - - - 0x02ECC4 0B:ACB4: 18        .word off_AD18_04
- D 1 - - - 0x02ECC5 0B:ACB5: 18        .word off_AD18_05
- D 1 - - - 0x02ECC6 0B:ACB6: 24        .word off_AD24_06
- D 1 - - - 0x02ECC7 0B:ACB7: 30        .word off_AD30_07
; night
- - - - - - 0x02ECD0 0B:ACC0: 80        .word off_AD80_10
- - - - - - 0x02ECD1 0B:ACC1: 8C        .word off_AD8C_11
- - - - - - 0x02ECD2 0B:ACC2: 80        .word off_AD80_12
- - - - - - 0x02ECD3 0B:ACC3: 8C        .word off_AD8C_13
- - - - - - 0x02ECD4 0B:ACC4: 98        .word off_AD98_14
- - - - - - 0x02ECD5 0B:ACC5: 98        .word off_AD98_15
- - - - - - 0x02ECD6 0B:ACC6: A4        .word off_ADA4_16
- - - - - - 0x02ECD7 0B:ACC7: B0        .word off_ADB0_17


; bzk garbage
- - - - - - 0x02ECD8 0B:ACC8: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



tbl_ACD0_палитра:
- D 1 - - - 0x02ECE0 0B:ACD0: 0F        .byte $0F, $16, $1A, $20   ; 
- D 1 - - - 0x02ECE4 0B:ACD4: 0F        .byte $0F, $0B, $2A, $12   ; 
- D 1 - - - 0x02ECE8 0B:ACD8: 0F        .byte $0F, $07, $16, $31   ; 
- D 1 - - - 0x02ECEC 0B:ACDC: 0F        .byte $0F, $04, $16, $37   ; 
- D 1 - - - 0x02ECF0 0B:ACE0: 0F        .byte $0F, $11, $21, $20   ; 


; bzk garbage
- - - - - - 0x02ECF4 0B:ACE4: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02ED00 0B:ACF0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



off_AD00_00:
off_AD00_02:
- D 1 - I - 0x02ED10 0B:AD00: 0F        .byte $0F, $17, $27, $38   ; 
- D 1 - I - 0x02ED14 0B:AD04: 0F        .byte $0F, $04, $14, $24   ; 
- D 1 - I - 0x02ED18 0B:AD08: 0F        .byte $0F, $06, $16, $26   ; 

off_AD0C_01:
off_AD0C_03:
- D 1 - I - 0x02ED1C 0B:AD0C: 0F        .byte $0F, $00, $10, $20   ; 
- D 1 - I - 0x02ED20 0B:AD10: 0F        .byte $0F, $06, $16, $27   ; 
- D 1 - I - 0x02ED24 0B:AD14: 0F        .byte $0F, $08, $18, $28   ; 

off_AD18_04:
off_AD18_05:
- D 1 - I - 0x02ED28 0B:AD18: 0F        .byte $0F, $07, $17, $27   ; 
- D 1 - I - 0x02ED2C 0B:AD1C: 0F        .byte $0F, $06, $16, $26   ; 
- D 1 - I - 0x02ED30 0B:AD20: 0F        .byte $0F, $05, $07, $10   ; 

off_AD24_06:
- D 1 - I - 0x02ED34 0B:AD24: 0F        .byte $0F, $0C, $1C, $21   ; 
- D 1 - I - 0x02ED38 0B:AD28: 0F        .byte $0F, $01, $11, $21   ; 
- D 1 - I - 0x02ED3C 0B:AD2C: 0F        .byte $0F, $03, $13, $23   ; 

off_AD30_07:
- D 1 - I - 0x02ED40 0B:AD30: 0F        .byte $0F, $20, $10, $00   ; 
- D 1 - I - 0x02ED44 0B:AD34: 0F        .byte $0F, $37, $27, $17   ; 
- D 1 - I - 0x02ED48 0B:AD38: 0F        .byte $0F, $06, $16, $26   ; 


; bzk garbage
- - - - - - 0x02ED4C 0B:AD3C: FF        .byte $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02ED50 0B:AD40: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02ED60 0B:AD50: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02ED70 0B:AD60: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02ED80 0B:AD70: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



off_AD80_10:
off_AD80_12:
- - - - - - 0x02ED90 0B:AD80: 0F        .byte $0F, $01, $11, $21   ; 
- - - - - - 0x02ED94 0B:AD84: 0F        .byte $0F, $03, $13, $23   ; 
- - - - - - 0x02ED98 0B:AD88: 0F        .byte $0F, $0C, $1C, $21   ; 

off_AD8C_11:
off_AD8C_13:
- - - - - - 0x02ED9C 0B:AD8C: 0F        .byte $0F, $01, $11, $21   ; 
- - - - - - 0x02EDA0 0B:AD90: 0F        .byte $0F, $03, $13, $23   ; 
- - - - - - 0x02EDA4 0B:AD94: 0F        .byte $0F, $0C, $1C, $21   ; 

off_AD98_14:
off_AD98_15:
- - - - - - 0x02EDA8 0B:AD98: 0F        .byte $0F, $01, $11, $21   ; 
- - - - - - 0x02EDAC 0B:AD9C: 0F        .byte $0F, $0C, $1C, $21   ; 
- - - - - - 0x02EDB0 0B:ADA0: 0F        .byte $0F, $03, $02, $23   ; 

off_ADA4_16:
- - - - - - 0x02EDB4 0B:ADA4: 0F        .byte $0F, $0C, $1C, $21   ; 
- - - - - - 0x02EDB8 0B:ADA8: 0F        .byte $0F, $01, $11, $21   ; 
- - - - - - 0x02EDBC 0B:ADAC: 0F        .byte $0F, $03, $13, $23   ; 

off_ADB0_17:
- - - - - - 0x02EDC0 0B:ADB0: 0F        .byte $0F, $20, $10, $00   ; 
- - - - - - 0x02EDC4 0B:ADB4: 0F        .byte $0F, $2C, $1C, $0C   ; 
- - - - - - 0x02EDC8 0B:ADB8: 0F        .byte $0F, $03, $13, $23   ; 


; bzk garbage
- - - - - - 0x02EDCC 0B:ADBC: FF        .byte $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EDD0 0B:ADC0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EDE0 0B:ADD0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EDF0 0B:ADE0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EE00 0B:ADF0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EE10 0B:AE00: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EE20 0B:AE10: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



tbl_AE20:
- D 1 - - - 0x02EE30 0B:AE20: 0A        .byte $0A   ; 00
- D 1 - - - 0x02EE31 0B:AE21: 14        .byte $14   ; 01
- D 1 - - - 0x02EE32 0B:AE22: 0A        .byte $0A   ; 02
- D 1 - - - 0x02EE33 0B:AE23: 14        .byte $14   ; 03
- D 1 - - - 0x02EE34 0B:AE24: 0E        .byte $0E   ; 04
- D 1 - - - 0x02EE35 0B:AE25: 0E        .byte $0E   ; 05
- D 1 - - - 0x02EE36 0B:AE26: 08        .byte $08   ; 06
- D 1 - - - 0x02EE37 0B:AE27: 3E        .byte $3E   ; 07


; bzk garbage
- - - - - - 0x02EE38 0B:AE28: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



tbl_AE30:
- D 1 - - - 0x02EE40 0B:AE30: 68        .byte $68, $6A   ; 00
- D 1 - - - 0x02EE42 0B:AE32: 64        .byte $64, $66   ; 01
- D 1 - - - 0x02EE44 0B:AE34: 68        .byte $68, $6A   ; 02
- D 1 - - - 0x02EE46 0B:AE36: 64        .byte $64, $66   ; 03
- D 1 - - - 0x02EE48 0B:AE38: 60        .byte $60, $62   ; 04
- D 1 - - - 0x02EE4A 0B:AE3A: 60        .byte $60, $62   ; 05
- D 1 - - - 0x02EE4C 0B:AE3C: 5C        .byte $5C, $5E   ; 06
- D 1 - - - 0x02EE4E 0B:AE3E: 88        .byte $88, $8A   ; 07


; bzk garbage
- - - - - - 0x02EE50 0B:AE40: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



sub_0x02EE60_выбрать_палитру_уровня:
C - - - - - 0x02EE60 0B:AE50: A5 9E     LDA ram_009E
C - - - - - 0x02EE62 0B:AE52: 8D 5C 01  STA ram_015C
C - - - - - 0x02EE65 0B:AE55: EE 52 01  INC ram_0152
C - - - - - 0x02EE68 0B:AE58: 20 8C FC  JSR sub_0x03FC9C_set_mirroring_V
C - - - - - 0x02EE6B 0B:AE5B: 8D CA 06  STA ram_06CA
C - - - - - 0x02EE6E 0B:AE5E: 8D CB 06  STA ram_06CB
C - - - - - 0x02EE71 0B:AE61: 8D 71 06  STA ram_0671
C - - - - - 0x02EE74 0B:AE64: 85 AA     STA ram_00AA
C - - - - - 0x02EE76 0B:AE66: 85 86     STA ram_0086
C - - - - - 0x02EE78 0B:AE68: 85 4D     STA ram_004D
C - - - - - 0x02EE7A 0B:AE6A: A9 01     LDA #$01
C - - - - - 0x02EE7C 0B:AE6C: 85 48     STA ram_0048
C - - - - - 0x02EE7E 0B:AE6E: 85 49     STA ram_0049
C - - - - - 0x02EE80 0B:AE70: A5 9E     LDA ram_009E
C - - - - - 0x02EE82 0B:AE72: 0A        ASL
C - - - - - 0x02EE83 0B:AE73: A8        TAY
C - - - - - 0x02EE84 0B:AE74: A9 D0     LDA #< ofs_0x03F8E0
C - - - - - 0x02EE86 0B:AE76: 85 4B     STA ram_004B
C - - - - - 0x02EE88 0B:AE78: A9 F8     LDA #> ofs_0x03F8E0
C - - - - - 0x02EE8A 0B:AE7A: 85 4C     STA ram_004C
C - - - - - 0x02EE8C 0B:AE7C: B9 30 AE  LDA tbl_AE30,Y
C - - - - - 0x02EE8F 0B:AE7F: 85 4E     STA ram_004E
C - - - - - 0x02EE91 0B:AE81: B9 31 AE  LDA tbl_AE30 + $01,Y
C - - - - - 0x02EE94 0B:AE84: 85 4F     STA ram_004F
C - - - - - 0x02EE9A 0B:AE8A: AD 2B 01  LDA ram_option_misc
C - - - - - 0x02EE9D 0B:AE8D: 29 02     AND #$02
C - - - - - 0x02EE9F 0B:AE8F: F0 02     BEQ bra_AE93
; if night
- - - - - - 0x02EEA1 0B:AE91: A9 10     LDA #$08
bra_AE93:
                                        .byte $2C   ; BIT
                                        LDA #$00
                                        CLC
C - - - - - 0x02EEA3 0B:AE93: 65 9E     ADC ram_009E
                                        ASL
C - - - - - 0x02EEA5 0B:AE95: AA        TAX
C - - - - - 0x02EEA6 0B:AE96: BD B0 AC  LDA tbl_ACB0,X
C - - - - - 0x02EEA9 0B:AE99: 85 00     STA ram_0000
                                        LDA tbl_ACB0 + $01,X
                                        STA ram_0001
C - - - - - 0x02EEAB 0B:AE9B: A0 0B     LDY #$0B
bra_AE9D_loop:
C - - - - - 0x02EEAD 0B:AE9D: B1 00     LDA (ram_0000),Y
C - - - - - 0x02EEAF 0B:AE9F: 99 4D 06  STA ram_064D,Y
C - - - - - 0x02EEB2 0B:AEA2: 88        DEY
C - - - - - 0x02EEB3 0B:AEA3: 10 F8     BPL bra_AE9D_loop
C - - - - - 0x02EEB5 0B:AEA5: A0 13     LDY #$13
bra_AEA7_loop:
C - - - - - 0x02EEB7 0B:AEA7: B9 D0 AC  LDA tbl_ACD0_палитра,Y
C - - - - - 0x02EEBA 0B:AEAA: 99 59 06  STA ram_0659,Y
C - - - - - 0x02EEBD 0B:AEAD: 88        DEY
C - - - - - 0x02EEBE 0B:AEAE: 10 F7     BPL bra_AEA7_loop
C - - - - - 0x02EEC0 0B:AEB0: 20 25 DC  JSR sub_0x03DC35
C - - - - - 0x02EEC3 0B:AEB3: 20 BE DA  JSR sub_0x03DACE_удалить_все_объекты
C - - - - - 0x02EEC6 0B:AEB6: E6 95     INC ram_0095
C - - - - - 0x02EEC8 0B:AEB8: A9 60     LDA #$60
C - - - - - 0x02EECA 0B:AEBA: 85 A6     STA ram_00A6
C - - - - - 0x02EECC 0B:AEBC: A4 9E     LDY ram_009E
C - - - - - 0x02EECE 0B:AEBE: BE 20 AE  LDX tbl_AE20,Y
C - - - - - 0x02EED1 0B:AEC1: 60        RTS



tbl_AF3D:
- D 1 - - - 0x02EF4D 0B:AF3D: 21        .word tbl_B3EA_green   ; 00
- - - - - - 0x02EF4E 0B:AF3E: 23        .word tbl_B1EA_original   ; 01
- - - - - - 0x02EF4F 0B:AF3F: 25        .word tbl_AFEA_night   ; 02



sub_0x02EF50:
; требуются поинтеры для 0x02EFFA 0x02F1FA 0x02F3FA
C - - - - - 0x02EF50 0B:AF40: AD 2B 01  LDA ram_option_misc
C - - - - - 0x02EF53 0B:AF43: 29 07     AND #$07
                                        ASL
C - - - - - 0x02EF55 0B:AF45: A8        TAY
; загрузить базовый поинтер палитры
                                        LDA tbl_AF3D,Y
C - - - - - 0x02EF56 0B:AF46: A5 01     STA ram_0000
C - - - - - 0x02EF58 0B:AF48: F9 3D AF  LDA tbl_AF3D + $01,Y
C - - - - - 0x02EF5B 0B:AF4B: 85 01     STA ram_0001
                                        JSR sub_D37C_подкорректировать_поинтер_палитры
                                        CLC
                                        ADC ram_0000
                                        STA ram_0000
                                        TYA
                                        ADC ram_0001
                                        STA ram_0001
                                        INX
                                        TXA
                                        ASL
                                        ASL
                                        TAX
C - - - - - 0x02EF5D 0B:AF4D: A0 02     LDY #$02
bra_AF4F_loop:
C - - - - - 0x02EF5F 0B:AF4F: B1 00     LDA (ram_0000),Y
C - - - - - 0x02EF61 0B:AF51: 9D 4C 06  STA ram_064C,X
C - - - - - 0x02EF64 0B:AF54: CA        DEX
C - - - - - 0x02EF65 0B:AF55: 88        DEY
C - - - - - 0x02EF66 0B:AF56: 10 F7     BPL bra_AF4F_loop
C - - - - - 0x02EF68 0B:AF58: 4C 17 F6  RTS



sub_D37C_подкорректировать_поинтер_палитры:
; перемещено из банка FF
C D 2 - - - 0x03D38C 0F:D37C: 85 05     LDA ram_0005
C - - - - - 0x03D38E 0F:D37E: AC 93 D3  LDY #$00
C - - - - - 0x03D391 0F:D381: 0A        ASL
C - - - - - 0x03D392 0F:D382: 20 8D D3  JSR sub_D38D
C - - - - - 0x03D395 0F:D385: 65 05     ADC ram_0005
C - - - - - 0x03D397 0F:D387: 20 8D D3  JSR sub_D38D
C - - - - - 0x03D39A 0F:D38A: 6D 92 D3  ADC #$00
sub_D38D:
C - - - - - 0x03D39D 0F:D38D: 90 02     BCC bra_D391_RTS
C - - - - - 0x03D39F 0F:D38F: 18        CLC
C - - - - - 0x03D3A0 0F:D390: C8        INY
bra_D391_RTS:
C - - - - - 0x03D3A1 0F:D391: 60        RTS


; bzk garbage
- - - - - - 0x02EF6B 0B:AF5B: FF        .byte $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EF70 0B:AF60: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EF80 0B:AF70: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EF90 0B:AF80: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



loc_0x02EFA0:
C D 1 - - - 0x02EFA0 0B:AF90: 68        PLA
C - - - - - 0x02EFA1 0B:AF91: 8D 3F 06  STA ram_063F
C - - - - - 0x02EFA4 0B:AF94: 30 1D     BMI bra_AFB3_RTS
C - - - - - 0x02EFA6 0B:AF96: A4 2C     LDY ram_002C
C - - - - - 0x02EFA8 0B:AF98: C0 01     CPY #$01
C - - - - - 0x02EFAA 0B:AF9A: D0 17     BNE bra_AFB3_RTS
- - - - - - 0x02EFAC 0B:AF9C: AA        TAX
- - - - - - 0x02EFAD 0B:AF9D: BD 29 01  LDA ram_0129,X
- - - - - - 0x02EFB0 0B:AFA0: 29 0F     AND #$0F
- - - - - - 0x02EFB2 0B:AFA2: 49 09     EOR #$09
- - - - - - 0x02EFB4 0B:AFA4: D0 0A     BNE bra_AFB0
- - - - - - 0x02EFB6 0B:AFA6: BD 29 01  LDA ram_0129,X
- - - - - - 0x02EFB9 0B:AFA9: 29 F0     AND #$F0
- - - - - - 0x02EFBB 0B:AFAB: 69 0E     ADC #$0E
- - - - - - 0x02EFBD 0B:AFAD: 9D 29 01  STA ram_0129,X
bra_AFB0:
- - - - - - 0x02EFC0 0B:AFB0: FE 29 01  INC ram_0129,X
bra_AFB3_RTS:
C - - - - - 0x02EFC3 0B:AFB3: 60        RTS


; bzk garbage
- - - - - - 0x02EFC4 0B:AFB4: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EFD0 0B:AFC0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EFE0 0B:AFD0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02EFF0 0B:AFE0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



tbl_AFEA_night:
- - - - - - 0x02EFFA 0B:AFEA: 20        .byte $20, $20, $20   ; 00
- - - - - - 0x02EFFD 0B:AFED: 16        .byte $16, $1A, $20   ; 01
- - - - - - 0x02F000 0B:AFF0: 01        .byte $01, $11, $21   ; 02
- - - - - - 0x02F003 0B:AFF3: 0C        .byte $0C, $1C, $21   ; 03
- - - - - - 0x02F006 0B:AFF6: 01        .byte $01, $11, $21   ; 04
- - - - - - 0x02F009 0B:AFF9: 03        .byte $03, $13, $23   ; 05
- - - - - - 0x02F00C 0B:AFFC: 0A        .byte $0A, $1A, $2A   ; 06
- - - - - - 0x02F00F 0B:AFFF: 0F        .byte $0F, $06, $20   ; 07
- - - - - - 0x02F012 0B:B002: 06        .byte $06, $16, $20   ; 08
- - - - - - 0x02F015 0B:B005: 03        .byte $03, $13, $23   ; 09
- - - - - - 0x02F018 0B:B008: 07        .byte $07, $15, $28   ; 0A
- - - - - - 0x02F01B 0B:B00B: 01        .byte $01, $11, $21   ; 0B
- - - - - - 0x02F01E 0B:B00E: 0C        .byte $0C, $1C, $21   ; 0C
- - - - - - 0x02F021 0B:B011: 0F        .byte $0F, $1A, $12   ; 0D
- - - - - - 0x02F024 0B:B014: 0F        .byte $0F, $1A, $16   ; 0E
- - - - - - 0x02F027 0B:B017: 0F        .byte $0F, $1A, $27   ; 0F
- - - - - - 0x02F02A 0B:B01A: 0F        .byte $0F, $1A, $14   ; 10
- - - - - - 0x02F02D 0B:B01D: 0F        .byte $0F, $16, $33   ; 11
- - - - - - 0x02F030 0B:B020: 0F        .byte $0F, $27, $30   ; 12
- - - - - - 0x02F033 0B:B023: 0F        .byte $0F, $28, $20   ; 13
- - - - - - 0x02F036 0B:B026: 18        .byte $18, $28, $37   ; 14
- - - - - - 0x02F039 0B:B029: 00        .byte $00, $00, $00   ; 15
- - - - - - 0x02F03C 0B:B02C: 03        .byte $03, $02, $23   ; 16
- - - - - - 0x02F03F 0B:B02F: 0B        .byte $0B, $1A, $29   ; 17
- - - - - - 0x02F042 0B:B032: 06        .byte $06, $06, $06   ; 18
- - - - - - 0x02F045 0B:B035: 0F        .byte $0F, $2C, $12   ; 19
- - - - - - 0x02F048 0B:B038: 0F        .byte $0F, $2C, $16   ; 1A
- - - - - - 0x02F04B 0B:B03B: 0F        .byte $0F, $2C, $27   ; 1B
- - - - - - 0x02F04E 0B:B03E: 0F        .byte $0F, $2C, $14   ; 1C
- - - - - - 0x02F051 0B:B041: 0F        .byte $0F, $08, $39   ; 1D
- - - - - - 0x02F054 0B:B044: 0F        .byte $0F, $18, $30   ; 1E
- - - - - - 0x02F057 0B:B047: 0F        .byte $0F, $04, $30   ; 1F
- - - - - - 0x02F05A 0B:B04A: 05        .byte $05, $16, $26   ; 20
- - - - - - 0x02F05D 0B:B04D: 00        .byte $00, $00, $00   ; 21
- - - - - - 0x02F060 0B:B050: 20        .byte $20, $38, $20   ; 22
- - - - - - 0x02F063 0B:B053: 0F        .byte $0F, $0F, $00   ; 23
- - - - - - 0x02F066 0B:B056: 16        .byte $16, $0F, $26   ; 24
- - - - - - 0x02F069 0B:B059: 16        .byte $16, $20, $38   ; 25
- - - - - - 0x02F06C 0B:B05C: 13        .byte $13, $23, $02   ; 26
- - - - - - 0x02F06F 0B:B05F: 03        .byte $03, $13, $02   ; 27
- - - - - - 0x02F072 0B:B062: 0F        .byte $0F, $00, $10   ; 28
- - - - - - 0x02F075 0B:B065: 03        .byte $03, $13, $23   ; 29
- - - - - - 0x02F078 0B:B068: 1C        .byte $1C, $2C, $3C   ; 2A
- - - - - - 0x02F07B 0B:B06B: 01        .byte $01, $11, $21   ; 2B
- - - - - - 0x02F07E 0B:B06E: 11        .byte $11, $19, $29   ; 2C
- - - - - - 0x02F081 0B:B071: 01        .byte $01, $11, $21   ; 2D
- - - - - - 0x02F084 0B:B074: 05        .byte $05, $15, $20   ; 2E
- - - - - - 0x02F087 0B:B077: 18        .byte $18, $28, $20   ; 2F
- - - - - - 0x02F08A 0B:B07A: 03        .byte $03, $13, $20   ; 30
- - - - - - 0x02F08D 0B:B07D: 06        .byte $06, $16, $20   ; 31
- - - - - - 0x02F090 0B:B080: 12        .byte $12, $22, $32   ; 32
- - - - - - 0x02F093 0B:B083: 16        .byte $16, $26, $36   ; 33
- - - - - - 0x02F096 0B:B086: 13        .byte $13, $23, $33   ; 34
- - - - - - 0x02F099 0B:B089: 1A        .byte $1A, $2A, $23   ; 35
- - - - - - 0x02F09C 0B:B08C: 18        .byte $18, $28, $23   ; 36
- - - - - - 0x02F09F 0B:B08F: 10        .byte $10, $20, $23   ; 37
- - - - - - 0x02F0A2 0B:B092: 15        .byte $15, $25, $23   ; 38
- - - - - - 0x02F0A5 0B:B095: 14        .byte $14, $24, $23   ; 39
- - - - - - 0x02F0A8 0B:B098: 18        .byte $18, $28, $1A   ; 3A
- - - - - - 0x02F0AB 0B:B09B: 08        .byte $08, $24, $28   ; 3B
- - - - - - 0x02F0AE 0B:B09E: 0C        .byte $0C, $1C, $21   ; 3C
- - - - - - 0x02F0B1 0B:B0A1: 14        .byte $14, $24, $23   ; 3D
- - - - - - 0x02F0B4 0B:B0A4: 18        .byte $18, $28, $27   ; 3E
- - - - - - 0x02F0B7 0B:B0A7: 0F        .byte $0F, $38, $37   ; 3F
- - - - - - 0x02F0BA 0B:B0AA: 14        .byte $14, $24, $30   ; 40
- - - - - - 0x02F0BD 0B:B0AD: 0C        .byte $0C, $1C, $2C   ; 41
- - - - - - 0x02F0C0 0B:B0B0: 20        .byte $20, $1A, $21   ; 42
- - - - - - 0x02F0C3 0B:B0B3: 1A        .byte $1A, $2A, $11   ; 43
- - - - - - 0x02F0C6 0B:B0B6: 1A        .byte $1A, $2A, $16   ; 44
- - - - - - 0x02F0C9 0B:B0B9: 1A        .byte $1A, $2A, $27   ; 45
- - - - - - 0x02F0CC 0B:B0BC: 1A        .byte $1A, $2A, $14   ; 46
- - - - - - 0x02F0CF 0B:B0BF: 17        .byte $17, $27, $05   ; 47
- - - - - - 0x02F0D2 0B:B0C2: 18        .byte $18, $28, $20   ; 48
- - - - - - 0x02F0D5 0B:B0C5: 13        .byte $13, $23, $38   ; 49
- - - - - - 0x02F0D8 0B:B0C8: 17        .byte $17, $27, $28   ; 4A
- - - - - - 0x02F0DB 0B:B0CB: 01        .byte $01, $11, $38   ; 4B
- - - - - - 0x02F0DE 0B:B0CE: 16        .byte $16, $11, $20   ; 4C
- - - - - - 0x02F0E1 0B:B0D1: 1B        .byte $1B, $2B, $3B   ; 4D
- - - - - - 0x02F0E4 0B:B0D4: 17        .byte $17, $27, $37   ; 4E
- - - - - - 0x02F0E7 0B:B0D7: 13        .byte $13, $23, $20   ; 4F
- - - - - - 0x02F0EA 0B:B0DA: 23        .byte $23, $10, $20   ; 50
- - - - - - 0x02F0ED 0B:B0DD: 14        .byte $14, $23, $13   ; 51
- - - - - - 0x02F0F0 0B:B0E0: 13        .byte $13, $23, $13   ; 52
- - - - - - 0x02F0F3 0B:B0E3: 19        .byte $19, $29, $39   ; 53
- - - - - - 0x02F0F6 0B:B0E6: 0C        .byte $0C, $1C, $21   ; 54
- - - - - - 0x02F0F9 0B:B0E9: 02        .byte $02, $12, $32   ; 55
- - - - - - 0x02F0FC 0B:B0EC: 18        .byte $18, $14, $20   ; 56
- - - - - - 0x02F0FF 0B:B0EF: 03        .byte $03, $13, $23   ; 57
- - - - - - 0x02F102 0B:B0F2: 11        .byte $11, $2A, $20   ; 58
- - - - - - 0x02F105 0B:B0F5: 18        .byte $18, $28, $11   ; 59
- - - - - - 0x02F108 0B:B0F8: 16        .byte $16, $2A, $20   ; 5A
- - - - - - 0x02F10B 0B:B0FB: 18        .byte $18, $28, $16   ; 5B
- - - - - - 0x02F10E 0B:B0FE: 27        .byte $27, $2A, $20   ; 5C
- - - - - - 0x02F111 0B:B101: 14        .byte $14, $2A, $20   ; 5D
- - - - - - 0x02F114 0B:B104: 15        .byte $15, $27, $20   ; 5E
- - - - - - 0x02F117 0B:B107: 15        .byte $15, $10, $20   ; 5F
- - - - - - 0x02F11A 0B:B10A: 12        .byte $12, $15, $23   ; 60
- - - - - - 0x02F11D 0B:B10D: 13        .byte $13, $28, $20   ; 61
- - - - - - 0x02F120 0B:B110: 18        .byte $18, $28, $20   ; 62
- - - - - - 0x02F123 0B:B113: 18        .byte $18, $28, $16   ; 63
- - - - - - 0x02F126 0B:B116: 27        .byte $27, $13, $03   ; 64
- - - - - - 0x02F129 0B:B119: 18        .byte $18, $28, $14   ; 65
- - - - - - 0x02F12C 0B:B11C: 18        .byte $18, $28, $20   ; 66


; bzk garbage
- - - - - - 0x02F12F 0B:B11F: FF        .byte $FF   ; 
- - - - - - 0x02F130 0B:B120: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F140 0B:B130: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F150 0B:B140: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F160 0B:B150: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F170 0B:B160: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F180 0B:B170: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F190 0B:B180: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F1A0 0B:B190: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F1B0 0B:B1A0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F1C0 0B:B1B0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F1D0 0B:B1C0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F1E0 0B:B1D0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F1F0 0B:B1E0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



tbl_B1EA_original:
- - - - - - 0x02F1FA 0B:B1EA: 20        .byte $20, $20, $20   ; 00
- - - - - - 0x02F1FD 0B:B1ED: 16        .byte $16, $1A, $20   ; 01
- - - - - - 0x02F200 0B:B1F0: 00        .byte $00, $10, $20   ; 02
- - - - - - 0x02F203 0B:B1F3: 0C        .byte $0C, $1C, $21   ; 03
- - - - - - 0x02F206 0B:B1F6: 01        .byte $01, $11, $21   ; 04
- - - - - - 0x02F209 0B:B1F9: 03        .byte $03, $13, $23   ; 05
- - - - - - 0x02F20C 0B:B1FC: 0A        .byte $0A, $1A, $2A   ; 06
- - - - - - 0x02F20F 0B:B1FF: 04        .byte $04, $16, $37   ; 07
- - - - - - 0x02F212 0B:B202: 11        .byte $11, $21, $20   ; 08
- - - - - - 0x02F215 0B:B205: 06        .byte $06, $16, $27   ; 09
- - - - - - 0x02F218 0B:B208: 07        .byte $07, $15, $28   ; 0A
- - - - - - 0x02F21B 0B:B20B: 17        .byte $17, $27, $38   ; 0B
- - - - - - 0x02F21E 0B:B20E: 06        .byte $06, $16, $26   ; 0C
- - - - - - 0x02F221 0B:B211: 09        .byte $09, $2A, $11   ; 0D
- - - - - - 0x02F224 0B:B214: 0C        .byte $0C, $2C, $16   ; 0E
- - - - - - 0x02F227 0B:B217: 0B        .byte $0B, $2B, $27   ; 0F
- - - - - - 0x02F22A 0B:B21A: 08        .byte $08, $28, $14   ; 10
- - - - - - 0x02F22D 0B:B21D: 08        .byte $08, $27, $33   ; 11
- - - - - - 0x02F230 0B:B220: 08        .byte $08, $28, $20   ; 12
- - - - - - 0x02F233 0B:B223: 07        .byte $07, $16, $31   ; 13
- - - - - - 0x02F236 0B:B226: 18        .byte $18, $28, $37   ; 14
- - - - - - 0x02F239 0B:B229: 00        .byte $00, $00, $00   ; 15
- - - - - - 0x02F23C 0B:B22C: 05        .byte $05, $07, $10   ; 16
- - - - - - 0x02F23F 0B:B22F: 1B        .byte $1B, $21, $31   ; 17
- - - - - - 0x02F242 0B:B232: 01        .byte $01, $01, $01   ; 18
- - - - - - 0x02F245 0B:B235: 09        .byte $09, $1A, $11   ; 19
- - - - - - 0x02F248 0B:B238: 0A        .byte $0A, $1C, $15   ; 1A
- - - - - - 0x02F24B 0B:B23B: 0B        .byte $0B, $1B, $28   ; 1B
- - - - - - 0x02F24E 0B:B23E: 0A        .byte $0A, $19, $14   ; 1C
- - - - - - 0x02F251 0B:B241: 03        .byte $03, $27, $22   ; 1D
- - - - - - 0x02F254 0B:B244: 08        .byte $08, $27, $20   ; 1E
- - - - - - 0x02F257 0B:B247: 02        .byte $02, $22, $20   ; 1F
- - - - - - 0x02F25A 0B:B24A: 17        .byte $17, $28, $38   ; 20
- - - - - - 0x02F25D 0B:B24D: 00        .byte $00, $00, $00   ; 21
- - - - - - 0x02F260 0B:B250: 20        .byte $20, $38, $20   ; 22
- - - - - - 0x02F263 0B:B253: 0F        .byte $0F, $0F, $00   ; 23
- - - - - - 0x02F266 0B:B256: 16        .byte $16, $0F, $0F   ; 24
- - - - - - 0x02F269 0B:B259: 16        .byte $16, $20, $38   ; 25
- - - - - - 0x02F26C 0B:B25C: 16        .byte $16, $26, $02   ; 26
- - - - - - 0x02F26F 0B:B25F: 06        .byte $06, $16, $02   ; 27
- - - - - - 0x02F272 0B:B262: 0F        .byte $0F, $00, $10   ; 28
- - - - - - 0x02F275 0B:B265: 04        .byte $04, $14, $24   ; 29
- - - - - - 0x02F278 0B:B268: 1C        .byte $1C, $2C, $3C   ; 2A
- - - - - - 0x02F27B 0B:B26B: 07        .byte $07, $17, $27   ; 2B
- - - - - - 0x02F27E 0B:B26E: 11        .byte $11, $19, $29   ; 2C
- - - - - - 0x02F281 0B:B271: 01        .byte $01, $11, $20   ; 2D
- - - - - - 0x02F284 0B:B274: 05        .byte $05, $15, $20   ; 2E
- - - - - - 0x02F287 0B:B277: 18        .byte $18, $28, $20   ; 2F
- - - - - - 0x02F28A 0B:B27A: 03        .byte $03, $13, $20   ; 30
- - - - - - 0x02F28D 0B:B27D: 06        .byte $06, $16, $20   ; 31
- - - - - - 0x02F290 0B:B280: 12        .byte $12, $22, $32   ; 32
- - - - - - 0x02F293 0B:B283: 16        .byte $16, $26, $36   ; 33
- - - - - - 0x02F296 0B:B286: 13        .byte $13, $23, $33   ; 34
- - - - - - 0x02F299 0B:B289: 1A        .byte $1A, $2A, $23   ; 35
- - - - - - 0x02F29C 0B:B28C: 18        .byte $18, $28, $23   ; 36
- - - - - - 0x02F29F 0B:B28F: 10        .byte $10, $20, $23   ; 37
- - - - - - 0x02F2A2 0B:B292: 15        .byte $15, $25, $23   ; 38
- - - - - - 0x02F2A5 0B:B295: 14        .byte $14, $24, $23   ; 39
- - - - - - 0x02F2A8 0B:B298: 18        .byte $18, $28, $1A   ; 3A
- - - - - - 0x02F2AB 0B:B29B: 08        .byte $08, $24, $28   ; 3B
- - - - - - 0x02F2AE 0B:B29E: 08        .byte $08, $18, $28   ; 3C
- - - - - - 0x02F2B1 0B:B2A1: 14        .byte $14, $24, $23   ; 3D
- - - - - - 0x02F2B4 0B:B2A4: 18        .byte $18, $28, $27   ; 3E
- - - - - - 0x02F2B7 0B:B2A7: 0F        .byte $0F, $38, $37   ; 3F
- - - - - - 0x02F2BA 0B:B2AA: 16        .byte $16, $26, $20   ; 40
- - - - - - 0x02F2BD 0B:B2AD: 0C        .byte $0C, $1C, $2C   ; 41
- - - - - - 0x02F2C0 0B:B2B0: 20        .byte $20, $1A, $21   ; 42
- - - - - - 0x02F2C3 0B:B2B3: 1A        .byte $1A, $2A, $11   ; 43
- - - - - - 0x02F2C6 0B:B2B6: 1C        .byte $1C, $2C, $16   ; 44
- - - - - - 0x02F2C9 0B:B2B9: 1B        .byte $1B, $2B, $27   ; 45
- - - - - - 0x02F2CC 0B:B2BC: 18        .byte $18, $28, $14   ; 46
- - - - - - 0x02F2CF 0B:B2BF: 17        .byte $17, $27, $05   ; 47
- - - - - - 0x02F2D2 0B:B2C2: 18        .byte $18, $28, $20   ; 48
- - - - - - 0x02F2D5 0B:B2C5: 13        .byte $13, $23, $38   ; 49
- - - - - - 0x02F2D8 0B:B2C8: 17        .byte $17, $27, $16   ; 4A
- - - - - - 0x02F2DB 0B:B2CB: 00        .byte $00, $10, $38   ; 4B
- - - - - - 0x02F2DE 0B:B2CE: 16        .byte $16, $10, $20   ; 4C
- - - - - - 0x02F2E1 0B:B2D1: 1B        .byte $1B, $2B, $3B   ; 4D
- - - - - - 0x02F2E4 0B:B2D4: 17        .byte $17, $27, $37   ; 4E
- - - - - - 0x02F2E7 0B:B2D7: 13        .byte $13, $23, $20   ; 4F
- - - - - - 0x02F2EA 0B:B2DA: 23        .byte $23, $10, $20   ; 50
- - - - - - 0x02F2ED 0B:B2DD: 14        .byte $14, $24, $26   ; 51
- - - - - - 0x02F2F0 0B:B2E0: 13        .byte $13, $23, $26   ; 52
- - - - - - 0x02F2F3 0B:B2E3: 11        .byte $11, $21, $31   ; 53
- - - - - - 0x02F2F6 0B:B2E6: 05        .byte $05, $15, $25   ; 54
- - - - - - 0x02F2F9 0B:B2E9: 02        .byte $02, $12, $32   ; 55
- - - - - - 0x02F2FC 0B:B2EC: 18        .byte $18, $14, $20   ; 56
- - - - - - 0x02F2FF 0B:B2EF: 16        .byte $16, $26, $36   ; 57
- - - - - - 0x02F302 0B:B2F2: 11        .byte $11, $2A, $20   ; 58
- - - - - - 0x02F305 0B:B2F5: 17        .byte $17, $27, $11   ; 59
- - - - - - 0x02F308 0B:B2F8: 16        .byte $16, $2C, $20   ; 5A
- - - - - - 0x02F30B 0B:B2FB: 18        .byte $18, $28, $16   ; 5B
- - - - - - 0x02F30E 0B:B2FE: 27        .byte $27, $2B, $20   ; 5C
- - - - - - 0x02F311 0B:B301: 14        .byte $14, $28, $20   ; 5D
- - - - - - 0x02F314 0B:B304: 15        .byte $15, $27, $20   ; 5E
- - - - - - 0x02F317 0B:B307: 15        .byte $15, $10, $20   ; 5F
- - - - - - 0x02F31A 0B:B30A: 12        .byte $12, $15, $23   ; 60
- - - - - - 0x02F31D 0B:B30D: 13        .byte $13, $28, $20   ; 61
- - - - - - 0x02F320 0B:B310: 18        .byte $18, $28, $20   ; 62
- - - - - - 0x02F323 0B:B313: 18        .byte $18, $28, $16   ; 63
- - - - - - 0x02F326 0B:B316: 03        .byte $03, $13, $27   ; 64
- - - - - - 0x02F329 0B:B319: 17        .byte $17, $27, $14   ; 65
- - - - - - 0x02F32C 0B:B31C: 17        .byte $17, $27, $20   ; 66


; bzk garbage
- - - - - - 0x02F32F 0B:B31F: FF        .byte $FF   ; 
- - - - - - 0x02F330 0B:B320: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F340 0B:B330: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F350 0B:B340: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F360 0B:B350: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F370 0B:B360: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F380 0B:B370: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F390 0B:B380: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F3A0 0B:B390: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F3B0 0B:B3A0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F3C0 0B:B3B0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F3D0 0B:B3C0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F3E0 0B:B3D0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F3F0 0B:B3E0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



tbl_B3EA_green:
- D 1 - I - 0x02F3FA 0B:B3EA: 20        .byte $20, $20, $20   ; 00
- D 1 - I - 0x02F3FD 0B:B3ED: 16        .byte $16, $1A, $20   ; 01
- D 1 - I - 0x02F400 0B:B3F0: 00        .byte $00, $10, $20   ; 02
- D 1 - I - 0x02F403 0B:B3F3: 0C        .byte $0C, $1C, $21   ; 03
- D 1 - I - 0x02F406 0B:B3F6: 01        .byte $01, $11, $21   ; 04
- D 1 - I - 0x02F409 0B:B3F9: 03        .byte $03, $13, $23   ; 05
- D 1 - I - 0x02F40C 0B:B3FC: 0A        .byte $0A, $1A, $2A   ; 06
- D 1 - I - 0x02F40F 0B:B3FF: 04        .byte $04, $16, $37   ; 07
- D 1 - I - 0x02F412 0B:B402: 11        .byte $11, $21, $20   ; 08
- - - - - - 0x02F415 0B:B405: 06        .byte $06, $16, $27   ; 09
- - - - - - 0x02F418 0B:B408: 07        .byte $07, $15, $28   ; 0A
- - - - - - 0x02F41B 0B:B40B: 17        .byte $17, $27, $38   ; 0B
- - - - - - 0x02F41E 0B:B40E: 06        .byte $06, $16, $26   ; 0C
- D 1 - I - 0x02F421 0B:B411: 0B        .byte $0B, $2A, $12   ; 0D
- D 1 - I - 0x02F424 0B:B414: 0B        .byte $0B, $2A, $16   ; 0E
- D 1 - I - 0x02F427 0B:B417: 0B        .byte $0B, $2A, $27   ; 0F
- D 1 - I - 0x02F42A 0B:B41A: 0B        .byte $0B, $2A, $14   ; 10
- D 1 - I - 0x02F42D 0B:B41D: 08        .byte $08, $27, $33   ; 11
- D 1 - I - 0x02F430 0B:B420: 08        .byte $08, $28, $20   ; 12
- D 1 - I - 0x02F433 0B:B423: 07        .byte $07, $16, $31   ; 13
- D 1 - I - 0x02F436 0B:B426: 18        .byte $18, $28, $37   ; 14
- - - - - - 0x02F439 0B:B429: 00        .byte $00, $00, $00   ; 15
- - - - - - 0x02F43C 0B:B42C: 05        .byte $05, $07, $10   ; 16
- D 1 - I - 0x02F43F 0B:B42F: 1B        .byte $1B, $21, $31   ; 17
- D 1 - I - 0x02F442 0B:B432: 01        .byte $01, $01, $01   ; 18
- D 1 - I - 0x02F445 0B:B435: 0B        .byte $0B, $1A, $12   ; 19
- - - - - - 0x02F448 0B:B438: 0B        .byte $0B, $1A, $16   ; 1A
- - - - - - 0x02F44B 0B:B43B: 0B        .byte $0B, $1A, $27   ; 1B
- - - - - - 0x02F44E 0B:B43E: 0B        .byte $0B, $1A, $14   ; 1C
- - - - - - 0x02F451 0B:B441: 08        .byte $08, $27, $21   ; 1D
- - - - - - 0x02F454 0B:B444: 08        .byte $08, $27, $20   ; 1E
- - - - - - 0x02F457 0B:B447: 08        .byte $08, $22, $20   ; 1F
- D 1 - I - 0x02F45A 0B:B44A: 17        .byte $17, $28, $38   ; 20
- - - - - - 0x02F45D 0B:B44D: 00        .byte $00, $00, $00   ; 21
- - - - - - 0x02F460 0B:B450: 20        .byte $20, $38, $20   ; 22
- D 1 - I - 0x02F463 0B:B453: 0F        .byte $0F, $0F, $00   ; 23
- D 1 - I - 0x02F466 0B:B456: 16        .byte $16, $0F, $0F   ; 24
- D 1 - I - 0x02F469 0B:B459: 16        .byte $16, $20, $38   ; 25
- D 1 - I - 0x02F46C 0B:B45C: 16        .byte $16, $26, $02   ; 26
- D 1 - I - 0x02F46F 0B:B45F: 06        .byte $06, $16, $02   ; 27
- - - - - - 0x02F472 0B:B462: 0F        .byte $0F, $00, $10   ; 28
- - - - - - 0x02F475 0B:B465: 04        .byte $04, $14, $24   ; 29
- D 1 - I - 0x02F478 0B:B468: 1C        .byte $1C, $2C, $3C   ; 2A
- D 1 - I - 0x02F47B 0B:B46B: 07        .byte $07, $17, $27   ; 2B
- D 1 - I - 0x02F47E 0B:B46E: 11        .byte $11, $19, $29   ; 2C
- D 1 - I - 0x02F481 0B:B471: 01        .byte $01, $11, $20   ; 2D
- D 1 - I - 0x02F484 0B:B474: 05        .byte $05, $15, $20   ; 2E
- D 1 - I - 0x02F487 0B:B477: 18        .byte $18, $28, $20   ; 2F
- D 1 - I - 0x02F48A 0B:B47A: 03        .byte $03, $13, $20   ; 30
- D 1 - I - 0x02F48D 0B:B47D: 06        .byte $06, $16, $20   ; 31
- D 1 - I - 0x02F490 0B:B480: 12        .byte $12, $22, $32   ; 32
- D 1 - I - 0x02F493 0B:B483: 16        .byte $16, $26, $36   ; 33
- - - - - - 0x02F496 0B:B486: 13        .byte $13, $23, $33   ; 34
- D 1 - I - 0x02F499 0B:B489: 1A        .byte $1A, $2A, $23   ; 35
- D 1 - I - 0x02F49C 0B:B48C: 18        .byte $18, $28, $23   ; 36
- D 1 - I - 0x02F49F 0B:B48F: 10        .byte $10, $20, $23   ; 37
- D 1 - I - 0x02F4A2 0B:B492: 15        .byte $15, $25, $23   ; 38
- D 1 - I - 0x02F4A5 0B:B495: 14        .byte $14, $24, $23   ; 39
- D 1 - I - 0x02F4A8 0B:B498: 18        .byte $18, $28, $1A   ; 3A
- D 1 - I - 0x02F4AB 0B:B49B: 08        .byte $08, $24, $28   ; 3B
- - - - - - 0x02F4AE 0B:B49E: 08        .byte $08, $18, $28   ; 3C
- D 1 - I - 0x02F4B1 0B:B4A1: 14        .byte $14, $24, $23   ; 3D
- D 1 - I - 0x02F4B4 0B:B4A4: 18        .byte $18, $28, $27   ; 3E
- D 1 - I - 0x02F4B7 0B:B4A7: 0F        .byte $0F, $38, $37   ; 3F
- D 1 - I - 0x02F4BA 0B:B4AA: 16        .byte $16, $26, $20   ; 40
- D 1 - I - 0x02F4BD 0B:B4AD: 0C        .byte $0C, $1C, $2C   ; 41
- D 1 - I - 0x02F4C0 0B:B4B0: 20        .byte $20, $1A, $21   ; 42
- D 1 - I - 0x02F4C3 0B:B4B3: 1A        .byte $1A, $2A, $11   ; 43
- D 1 - I - 0x02F4C6 0B:B4B6: 1A        .byte $1A, $2A, $16   ; 44
- D 1 - I - 0x02F4C9 0B:B4B9: 1A        .byte $1A, $2A, $27   ; 45
- D 1 - I - 0x02F4CC 0B:B4BC: 1A        .byte $1A, $2A, $14   ; 46
- D 1 - I - 0x02F4CF 0B:B4BF: 17        .byte $17, $27, $05   ; 47
- D 1 - I - 0x02F4D2 0B:B4C2: 18        .byte $18, $28, $20   ; 48
- D 1 - I - 0x02F4D5 0B:B4C5: 13        .byte $13, $23, $38   ; 49
- D 1 - I - 0x02F4D8 0B:B4C8: 17        .byte $17, $27, $16   ; 4A
- D 1 - I - 0x02F4DB 0B:B4CB: 00        .byte $00, $10, $38   ; 4B
- D 1 - I - 0x02F4DE 0B:B4CE: 16        .byte $16, $10, $20   ; 4C
- D 1 - I - 0x02F4E1 0B:B4D1: 1B        .byte $1B, $2B, $3B   ; 4D
- D 1 - I - 0x02F4E4 0B:B4D4: 17        .byte $17, $27, $37   ; 4E
- D 1 - I - 0x02F4E7 0B:B4D7: 13        .byte $13, $23, $20   ; 4F
- D 1 - I - 0x02F4EA 0B:B4DA: 23        .byte $23, $10, $20   ; 50
- D 1 - I - 0x02F4ED 0B:B4DD: 14        .byte $14, $24, $26   ; 51
- D 1 - I - 0x02F4F0 0B:B4E0: 13        .byte $13, $23, $26   ; 52
- D 1 - I - 0x02F4F3 0B:B4E3: 11        .byte $11, $21, $31   ; 53
- D 1 - I - 0x02F4F6 0B:B4E6: 05        .byte $05, $15, $25   ; 54
- D 1 - I - 0x02F4F9 0B:B4E9: 02        .byte $02, $12, $32   ; 55
- D 1 - I - 0x02F4FC 0B:B4EC: 18        .byte $18, $14, $20   ; 56
- D 1 - I - 0x02F4FF 0B:B4EF: 16        .byte $16, $26, $36   ; 57
- D 1 - I - 0x02F502 0B:B4F2: 11        .byte $11, $2A, $20   ; 58
- D 1 - I - 0x02F505 0B:B4F5: 18        .byte $18, $28, $11   ; 59
- D 1 - I - 0x02F508 0B:B4F8: 16        .byte $16, $2A, $20   ; 5A
- D 1 - I - 0x02F50B 0B:B4FB: 18        .byte $18, $28, $16   ; 5B
- D 1 - I - 0x02F50E 0B:B4FE: 27        .byte $27, $2A, $20   ; 5C
- D 1 - I - 0x02F511 0B:B501: 14        .byte $14, $2A, $20   ; 5D
- D 1 - I - 0x02F514 0B:B504: 15        .byte $15, $27, $20   ; 5E
- D 1 - I - 0x02F517 0B:B507: 15        .byte $15, $10, $20   ; 5F
- D 1 - I - 0x02F51A 0B:B50A: 12        .byte $12, $15, $23   ; 60
- D 1 - I - 0x02F51D 0B:B50D: 13        .byte $13, $28, $20   ; 61
- D 1 - I - 0x02F520 0B:B510: 18        .byte $18, $28, $20   ; 62
- D 1 - I - 0x02F523 0B:B513: 18        .byte $18, $28, $16   ; 63
- D 1 - I - 0x02F526 0B:B516: 03        .byte $03, $13, $27   ; 64
- D 1 - I - 0x02F529 0B:B519: 18        .byte $18, $28, $14   ; 65
- D 1 - I - 0x02F52C 0B:B51C: 18        .byte $18, $28, $20   ; 66


; bzk garbage
- - - - - - 0x02F52F 0B:B51F: FF        .byte $FF   ; 
- - - - - - 0x02F530 0B:B520: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F540 0B:B530: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F550 0B:B540: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F560 0B:B550: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F570 0B:B560: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F580 0B:B570: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F590 0B:B580: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F5A0 0B:B590: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F5B0 0B:B5A0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F5C0 0B:B5B0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F5D0 0B:B5C0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F5E0 0B:B5D0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



tbl_B5E0_lo:
- D 1 - - - 0x02F5F0 0B:B5E0: F0        .byte < _off013_B5F0_00_leo
- D 1 - - - 0x02F5F1 0B:B5E1: F0        .byte < _off013_B5F0_01_raph
- D 1 - - - 0x02F5F2 0B:B5E2: F0        .byte < _off013_B5F0_02_mike
- D 1 - - - 0x02F5F3 0B:B5E3: F0        .byte < _off013_B5F0_03_don
- D 1 - - - 0x02F5F4 0B:B5E4: F0        .byte < _off013_B5F0_04_casey
- D 1 - - - 0x02F5F5 0B:B5E5: 50        .byte < _off013_B650_05_hot
- D 1 - - - 0x02F5F6 0B:B5E6: B0        .byte < _off013_B6B0_06_shred

tbl_B5E7_hi:
- D 1 - - - 0x02F5F7 0B:B5E7: B5        .byte > _off013_B5F0_00_leo
- D 1 - - - 0x02F5F8 0B:B5E8: B5        .byte > _off013_B5F0_01_raph
- D 1 - - - 0x02F5F9 0B:B5E9: B5        .byte > _off013_B5F0_02_mike
- D 1 - - - 0x02F5FA 0B:B5EA: B5        .byte > _off013_B5F0_03_don
- D 1 - - - 0x02F5FB 0B:B5EB: B5        .byte > _off013_B5F0_04_casey
- D 1 - - - 0x02F5FC 0B:B5EC: B6        .byte > _off013_B650_05_hot
- D 1 - - - 0x02F5FD 0B:B5ED: B6        .byte > _off013_B6B0_06_shred


; bzk garbage
- - - - - - 0x02F5FE 0B:B5EE: FF        .byte $FF, $FF   ; 



_off013_B5F0_00_leo:
_off013_B5F0_01_raph:
_off013_B5F0_02_mike:
_off013_B5F0_03_don:
_off013_B5F0_04_casey:
- D 1 - I - 0x02F600 0B:B5F0: 0C        .byte $0C, $0B   ; 00
- D 1 - I - 0x02F602 0B:B5F2: 0C        .byte $0C, $0B   ; 01
- D 1 - I - 0x02F604 0B:B5F4: 0C        .byte $0C, $0B   ; 02
- D 1 - I - 0x02F606 0B:B5F6: 0C        .byte $0C, $0C   ; 03
- D 1 - I - 0x02F608 0B:B5F8: 0C        .byte $0C, $0B   ; 04
- D 1 - I - 0x02F60A 0B:B5FA: 0C        .byte $0C, $0B   ; 05
- D 1 - I - 0x02F60C 0B:B5FC: 0C        .byte $0C, $0B   ; 06
- D 1 - I - 0x02F60E 0B:B5FE: 0C        .byte $0C, $0F   ; 07
- D 1 - I - 0x02F610 0B:B600: 0C        .byte $0C, $10   ; 08
- D 1 - I - 0x02F612 0B:B602: 0C        .byte $0C, $0B   ; 09
- D 1 - I - 0x02F614 0B:B604: 0C        .byte $0C, $0F   ; 0A
- - - - - - 0x02F616 0B:B606: 0C        .byte $0C, $0D   ; 0B
- D 1 - I - 0x02F618 0B:B608: 0C        .byte $0C, $0B   ; 0C
- D 1 - I - 0x02F61A 0B:B60A: 0C        .byte $0C, $0F   ; 0D
- D 1 - I - 0x02F61C 0B:B60C: 0C        .byte $0C, $0B   ; 0E
- - - - - - 0x02F61E 0B:B60E: 0C        .byte $0C, $0C   ; 0F
- - - - - - 0x02F620 0B:B610: 0C        .byte $0C, $0B   ; 10
- - - - - - 0x02F622 0B:B612: 0C        .byte $0C, $0C   ; 11
- - - - - - 0x02F624 0B:B614: 0C        .byte $0C, $0C   ; 12
- - - - - - 0x02F626 0B:B616: 0C        .byte $0C, $0B   ; 13
- - - - - - 0x02F628 0B:B618: 0C        .byte $0C, $0F   ; 14
- - - - - - 0x02F62A 0B:B61A: 0C        .byte $0C, $0E   ; 15
- - - - - - 0x02F62C 0B:B61C: 0C        .byte $0C, $0B   ; 16
- - - - - - 0x02F62E 0B:B61E: 0C        .byte $0C, $0F   ; 17
- - - - - - 0x02F630 0B:B620: 0C        .byte $0C, $0C   ; 18
- - - - - - 0x02F632 0B:B622: 0C        .byte $0C, $0F   ; 19
- - - - - - 0x02F634 0B:B624: 0C        .byte $0C, $0F   ; 1A
- - - - - - 0x02F636 0B:B626: 0C        .byte $0C, $0C   ; 1B
- - - - - - 0x02F638 0B:B628: 0C        .byte $0C, $0F   ; 1C
- - - - - - 0x02F63A 0B:B62A: 0C        .byte $0C, $10   ; 1D
- - - - - - 0x02F63C 0B:B62C: 0C        .byte $0C, $10   ; 1E
- - - - - - 0x02F63E 0B:B62E: 0C        .byte $0C, $0F   ; 1F
- - - - - - 0x02F640 0B:B630: 0C        .byte $0C, $10   ; 20
- - - - - - 0x02F642 0B:B632: 0C        .byte $0C, $0F   ; 21
- - - - - - 0x02F644 0B:B634: 0C        .byte $0C, $0F   ; 22
- D 1 - I - 0x02F646 0B:B636: 0C        .byte $0C, $0B   ; 23
- D 1 - I - 0x02F648 0B:B638: 0C        .byte $0C, $0B   ; 24
- D 1 - I - 0x02F64A 0B:B63A: 0C        .byte $0C, $0F   ; 25
- - - - - - 0x02F64C 0B:B63C: 0C        .byte $0C, $0C   ; 26
- - - - - - 0x02F64E 0B:B63E: 0C        .byte $0C, $0E   ; 27
- D 1 - I - 0x02F650 0B:B640: 0C        .byte $0C, $0B   ; 28
- - - - - - 0x02F652 0B:B642: 0C        .byte $0C, $0C   ; 29
- - - - - - 0x02F654 0B:B644: 0C        .byte $0C, $10   ; 2A
- - - - - - 0x02F656 0B:B646: 0C        .byte $0C, $0E   ; 2B
- D 1 - I - 0x02F658 0B:B648: 0C        .byte $0C, $0B   ; 2C
- - - - - - 0x02F65A 0B:B64A: 0C        .byte $0C, $0F   ; 2D
- - - - - - 0x02F65C 0B:B64C: FF        .byte $FF, $FF   ; 2E
- - - - - - 0x02F65E 0B:B64E: FF        .byte $FF, $FF   ; 2F



_off013_B650_05_hot:
- D 1 - I - 0x02F660 0B:B650: 0B        .byte $0B, $0B   ; 00
- D 1 - I - 0x02F662 0B:B652: 0B        .byte $0B, $0B   ; 01
- - - - - - 0x02F664 0B:B654: 0B        .byte $0B, $0B   ; 02
- D 1 - I - 0x02F666 0B:B656: 0C        .byte $0C, $0C   ; 03
- D 1 - I - 0x02F668 0B:B658: 0B        .byte $0B, $0B   ; 04
- - - - - - 0x02F66A 0B:B65A: 0B        .byte $0B, $0B   ; 05
- D 1 - I - 0x02F66C 0B:B65C: 0B        .byte $0B, $0B   ; 06
- - - - - - 0x02F66E 0B:B65E: 0C        .byte $0C, $0F   ; 07
- - - - - - 0x02F670 0B:B660: 0C        .byte $0C, $10   ; 08
- - - - - - 0x02F672 0B:B662: 0B        .byte $0B, $0B   ; 09
- - - - - - 0x02F674 0B:B664: 0C        .byte $0C, $0F   ; 0A
- - - - - - 0x02F676 0B:B666: 0C        .byte $0C, $0D   ; 0B
- - - - - - 0x02F678 0B:B668: 0B        .byte $0B, $0B   ; 0C
- D 1 - I - 0x02F67A 0B:B66A: 0C        .byte $0C, $0F   ; 0D
- - - - - - 0x02F67C 0B:B66C: 0B        .byte $0B, $0B   ; 0E
- - - - - - 0x02F67E 0B:B66E: 0C        .byte $0C, $0C   ; 0F
- - - - - - 0x02F680 0B:B670: 0B        .byte $0B, $0B   ; 10
- D 1 - I - 0x02F682 0B:B672: 0C        .byte $0C, $0C   ; 11
- - - - - - 0x02F684 0B:B674: 0C        .byte $0C, $0C   ; 12
- D 1 - I - 0x02F686 0B:B676: 0B        .byte $0B, $0B   ; 13
- D 1 - I - 0x02F688 0B:B678: 0C        .byte $0C, $0F   ; 14
- - - - - - 0x02F68A 0B:B67A: 0C        .byte $0C, $0E   ; 15
- - - - - - 0x02F68C 0B:B67C: 0B        .byte $0B, $0B   ; 16
- - - - - - 0x02F68E 0B:B67E: 0C        .byte $0C, $0F   ; 17
- - - - - - 0x02F690 0B:B680: 0C        .byte $0C, $0C   ; 18
- - - - - - 0x02F692 0B:B682: 0C        .byte $0C, $0F   ; 19
- - - - - - 0x02F694 0B:B684: 0C        .byte $0C, $0F   ; 1A
- - - - - - 0x02F696 0B:B686: 0C        .byte $0C, $0C   ; 1B
- - - - - - 0x02F698 0B:B688: 0C        .byte $0C, $0F   ; 1C
- - - - - - 0x02F69A 0B:B68A: 0C        .byte $0C, $10   ; 1D
- - - - - - 0x02F69C 0B:B68C: 0C        .byte $0C, $10   ; 1E
- - - - - - 0x02F69E 0B:B68E: 0C        .byte $0C, $0F   ; 1F
- - - - - - 0x02F6A0 0B:B690: 0C        .byte $0C, $10   ; 20
- - - - - - 0x02F6A2 0B:B692: 0C        .byte $0C, $0F   ; 21
- - - - - - 0x02F6A4 0B:B694: 0C        .byte $0C, $0F   ; 22
- D 1 - I - 0x02F6A6 0B:B696: 0B        .byte $0B, $0B   ; 23
- - - - - - 0x02F6A8 0B:B698: 0B        .byte $0B, $0B   ; 24
- - - - - - 0x02F6AA 0B:B69A: 0C        .byte $0C, $0F   ; 25
- - - - - - 0x02F6AC 0B:B69C: 0C        .byte $0C, $0C   ; 26
- - - - - - 0x02F6AE 0B:B69E: 0C        .byte $0C, $0E   ; 27
- D 1 - I - 0x02F6B0 0B:B6A0: 0B        .byte $0B, $0B   ; 28
- - - - - - 0x02F6B2 0B:B6A2: 0C        .byte $0C, $0C   ; 29
- - - - - - 0x02F6B4 0B:B6A4: 0C        .byte $0C, $10   ; 2A
- - - - - - 0x02F6B6 0B:B6A6: 0C        .byte $0C, $0E   ; 2B
- D 1 - I - 0x02F6B8 0B:B6A8: 0B        .byte $0B, $0B   ; 2C
- - - - - - 0x02F6BA 0B:B6AA: 0C        .byte $0C, $0F   ; 2D
- - - - - - 0x02F6BC 0B:B6AC: FF        .byte $FF, $FF   ; 2E
- - - - - - 0x02F6BE 0B:B6AE: FF        .byte $FF, $FF   ; 2F



_off013_B6B0_06_shred:
- D 1 - I - 0x02F6C0 0B:B6B0: 0B        .byte $0B, $0B   ; 00
- - - - - - 0x02F6C2 0B:B6B2: 0B        .byte $0B, $0B   ; 01
- - - - - - 0x02F6C4 0B:B6B4: 0B        .byte $0B, $0B   ; 02
- D 1 - I - 0x02F6C6 0B:B6B6: 0C        .byte $0C, $0C   ; 03
- D 1 - I - 0x02F6C8 0B:B6B8: 0B        .byte $0B, $0B   ; 04
- D 1 - I - 0x02F6CA 0B:B6BA: 0B        .byte $0B, $0B   ; 05
- D 1 - I - 0x02F6CC 0B:B6BC: 0B        .byte $0B, $0B   ; 06
- - - - - - 0x02F6CE 0B:B6BE: 0C        .byte $0C, $0F   ; 07
- D 1 - I - 0x02F6D0 0B:B6C0: 0C        .byte $0C, $10   ; 08
- - - - - - 0x02F6D2 0B:B6C2: 0B        .byte $0B, $0B   ; 09
- - - - - - 0x02F6D4 0B:B6C4: 0C        .byte $0C, $0F   ; 0A
- - - - - - 0x02F6D6 0B:B6C6: 0C        .byte $0C, $0D   ; 0B
- - - - - - 0x02F6D8 0B:B6C8: 0B        .byte $0B, $0B   ; 0C
- D 1 - I - 0x02F6DA 0B:B6CA: 0C        .byte $0C, $0F   ; 0D
- - - - - - 0x02F6DC 0B:B6CC: 0B        .byte $0B, $0B   ; 0E
- - - - - - 0x02F6DE 0B:B6CE: 0C        .byte $0C, $0C   ; 0F
- - - - - - 0x02F6E0 0B:B6D0: 0B        .byte $0B, $0B   ; 10
- - - - - - 0x02F6E2 0B:B6D2: 0C        .byte $0C, $0C   ; 11
- - - - - - 0x02F6E4 0B:B6D4: 0C        .byte $0C, $0C   ; 12
- - - - - - 0x02F6E6 0B:B6D6: 0B        .byte $0B, $0B   ; 13
- - - - - - 0x02F6E8 0B:B6D8: 0C        .byte $0C, $0F   ; 14
- - - - - - 0x02F6EA 0B:B6DA: 0C        .byte $0C, $0E   ; 15
- - - - - - 0x02F6EC 0B:B6DC: 0B        .byte $0B, $0B   ; 16
- - - - - - 0x02F6EE 0B:B6DE: 0C        .byte $0C, $0F   ; 17
- - - - - - 0x02F6F0 0B:B6E0: 0C        .byte $0C, $0C   ; 18
- - - - - - 0x02F6F2 0B:B6E2: 0C        .byte $0C, $0F   ; 19
- - - - - - 0x02F6F4 0B:B6E4: 0C        .byte $0C, $0F   ; 1A
- - - - - - 0x02F6F6 0B:B6E6: 0C        .byte $0C, $0C   ; 1B
- - - - - - 0x02F6F8 0B:B6E8: 0C        .byte $0C, $0F   ; 1C
- - - - - - 0x02F6FA 0B:B6EA: 0C        .byte $0C, $10   ; 1D
- - - - - - 0x02F6FC 0B:B6EC: 0C        .byte $0C, $10   ; 1E
- - - - - - 0x02F6FE 0B:B6EE: 0C        .byte $0C, $0F   ; 1F
- - - - - - 0x02F700 0B:B6F0: 0C        .byte $0C, $10   ; 20
- - - - - - 0x02F702 0B:B6F2: 0C        .byte $0C, $0F   ; 21
- - - - - - 0x02F704 0B:B6F4: 0C        .byte $0C, $0F   ; 22
- - - - - - 0x02F706 0B:B6F6: 0B        .byte $0B, $0B   ; 23
- - - - - - 0x02F708 0B:B6F8: 0B        .byte $0B, $0B   ; 24
- - - - - - 0x02F70A 0B:B6FA: 0C        .byte $0C, $0F   ; 25
- - - - - - 0x02F70C 0B:B6FC: 0C        .byte $0C, $0C   ; 26
- - - - - - 0x02F70E 0B:B6FE: 0C        .byte $0C, $0E   ; 27
- - - - - - 0x02F710 0B:B700: 0B        .byte $0B, $0B   ; 28
- - - - - - 0x02F712 0B:B702: 0C        .byte $0C, $0C   ; 29
- - - - - - 0x02F714 0B:B704: 0C        .byte $0C, $10   ; 2A
- - - - - - 0x02F716 0B:B706: 0C        .byte $0C, $0E   ; 2B
- - - - - - 0x02F718 0B:B708: 0B        .byte $0B, $0B   ; 2C
- - - - - - 0x02F71A 0B:B70A: 0C        .byte $0C, $0F   ; 2D
- - - - - - 0x02F71C 0B:B70C: FF        .byte $FF, $FF   ; 2E
- - - - - - 0x02F71E 0B:B70E: FF        .byte $FF, $FF   ; 2F


; bzk garbage
- - - - - - 0x02F720 0B:B710: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F730 0B:B720: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



ofs_0x02F73B:
C - - - - - 0x02F73B 0B:B72B: BD 40 05  LDA ram_obj_0540,X
C - - - - - 0x02F73E 0B:B72E: 20 32 D0  JSR sub_0x03D042_поинтеры_после_JSR
- D 1 - I - 0x02F741 0B:B731: 3D B7     .word ofs_038_B73D_00
- D 1 - I - 0x02F743 0B:B733: 50 B7     .word ofs_038_B750_01
- D 1 - I - 0x02F745 0B:B735: 71 B7     .word ofs_038_B771_02
- D 1 - I - 0x02F747 0B:B737: A3 B7     .word ofs_038_B7A3_03
- D 1 - I - 0x02F749 0B:B739: 09 B8     .word ofs_038_B809_04
- D 1 - I - 0x02F74B 0B:B73B: 4E B8     .word ofs_038_B84E_05



ofs_038_B73D_00:
C - - J - - 0x02F74D 0B:B73D: A9 0C     LDA #$0C
loc_B73F:
C D 1 - - - 0x02F74F 0B:B73F: 20 0E E1  JSR sub_0x03E11E
C - - - - - 0x02F752 0B:B742: 9D 60 05  STA ram_obj_0560,X
C - - - - - 0x02F755 0B:B745: A9 A2     LDA #$A2
C - - - - - 0x02F757 0B:B747: 9D 00 04  STA ram_plr_anim_id,X
C - - - - - 0x02F75A 0B:B74A: FE 40 05  INC ram_obj_0540,X
bra_B74D:
C - - - - - 0x02F75D 0B:B74D: 4C 17 F6  JMP loc_0x03F627_restore_prg



ofs_038_B750_01:
C - - J - - 0x02F760 0B:B750: DE 60 05  DEC ram_obj_0560,X
C - - - - - 0x02F763 0B:B753: D0 F8     BNE bra_B74D
C - - - - - 0x02F765 0B:B755: FE 40 05  INC ram_obj_0540,X
C - - - - - 0x02F768 0B:B758: A9 56     LDA #con_0x03F6AD_56
C - - - - - 0x02F76A 0B:B75A: 20 94 F6  JSR sub_0x03F6A4
C - - - - - 0x02F76D 0B:B75D: A9 F9     LDA #$F9
C - - - - - 0x02F76F 0B:B75F: AC 26 01  LDY ram_option_speed
C - - - - - 0x02F772 0B:B762: F0 02     BEQ bra_B766
C - - - - - 0x02F774 0B:B764: A9 F6     LDA #$F6
bra_B766:
C - - - - - 0x02F776 0B:B766: 9D 60 04  STA ram_obj_0460,X
loc_B769:
C D 1 - - - 0x02F779 0B:B769: A9 41     LDA #$41
C - - - - - 0x02F77B 0B:B76B: 20 7D D1  JSR sub_0x03D18D
C - - - - - 0x02F77E 0B:B76E: 4C 17 F6  JMP loc_0x03F627_restore_prg



ofs_038_B771_02:
C - - J - - 0x02F781 0B:B771: BC 10 04  LDY ram_obj_pos_Y,X
C - - - - - 0x02F784 0B:B774: C0 68     CPY #$68
C - - - - - 0x02F786 0B:B776: 90 19     BCC bra_B791
C - - - - - 0x02F788 0B:B778: A9 A1     LDA #$A1
C - - - - - 0x02F78A 0B:B77A: C0 80     CPY #$80
C - - - - - 0x02F78C 0B:B77C: B0 05     BCS bra_B783
C - - - - - 0x02F78E 0B:B77E: 20 68 B8  JSR sub_B868
C - - - - - 0x02F791 0B:B781: A9 D6     LDA #$D6
bra_B783:
C - - - - - 0x02F793 0B:B783: 9D 00 04  STA ram_plr_anim_id,X
C - - - - - 0x02F796 0B:B786: A9 48     LDA #$48
C - - - - - 0x02F798 0B:B788: 20 4C E1  JSR sub_0x03E15C
C - - - - - 0x02F79B 0B:B78B: 20 58 DC  JSR sub_0x03DC68
C - - - - - 0x02F79E 0B:B78E: 4C 69 B7  JMP loc_B769
bra_B791:
C - - - - - 0x02F7A1 0B:B791: 20 65 B8  JSR sub_B865
C - - - - - 0x02F7A4 0B:B794: 20 73 D0  JSR sub_0x03D083
C - - - - - 0x02F7A7 0B:B797: BD 54 05  LDA ram_0554,X
C - - - - - 0x02F7AA 0B:B79A: C9 39     CMP #$39
C - - - - - 0x02F7AC 0B:B79C: F0 5E     BEQ bra_B7FC
C - - - - - 0x02F7AE 0B:B79E: A9 06     LDA #$06
C - - - - - 0x02F7B0 0B:B7A0: 4C 48 B8  JMP loc_B848



ofs_038_B7A3_03:
C - - J - - 0x02F7B3 0B:B7A3: A9 C0     LDA #$C0
C - - - - - 0x02F7B5 0B:B7A5: BC A0 04  LDY ram_obj_04A0,X
C - - - - - 0x02F7B8 0B:B7A8: 10 02     BPL bra_B7AC
C - - - - - 0x02F7BA 0B:B7AA: A9 90     LDA #$90
bra_B7AC:
C - - - - - 0x02F7BC 0B:B7AC: 20 7D D1  JSR sub_0x03D18D
C - - - - - 0x02F7BF 0B:B7AF: A0 0D     LDY #$0D
C - - - - - 0x02F7C1 0B:B7B1: AD 26 01  LDA ram_option_speed
C - - - - - 0x02F7C4 0B:B7B4: 85 02     STA ram_0002
C - - - - - 0x02F7C6 0B:B7B6: BD A0 04  LDA ram_obj_04A0,X
C - - - - - 0x02F7C9 0B:B7B9: 10 03     BPL bra_B7BE
C - - - - - 0x02F7CB 0B:B7BB: A9 00     LDA #$00
C - - - - - 0x02F7CD 0B:B7BD: 2C        .byte $2C   ; BIT
bra_B7BE:
C - - - - - 0x02F7CE 0B:B7BE: A9 01     LDA #$01
C - - - - - 0x02F7D0 0B:B7C0: 8D 26 01  STA ram_option_speed
C - - - - - 0x02F7D3 0B:B7C3: 20 4F DF  JSR sub_0x03DF5F
C - - - - - 0x02F7D6 0B:B7C6: A5 02     LDA ram_0002
C - - - - - 0x02F7D8 0B:B7C8: 8D 26 01  STA ram_option_speed
C - - - - - 0x02F7DB 0B:B7CB: BD C0 05  LDA ram_obj_anim_timer,X
C - - - - - 0x02F7DE 0B:B7CE: 30 2C     BMI bra_B7FC
C - - - - - 0x02F7E0 0B:B7D0: D0 0C     BNE bra_B7DE
C - - - - - 0x02F7E2 0B:B7D2: BD D0 05  LDA ram_obj_05D0,X
C - - - - - 0x02F7E5 0B:B7D5: C9 04     CMP #$04
C - - - - - 0x02F7E7 0B:B7D7: D0 05     BNE bra_B7DE
C - - - - - 0x02F7E9 0B:B7D9: A9 39     LDA #$39
C - - - - - 0x02F7EB 0B:B7DB: 20 00 B9  JSR sub_B900
bra_B7DE:
C - - - - - 0x02F7EE 0B:B7DE: BC D0 05  LDY ram_obj_05D0,X
C - - - - - 0x02F7F1 0B:B7E1: B9 3C B8  LDA tbl_B83C,Y
C - - - - - 0x02F7F4 0B:B7E4: 9D 0C 04  STA ram_plr_040C,X ; 040C 040D 
C - - - - - 0x02F7F7 0B:B7E7: BD 40 04  LDA ram_obj_pos_X,X
C - - - - - 0x02F7FA 0B:B7EA: 9D 4C 04  STA ram_044C,X
C - - - - - 0x02F7FD 0B:B7ED: BD 10 04  LDA ram_obj_pos_Y,X
C - - - - - 0x02F800 0B:B7F0: 9D 1C 04  STA ram_041C,X
C - - - - - 0x02F803 0B:B7F3: BD 10 05  LDA ram_obj_0510,X
C - - - - - 0x02F806 0B:B7F6: 9D 1C 05  STA ram_051C,X
bra_B7F9:
C - - - - - 0x02F809 0B:B7F9: 4C 17 F6  JMP loc_0x03F627_restore_prg
bra_B7FC:
C - - - - - 0x02F80C 0B:B7FC: FE 40 05  INC ram_obj_0540,X
C - - - - - 0x02F80F 0B:B7FF: A9 00     LDA #$00
C - - - - - 0x02F811 0B:B801: 9D 0C 04  STA ram_plr_040C,X ; 040C 040D 
C - - - - - 0x02F814 0B:B804: A9 03     LDA #$03
C - - - - - 0x02F816 0B:B806: 4C 48 B8  JMP loc_B848



ofs_038_B809_04:
C - - J - - 0x02F819 0B:B809: A9 48     LDA #$48
C - - - - - 0x02F81B 0B:B80B: 20 4C E1  JSR sub_0x03E15C
C - - - - - 0x02F81E 0B:B80E: 20 58 DC  JSR sub_0x03DC68
C - - - - - 0x02F821 0B:B811: A9 41     LDA #$41
C - - - - - 0x02F823 0B:B813: 20 7D D1  JSR sub_0x03D18D
C - - - - - 0x02F826 0B:B816: A0 12     LDY #$12
C - - - - - 0x02F828 0B:B818: 20 4F DF  JSR sub_0x03DF5F
C - - - - - 0x02F82B 0B:B81B: BD 60 04  LDA ram_obj_0460,X
C - - - - - 0x02F82E 0B:B81E: 30 D9     BMI bra_B7F9
C - - - - - 0x02F830 0B:B820: BD 10 04  LDA ram_obj_pos_Y,X
C - - - - - 0x02F833 0B:B823: C9 B0     CMP #$B0
C - - - - - 0x02F835 0B:B825: 90 D2     BCC bra_B7F9
C - - - - - 0x02F837 0B:B827: 20 67 D0  JSR sub_0x03D077
C - - - - - 0x02F83A 0B:B82A: A9 10     LDA #$10
C - - - - - 0x02F83C 0B:B82C: 4C 3F B7  JMP loc_B73F


; bzk garbage
- - - - - - 0x02F83F 0B:B82F: FF        .byte $FF   ; 
- - - - - - 0x02F840 0B:B830: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



tbl_B83C:
- D 1 - - - 0x02F84C 0B:B83C: C7        .byte $C7   ; 00
- D 1 - - - 0x02F84D 0B:B83D: C6        .byte $C6   ; 01
- D 1 - - - 0x02F84E 0B:B83E: C5        .byte $C5   ; 02
- D 1 - - - 0x02F84F 0B:B83F: C7        .byte $C7   ; 03
- D 1 - - - 0x02F850 0B:B840: C6        .byte $C6   ; 04
- D 1 - - - 0x02F851 0B:B841: C5        .byte $C5   ; 05


; bzk garbage
- - - - - - 0x02F852 0B:B842: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF   ; 



loc_B848:
C D 1 - - - 0x02F858 0B:B848: 20 38 DF  JSR sub_0x03DF48
C - - - - - 0x02F85B 0B:B84B: 4C 17 F6  JMP loc_0x03F627_restore_prg



ofs_038_B84E_05:
C - - J - - 0x02F85E 0B:B84E: A9 B8     LDA #> (ofs_0x0278CB - $01)
C - - - - - 0x02F860 0B:B850: 48        PHA
C - - - - - 0x02F861 0B:B851: A9 BA     LDA #< (ofs_0x0278CB - $01)
C - - - - - 0x02F863 0B:B853: 48        PHA
C - - - - - 0x02F864 0B:B854: 4C 17 F6  JMP loc_0x03F627_restore_prg


; bzk garbage
- - - - - - 0x02F867 0B:B857: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F870 0B:B860: FF        .byte $FF, $FF, $FF, $FF, $FF   ; 



sub_B865:
C - - - - - 0x02F875 0B:B865: FE 40 05  INC ram_obj_0540,X
sub_B868:
C - - - - - 0x02F878 0B:B868: B5 91     LDA ram_btn_hold,X
C - - - - - 0x02F87A 0B:B86A: C9 80     CMP #con_btn_A
C - - - - - 0x02F87C 0B:B86C: 90 03     BCC bra_B871_RTS
; bzk bug? хз зачем нужен этот адрес, но надо ли ему кнопки?
C - - - - - 0x02F87E 0B:B86E: 9D A0 04  STA ram_obj_04A0,X
bra_B871_RTS:
C - - - - - 0x02F881 0B:B871: 60        RTS


; bzk garbage
- - - - - - 0x02F882 0B:B872: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F890 0B:B880: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F8A0 0B:B890: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F8B0 0B:B8A0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F8C0 0B:B8B0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F8D0 0B:B8C0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F8E0 0B:B8D0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F8F0 0B:B8E0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F900 0B:B8F0: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



sub_B900:
C - - - - - 0x02F910 0B:B900: 48        PHA
C - - - - - 0x02F911 0B:B901: 20 13 B9  JSR sub_B913
C - - - - - 0x02F914 0B:B904: 68        PLA
C - - - - - 0x02F915 0B:B905: 99 50 05  STA ram_obj_id,Y
C - - - - - 0x02F918 0B:B908: BD 10 05  LDA ram_obj_0510,X
C - - - - - 0x02F91B 0B:B90B: 99 10 05  STA ram_obj_0510,Y
C - - - - - 0x02F91E 0B:B90E: 8A        TXA
C - - - - - 0x02F91F 0B:B90F: 99 20 05  STA ram_obj_0520,Y
C - - - - - 0x02F922 0B:B912: 60        RTS



sub_B913:
C - - - - - 0x02F923 0B:B913: 20 20 DE  JSR sub_0x03DE30
C - - - - - 0x02F926 0B:B916: 8A        TXA
C - - - - - 0x02F927 0B:B917: 29 01     AND #$01
C - - - - - 0x02F929 0B:B919: 18        CLC
C - - - - - 0x02F92A 0B:B91A: 69 04     ADC #$04
C - - - - - 0x02F92C 0B:B91C: 9D E0 04  STA ram_obj_04E0,X
C - - - - - 0x02F92F 0B:B91F: A8        TAY
C - - - - - 0x02F930 0B:B920: 60        RTS


; bzk garbage
- - - - - - 0x02F931 0B:B921: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F940 0B:B930: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F950 0B:B940: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F960 0B:B950: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F970 0B:B960: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 
- - - - - - 0x02F980 0B:B970: FF        .byte $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF   ; 



_off006_0x02F990_03:
- D 1 - I - 0x02F990 0B:B980: 00        .byte $00, $20, $7E, $00, $25, $00, $94, $9E, $8F, $8F, $98, $8B, $91, $8F, $00, $97   ; 
- D 1 - I - 0x02F9A0 0B:B990: 9F        .byte $9F, $9E, $8B, $98, $9E, $00, $98, $93, $98, $94, $8B, $0C, $00, $89, $9E, $9F   ; 
- D 1 - I - 0x02F9B0 0B:B9A0: 9C        .byte $9C, $9E, $96, $8F, $9D, $00, $A5, $03, $00, $87, $97, $93, $9C, $8B, $91, $8F   ; 
- D 1 - I - 0x02F9C0 0B:B9B0: 00        .byte $00, $C3, $9D, $85, $8E, $93, $99, $9D, $A8, $05, $00, $9A, $9F, $9D, $8B, $A7   ; 
- D 1 - I - 0x02F9D0 0B:B9C0: 00        .byte $00, $00, $8B, $96, $96, $00, $9C, $93, $91, $92, $9E, $9D, $00, $9C, $8F, $9D   ; 
- D 1 - I - 0x02F9E0 0B:B9D0: 8F        .byte $8F, $9C, $A0, $8F, $8E, $A7, $06, $00, $98, $9E, $9C, $8B, $8E, $8F, $97, $8B   ; 
- D 1 - I - 0x02F9F0 0B:B9E0: 9C        .byte $9C, $95, $00, $9F, $9D, $8F, $00, $91, $9C, $8B, $98, $9E, $8F, $8E, $00, $9E   ; 
- D 1 - I - 0x02FA00 0B:B9F0: 99        .byte $99, $08, $00, $99, $95, $99, $98, $8B, $97, $93, $00, $9F, $98, $8E, $8F, $9C   ; 
- D 1 - I - 0x02FA10 0B:BA00: 00        .byte $00, $96, $93, $8D, $8F, $98, $9D, $8F, $00, $90, $9C, $99, $97, $07, $00, $87   ; 
- D 1 - I - 0x02FA20 0B:BA10: 97        .byte $97, $93, $9C, $8B, $91, $8F, $00, $C3, $9D, $89, $8E, $93, $99, $9D, $A8, $9F   ; 
- D 1 - I - 0x02FA30 0B:BA20: 9D        .byte $9D, $8B, $A7, $33, $00, $8E, $9E, $97, $00, $8B, $98, $8E, $00, $A6, $00, $00   ; 
- D 1 - I - 0x02FA40 0B:BA30: 82        .byte $82, $8A, $8A, $84, $12, $00, $8F, $95, $99, $98, $8B, $97, $93, $00, $8D, $99   ; 
- D 1 - I - 0x02FA50 0B:BA40: A7        .byte $A7, $A8, $96, $9E, $8E, $A7, $0E, $00, $94, $8B, $96, $96, $00, $9C, $93, $91   ; 
- D 1 - I - 0x02FA60 0B:BA50: 92        .byte $92, $9E, $9D, $00, $9C, $8F, $9D, $8F, $9C, $A0, $8F, $8E, $A7, $2C, $00, $94   ; 
- D 1 - I - 0x02FA70 0B:BA60: 96        .byte $96, $93, $8D, $8F, $98, $9D, $8F, $8E, $00, $8C, $A3, $00, $98, $93, $98, $9E   ; 
- D 1 - I - 0x02FA80 0B:BA70: 8F        .byte $8F, $98, $8E, $99, $6B, $00, $98, $92, $8B, $8D, $95, $00, $A0, $82, $82, $83   ; 
- D 1 - I - 0x02FA90 0B:BA80: 00        .byte $00, $8C, $A3, $00, $9D, $92, $9C, $8F, $8E, $8E, $8F, $9C, $00, $00, $00, $2A   ; 
- D 1 - I - 0x02FAA0 0B:BA90: 00        .byte $00, $91, $A0, $95, $A7, $8D, $99, $97, $BE, $9E, $97, $98, $9E, $8C, $8F, $A3   ; 
- D 1 - I - 0x02FAB0 0B:BAA0: 99        .byte $99, $98, $8E, $7E, $00, $7E, $00, $4A, $00, $FF   ; 



sub_BBB5:
C - - - - - 0x02FBC5 0B:BBB5: AC 2C 01  LDY ram_option_team_keeps
C - - - - - 0x02FBC8 0B:BBB8: C0 02     CPY #$02
C - - - - - 0x02FBCA 0B:BBBA: D0 39     BNE bra_BBF5_RTS
- - - - - - 0x02FBCC 0B:BBBC: AC 50 01  LDY ram_0150
- - - - - - 0x02FBCF 0B:BBBF: F0 34     BEQ bra_BBF5_RTS
- - - - - - 0x02FBD1 0B:BBC1: BC 49 06  LDY ram_0649,X
- - - - - - 0x02FBD4 0B:BBC4: C0 02     CPY #$02
- - - - - - 0x02FBD6 0B:BBC6: F0 2D     BEQ bra_BBF5_RTS
- - - - - - 0x02FBD8 0B:BBC8: 85 01     STA ram_0001
- - - - - - 0x02FBDA 0B:BBCA: 8A        TXA
- - - - - - 0x02FBDB 0B:BBCB: 0A        ASL
- - - - - - 0x02FBDC 0B:BBCC: 0A        ASL
- - - - - - 0x02FBDD 0B:BBCD: 0A        ASL
- - - - - - 0x02FBDE 0B:BBCE: 85 03     STA ram_0003
- - - - - - 0x02FBE0 0B:BBD0: 1D 42 01  ORA ram_0142,X
- - - - - - 0x02FBE3 0B:BBD3: 85 00     STA ram_0000
- - - - - - 0x02FBE5 0B:BBD5: BD 40 01  LDA ram_0140,X
- - - - - - 0x02FBE8 0B:BBD8: FD 42 01  SBC ram_0142,X
- - - - - - 0x02FBEB 0B:BBDB: 25 22     AND ram_0022
- - - - - - 0x02FBED 0B:BBDD: 18        CLC
- - - - - - 0x02FBEE 0B:BBDE: 7D 42 01  ADC ram_0142,X
- - - - - - 0x02FBF1 0B:BBE1: 65 03     ADC ram_0003
- - - - - - 0x02FBF3 0B:BBE3: A8        TAY
- - - - - - 0x02FBF4 0B:BBE4: B9 30 01  LDA ram_0130,Y
- - - - - - 0x02FBF7 0B:BBE7: 85 02     STA ram_0002
- - - - - - 0x02FBF9 0B:BBE9: A5 01     LDA ram_0001
- - - - - - 0x02FBFB 0B:BBEB: 99 30 01  STA ram_0130,Y
- - - - - - 0x02FBFE 0B:BBEE: A4 00     LDY ram_0000
- - - - - - 0x02FC00 0B:BBF0: A5 02     LDA ram_0002
- - - - - - 0x02FC02 0B:BBF2: 99 30 01  STA ram_0130,Y
bra_BBF5_RTS:
C - - - - - 0x02FC05 0B:BBF5: 60        RTS



loc_0x02FC90:
C D 1 - - - 0x02FC90 0B:BC80: A5 2C     LDA ram_002C
C - - - - - 0x02FC92 0B:BC82: C9 03     CMP #$03
C - - - - - 0x02FC94 0B:BC84: F0 06     BEQ bra_BC8C
C - - - - - 0x02FC96 0B:BC86: AE 54 01  LDX ram_0154
C - - - - - 0x02FC99 0B:BC89: 4C 1D E6  JMP loc_0x03E62D
bra_BC8C:
C - - - - - 0x02FC9C 0B:BC8C: EE 50 01  INC ram_0150
C - - - - - 0x02FC9F 0B:BC8F: AC 2C 01  LDY ram_option_team_keeps
C - - - - - 0x02FCA2 0B:BC92: A5 08     LDA ram_0008
C - - - - - 0x02FCA4 0B:BC94: AA        TAX
C - - - - - 0x02FCA5 0B:BC95: C0 04     CPY #$04
C - - - - - 0x02FCA7 0B:BC97: 90 05     BCC bra_BC9E
- - - - - - 0x02FCA9 0B:BC99: 09 80     ORA #$80
- - - - - - 0x02FCAB 0B:BC9B: 0D 71 06  ORA ram_0671
bra_BC9E:
C - - - - - 0x02FCAE 0B:BC9E: 8D 4F 01  STA ram_014F
C - - - - - 0x02FCB1 0B:BCA1: C9 83     CMP #$83
C - - - - - 0x02FCB3 0B:BCA3: F0 2E     BEQ bra_BCD3
C - - - - - 0x02FCB5 0B:BCA5: FE 42 01  INC ram_0142,X
C - - - - - 0x02FCB8 0B:BCA8: 90 0B     BCC bra_BCB5
- - - - - - 0x02FCBA 0B:BCAA: EE 43 01  INC ram_0143
- - - - - - 0x02FCBD 0B:BCAD: AD 43 01  LDA ram_0143
- - - - - - 0x02FCC0 0B:BCB0: CD 40 01  CMP ram_0140
- - - - - - 0x02FCC3 0B:BCB3: B0 21     BCS bra_BCD6
bra_BCB5:
C - - - - - 0x02FCC5 0B:BCB5: 8A        TXA
C - - - - - 0x02FCC6 0B:BCB6: C0 01     CPY #$01
C - - - - - 0x02FCC8 0B:BCB8: F0 06     BEQ bra_BCC0
- - - - - - 0x02FCCA 0B:BCBA: C0 02     CPY #$02
- - - - - - 0x02FCCC 0B:BCBC: F0 02     BEQ bra_BCC0
- - - - - - 0x02FCCE 0B:BCBE: 49 01     EOR #$01
bra_BCC0:
C - - - - - 0x02FCD0 0B:BCC0: A8        TAY
C - - - - - 0x02FCD1 0B:BCC1: BD 42 01  LDA ram_0142,X
C - - - - - 0x02FCD4 0B:BCC4: B0 08     BCS bra_BCCE
- - - - - - 0x02FCD6 0B:BCC6: AD 50 01  LDA ram_0150
- - - - - - 0x02FCD9 0B:BCC9: DD 40 01  CMP ram_0140,X
- - - - - - 0x02FCDC 0B:BCCC: B0 11     BCS bra_BCDF
bra_BCCE:
C - - - - - 0x02FCDE 0B:BCCE: D9 40 01  CMP ram_0140,Y
C - - - - - 0x02FCE1 0B:BCD1: B0 0C     BCS bra_BCDF
bra_BCD3:
C - - - - - 0x02FCE3 0B:BCD3: 4C 6C E6  JMP loc_0x03E67C
bra_BCD6:
- - - - - - 0x02FCE6 0B:BCD6: E8        INX
- - - - - - 0x02FCE7 0B:BCD7: AD 42 01  LDA ram_0142
- - - - - - 0x02FCEA 0B:BCDA: CD 41 01  CMP ram_0141
- - - - - - 0x02FCED 0B:BCDD: B0 25     BCS bra_BD04
bra_BCDF:
C - - - - - 0x02FCEF 0B:BCDF: AD 2C 01  LDA ram_option_team_keeps
C - - - - - 0x02FCF2 0B:BCE2: F0 10     BEQ bra_BCF4
C - - - - - 0x02FCF4 0B:BCE4: AD 40 01  LDA ram_0140
C - - - - - 0x02FCF7 0B:BCE7: 0D 41 01  ORA ram_0141
C - - - - - 0x02FCFA 0B:BCEA: 49 01     EOR #$01
C - - - - - 0x02FCFC 0B:BCEC: F0 06     BEQ bra_BCF4
C - - - - - 0x02FCFE 0B:BCEE: 8E 71 06  STX ram_0671
C - - - - - 0x02FD01 0B:BCF1: 4C 8A E6  JMP loc_0x03E69A
bra_BCF4:
- - - - - - 0x02FD04 0B:BCF4: AD 42 01  LDA ram_0142
- - - - - - 0x02FD07 0B:BCF7: CD 43 01  CMP ram_0143
- - - - - - 0x02FD0A 0B:BCFA: F0 08     BEQ bra_BD04
- - - - - - 0x02FD0C 0B:BCFC: 90 03     BCC bra_BD01
- - - - - - 0x02FD0E 0B:BCFE: A2 00     LDX #$00
- - - - - - 0x02FD10 0B:BD00: 2C        .byte $2C   ; BIT
bra_BD01:
- - - - - - 0x02FD11 0B:BD01: A2 01     LDX #$01
- - - - - - 0x02FD13 0B:BD03: 2C        .byte $2C   ; BIT
bra_BD04:
- - - - - - 0x02FD14 0B:BD04: A2 80     LDX #$80
- - - - - - 0x02FD16 0B:BD06: 86 08     STX ram_0008
- - - - - - 0x02FD18 0B:BD08: A9 00     LDA #$00
- - - - - - 0x02FD1A 0B:BD0A: A2 20     LDX #$20
bra_BD0C_loop:
- - - - - - 0x02FD1C 0B:BD0C: 9D 30 01  STA ram_0130,X
- - - - - - 0x02FD1F 0B:BD0F: CA        DEX
- - - - - - 0x02FD20 0B:BD10: 10 FA     BPL bra_BD0C_loop
- - - - - - 0x02FD22 0B:BD12: 4C 0C E6  JMP loc_0x03E61C



sub_0x02FD40:
C - - - - - 0x02FD40 0B:BD30: A5 2C     LDA ram_002C
C - - - - - 0x02FD42 0B:BD32: 4A        LSR
C - - - - - 0x02FD43 0B:BD33: F0 03     BEQ bra_BD38
C - - - - - 0x02FD45 0B:BD35: 4C A0 BE  JMP loc_BEA0
bra_BD38:
C - - - - - 0x02FD48 0B:BD38: A4 00     LDY ram_0000
C - - - - - 0x02FD4A 0B:BD3A: B9 29 01  LDA ram_0129,Y
C - - - - - 0x02FD4D 0B:BD3D: 29 F0     AND #$F0
C - - - - - 0x02FD4F 0B:BD3F: 4A        LSR
C - - - - - 0x02FD50 0B:BD40: 4A        LSR
C - - - - - 0x02FD51 0B:BD41: 4A        LSR
C - - - - - 0x02FD52 0B:BD42: 4A        LSR
C - - - - - 0x02FD53 0B:BD43: 18        CLC
C - - - - - 0x02FD54 0B:BD44: 69 81     ADC #$81
C - - - - - 0x02FD56 0B:BD46: 20 66 D2  JSR sub_0x03D276_записать_A_в_буфер_без_сохранения_индекса
C - - - - - 0x02FD59 0B:BD49: B9 29 01  LDA ram_0129,Y
C - - - - - 0x02FD5C 0B:BD4C: 29 0F     AND #$0F
C - - - - - 0x02FD5E 0B:BD4E: 18        CLC
C - - - - - 0x02FD5F 0B:BD4F: 69 81     ADC #$81
C - - - - - 0x02FD61 0B:BD51: 20 5F D2  JSR sub_0x03D26F_записать_A_в_буфер_без_чтения_индекса
C - - - - - 0x02FD64 0B:BD54: 98        TYA
C - - - - - 0x02FD65 0B:BD55: 49 01     EOR #$01
C - - - - - 0x02FD67 0B:BD57: AA        TAX
C - - - - - 0x02FD68 0B:BD58: B9 29 01  LDA ram_0129,Y
C - - - - - 0x02FD6B 0B:BD5B: A0 75     LDY #$75
C - - - - - 0x02FD6D 0B:BD5D: DD 29 01  CMP ram_0129,X
C - - - - - 0x02FD70 0B:BD60: 4C BC BE  JMP loc_BEBC



tbl_BD74:
- D 1 - - - 0x02FD84 0B:BD74: 00        .byte $00   ; 00
- D 1 - - - 0x02FD85 0B:BD75: 00        .byte $00   ; 01
- D 1 - - - 0x02FD86 0B:BD76: 80        .byte $80   ; 02

tbl_BD77:
- D 1 - - - 0x02FD87 0B:BD77: 01        .byte $01   ; 00
- D 1 - - - 0x02FD88 0B:BD78: 81        .byte $81   ; 01
- D 1 - - - 0x02FD89 0B:BD79: 81        .byte $81   ; 02

tbl_BD7A_анимация:
- D 1 - - - 0x02FD8A 0B:BD7A: 16        .byte $16   ; 00
- D 1 - - - 0x02FD8B 0B:BD7B: 16        .byte $16   ; 01
- D 1 - - - 0x02FD8C 0B:BD7C: 59        .byte $59   ; 02

tbl_BD7D:
- D 1 - - - 0x02FD8D 0B:BD7D: 17        .byte $17   ; 00 bzk bug? сюда ссылается 0x02FF4C
- D 1 - - - 0x02FD8E 0B:BD7E: 1A        .byte $1A   ; 01
- D 1 - - - 0x02FD8F 0B:BD7F: 1A        .byte $1A   ; 02



loc_BD80:
C D 1 - - - 0x02FD90 0B:BD80: C9 03     CMP #$03
C - - - - - 0x02FD92 0B:BD82: D0 70     BNE bra_BDF4
C - - - - - 0x02FD94 0B:BD84: AD 51 01  LDA ram_0151
C - - - - - 0x02FD97 0B:BD87: F0 06     BEQ bra_BD8F
C - - - - - 0x02FD99 0B:BD89: AD 41 01  LDA ram_0141
C - - - - - 0x02FD9C 0B:BD8C: D0 15     BNE bra_BDA3
C - - - - - 0x02FD9E 0B:BD8E: CA        DEX
bra_BD8F:
bra_BD8F_loop:
C - - - - - 0x02FD9F 0B:BD8F: BD 30 05  LDA ram_obj_0530,X
C - - - - - 0x02FDA2 0B:BD92: F0 0C     BEQ bra_BDA0
C - - - - - 0x02FDA4 0B:BD94: 4A        LSR
C - - - - - 0x02FDA5 0B:BD95: F0 09     BEQ bra_BDA0
C - - - - - 0x02FDA7 0B:BD97: B5 8E     LDA ram_btn_press,X
C - - - - - 0x02FDA9 0B:BD99: 49 40     EOR #con_btn_B
C - - - - - 0x02FDAB 0B:BD9B: D0 03     BNE bra_BDA0
C - - - - - 0x02FDAD 0B:BD9D: 9D 30 05  STA ram_obj_0530,X
bra_BDA0:
C - - - - - 0x02FDB0 0B:BDA0: CA        DEX
C - - - - - 0x02FDB1 0B:BDA1: 10 EC     BPL bra_BD8F_loop
bra_BDA3:
C - - - - - 0x02FDB3 0B:BDA3: AC 30 05  LDY ram_obj_0530
C - - - - - 0x02FDB6 0B:BDA6: C0 04     CPY #$04
C - - - - - 0x02FDB8 0B:BDA8: B0 42     BCS bra_BDEC
C - - - - - 0x02FDBA 0B:BDAA: 88        DEY
C - - - - - 0x02FDBB 0B:BDAB: F0 3F     BEQ bra_BDEC
C - - - - - 0x02FDBD 0B:BDAD: A5 8E     LDA ram_btn_press
C - - - - - 0x02FDBF 0B:BDAF: 29 20     AND #con_btn_Select
C - - - - - 0x02FDC1 0B:BDB1: F0 39     BEQ bra_BDEC
C - - - - - 0x02FDC3 0B:BDB3: A9 01     LDA #$01
C - - - - - 0x02FDC5 0B:BDB5: 6D 51 01  ADC ram_0151
C - - - - - 0x02FDC8 0B:BDB8: C9 03     CMP #$03
C - - - - - 0x02FDCA 0B:BDBA: 90 09     BCC bra_BDC5
C - - - - - 0x02FDCC 0B:BDBC: C0 02     CPY #$02
C - - - - - 0x02FDCE 0B:BDBE: D0 03     BNE bra_BDC3
- - - - - - 0x02FDD0 0B:BDC0: CE 30 05  DEC ram_obj_0530
bra_BDC3:
C - - - - - 0x02FDD3 0B:BDC3: A9 00     LDA #$00
bra_BDC5:
C - - - - - 0x02FDD5 0B:BDC5: 8D 51 01  STA ram_0151
C - - - - - 0x02FDD8 0B:BDC8: A8        TAY
C - - - - - 0x02FDD9 0B:BDC9: 4A        LSR
C - - - - - 0x02FDDA 0B:BDCA: 90 03     BCC bra_BDCF
C - - - - - 0x02FDDC 0B:BDCC: 8D 31 05  STA ram_obj_0530 + $01
bra_BDCF:
C - - - - - 0x02FDDF 0B:BDCF: B9 74 BD  LDA tbl_BD74,Y
C - - - - - 0x02FDE2 0B:BDD2: 8D 55 01  STA ram_0155
C - - - - - 0x02FDE5 0B:BDD5: B9 77 BD  LDA tbl_BD77,Y
C - - - - - 0x02FDE8 0B:BDD8: 8D 56 01  STA ram_0156
C - - - - - 0x02FDEB 0B:BDDB: B9 7A BD  LDA tbl_BD7A_анимация,Y
C - - - - - 0x02FDEE 0B:BDDE: 8D 00 04  STA ram_plr_anim_id
C - - - - - 0x02FDF1 0B:BDE1: B9 7D BD  LDA tbl_BD7D,Y
C - - - - - 0x02FDF4 0B:BDE4: 8D 01 04  STA ram_plr_anim_id + $01
C - - - - - 0x02FDF7 0B:BDE7: A9 27     LDA #con_0x03F6AD_27
C - - - - - 0x02FDF9 0B:BDE9: 20 90 F6  JSR sub_0x03F6A0
bra_BDEC:
C - - - - - 0x02FDFC 0B:BDEC: AD 51 01  LDA ram_0151
C - - - - - 0x02FDFF 0B:BDEF: F0 03     BEQ bra_BDF4
C - - - - - 0x02FE01 0B:BDF1: 4C 84 81  JMP loc_8184
bra_BDF4:
C - - - - - 0x02FE04 0B:BDF4: AD E0 04  LDA ram_obj_04E0
C - - - - - 0x02FE07 0B:BDF7: 4C 64 81  JMP loc_8164



loc_BE12:
C D 1 - - - 0x02FE22 0B:BE12: A5 2C     LDA ram_002C
C - - - - - 0x02FE24 0B:BE14: C9 03     CMP #$03
C - - - - - 0x02FE26 0B:BE16: D0 39     BNE bra_BE51
C - - - - - 0x02FE28 0B:BE18: 98        TYA
C - - - - - 0x02FE29 0B:BE19: 29 10     AND #$10
C - - - - - 0x02FE2B 0B:BE1B: F0 03     BEQ bra_BE20
- - - - - - 0x02FE2D 0B:BE1D: DE 42 01  DEC ram_0142,X
bra_BE20:
C - - - - - 0x02FE30 0B:BE20: 98        TYA
C - - - - - 0x02FE31 0B:BE21: 29 40     AND #$40
C - - - - - 0x02FE33 0B:BE23: D0 2F     BNE bra_BE54
C - - - - - 0x02FE35 0B:BE25: BD 40 01  LDA ram_0140,X
C - - - - - 0x02FE38 0B:BE28: C9 07     CMP #$07
C - - - - - 0x02FE3A 0B:BE2A: 90 03     BCC bra_BE2F
- - - - - - 0x02FE3C 0B:BE2C: DE 40 01  DEC ram_0140,X
bra_BE2F:
C - - - - - 0x02FE3F 0B:BE2F: 8A        TXA
C - - - - - 0x02FE40 0B:BE30: 0A        ASL
C - - - - - 0x02FE41 0B:BE31: 0A        ASL
C - - - - - 0x02FE42 0B:BE32: 0A        ASL
C - - - - - 0x02FE43 0B:BE33: 7D 40 01  ADC ram_0140,X
C - - - - - 0x02FE46 0B:BE36: A8        TAY
C - - - - - 0x02FE47 0B:BE37: FE 40 01  INC ram_0140,X
C - - - - - 0x02FE4A 0B:BE3A: AD 51 01  LDA ram_0151
C - - - - - 0x02FE4D 0B:BE3D: F0 04     BEQ bra_BE43
- - - - - - 0x02FE4F 0B:BE3F: A5 91     LDA ram_btn_hold
- - - - - - 0x02FE51 0B:BE41: D0 02     BNE bra_BE45
bra_BE43:
C - - - - - 0x02FE53 0B:BE43: B5 91     LDA ram_btn_hold,X
bra_BE45:
C - - - - - 0x02FE55 0B:BE45: 29 40     AND #$40
C - - - - - 0x02FE57 0B:BE47: D0 1B     BNE bra_BE64
C - - - - - 0x02FE59 0B:BE49: DE 44 01  DEC ram_0144,X
C - - - - - 0x02FE5C 0B:BE4C: B5 A2     LDA ram_plr_id,X
C - - - - - 0x02FE5E 0B:BE4E: 99 30 01  STA ram_0130,Y
bra_BE51:
C - - - - - 0x02FE61 0B:BE51: 4C 6F 82  JMP loc_826F
bra_BE54:
C - - - - - 0x02FE64 0B:BE54: BD 40 01  LDA ram_0140,X
C - - - - - 0x02FE67 0B:BE57: F0 0A     BEQ bra_BE63_RTS
C - - - - - 0x02FE69 0B:BE59: A9 FE     LDA #$FE
C - - - - - 0x02FE6B 0B:BE5B: 9D 44 01  STA ram_0144,X
C - - - - - 0x02FE6E 0B:BE5E: A9 0A     LDA #con_0x03F6AD_0A
C - - - - - 0x02FE70 0B:BE60: 4C 90 F6  JMP loc_0x03F6A0
bra_BE63_RTS:
C - - - - - 0x02FE73 0B:BE63: 60        RTS
bra_BE64:
- - - - - - 0x02FE74 0B:BE64: 20 7C BE  JSR sub_BE7C
- - - - - - 0x02FE77 0B:BE67: 99 30 01  STA ram_0130,Y
- - - - - - 0x02FE7A 0B:BE6A: A9 FD     LDA #$FD
- - - - - - 0x02FE7C 0B:BE6C: 9D 44 01  STA ram_0144,X
- - - - - - 0x02FE7F 0B:BE6F: A9 2C     LDA #$2C
- - - - - - 0x02FE81 0B:BE71: 9D A0 04  STA ram_obj_04A0,X
- - - - - - 0x02FE84 0B:BE74: FE 30 05  INC ram_obj_0530,X
- - - - - - 0x02FE87 0B:BE77: A9 28     LDA #con_0x03F6AD_28
- - - - - - 0x02FE89 0B:BE79: 4C 90 F6  JMP loc_0x03F6A0



sub_BE7C:
- - - - - - 0x02FE8C 0B:BE7C: A5 28     LDA ram_0028
- - - - - - 0x02FE8E 0B:BE7E: 29 07     AND #$07
- - - - - - 0x02FE90 0B:BE80: 69 FF     ADC #$FF
- - - - - - 0x02FE92 0B:BE82: 10 04     BPL bra_BE88_RTS
- - - - - - 0x02FE94 0B:BE84: A5 8C     LDA ram_008C
- - - - - - 0x02FE96 0B:BE86: 29 06     AND #$06
bra_BE88_RTS:
- - - - - - 0x02FE98 0B:BE88: 60        RTS



loc_BEA0:
C D 1 - - - 0x02FEB0 0B:BEA0: A9 81     LDA #$81
C - - - - - 0x02FEB2 0B:BEA2: 20 66 D2  JSR sub_0x03D276_записать_A_в_буфер_без_сохранения_индекса
C - - - - - 0x02FEB5 0B:BEA5: A4 00     LDY ram_0000
C - - - - - 0x02FEB7 0B:BEA7: B9 42 01  LDA ram_0142,Y
C - - - - - 0x02FEBA 0B:BEAA: 18        CLC
C - - - - - 0x02FEBB 0B:BEAB: 69 81     ADC #$81
C - - - - - 0x02FEBD 0B:BEAD: 20 5F D2  JSR sub_0x03D26F_записать_A_в_буфер_без_чтения_индекса
C - - - - - 0x02FEC0 0B:BEB0: 98        TYA
C - - - - - 0x02FEC1 0B:BEB1: 49 01     EOR #$01
C - - - - - 0x02FEC3 0B:BEB3: AA        TAX
C - - - - - 0x02FEC4 0B:BEB4: B9 42 01  LDA ram_0142,Y
C - - - - - 0x02FEC7 0B:BEB7: A0 75     LDY #$75
C - - - - - 0x02FEC9 0B:BEB9: DD 42 01  CMP ram_0142,X
loc_BEBC:
C D 1 - - - 0x02FECC 0B:BEBC: F0 04     BEQ bra_BEC2
C - - - - - 0x02FECE 0B:BEBE: B0 01     BCS bra_BEC1
C - - - - - 0x02FED0 0B:BEC0: C8        INY
bra_BEC1:
C - - - - - 0x02FED1 0B:BEC1: C8        INY
bra_BEC2:
C - - - - - 0x02FED2 0B:BEC2: 98        TYA
C - - - - - 0x02FED3 0B:BEC3: 20 5D D2  JSR sub_0x03D26D_записать_A_в_буфер_с_чтением_индекса
C - - - - - 0x02FED6 0B:BEC6: 4C 17 F6  JMP loc_0x03F627_restore_prg



sub_0x02FEE4:
C - - - - - 0x02FEE4 0B:BED4: A9 00     LDA #$00
C - - - - - 0x02FEE6 0B:BED6: 85 A2     STA ram_plr_id
C - - - - - 0x02FEE8 0B:BED8: A0 01     LDY #$01
C - - - - - 0x02FEEA 0B:BEDA: 84 A3     STY ram_plr_id + $01
C - - - - - 0x02FEEC 0B:BEDC: 84 98     STY ram_0098
C - - - - - 0x02FEEE 0B:BEDE: A4 2C     LDY ram_002C
C - - - - - 0x02FEF0 0B:BEE0: C0 04     CPY #$04
C - - - - - 0x02FEF2 0B:BEE2: F0 14     BEQ bra_BEF8
C - - - - - 0x02FEF4 0B:BEE4: A2 2D     LDX #$2D
bra_BEE6_loop:
C - - - - - 0x02FEF6 0B:BEE6: 9D 30 01  STA ram_0130,X
C - - - - - 0x02FEF9 0B:BEE9: CA        DEX
C - - - - - 0x02FEFA 0B:BEEA: 10 FA     BPL bra_BEE6_loop
C - - - - - 0x02FEFC 0B:BEEC: C0 03     CPY #$03
C - - - - - 0x02FEFE 0B:BEEE: D0 0D     BNE bra_BEFD
C - - - - - 0x02FF00 0B:BEF0: A9 01     LDA #$01
C - - - - - 0x02FF02 0B:BEF2: 8D 06 01  STA ram_0106
C - - - - - 0x02FF05 0B:BEF5: 8D 56 01  STA ram_0156
bra_BEF8:
C - - - - - 0x02FF08 0B:BEF8: A9 FF     LDA #$FF
C - - - - - 0x02FF0A 0B:BEFA: 8D 5C 01  STA ram_015C
bra_BEFD:
C - - - - - 0x02FF0D 0B:BEFD: A2 80     LDX #$80
C - - - - - 0x02FF0F 0B:BEFF: A5 26     LDA ram_0026
C - - - - - 0x02FF11 0B:BF01: F0 03     BEQ bra_BF06
C - - - - - 0x02FF13 0B:BF03: 8E 55 01  STX ram_0155
bra_BF06:
C - - - - - 0x02FF16 0B:BF06: 98        TYA
C - - - - - 0x02FF17 0B:BF07: F0 04     BEQ bra_BF0D
C - - - - - 0x02FF19 0B:BF09: C0 02     CPY #$02
C - - - - - 0x02FF1B 0B:BF0B: D0 03     BNE bra_BF10_RTS
bra_BF0D:
C - - - - - 0x02FF1D 0B:BF0D: 8E 56 01  STX ram_0156
bra_BF10_RTS:
C - - - - - 0x02FF20 0B:BF10: 60        RTS



loc_BF2C:
C D 1 - - - 0x02FF3C 0B:BF2C: A4 2C     LDY ram_002C
C - - - - - 0x02FF3E 0B:BF2E: C0 03     CPY #$03
C - - - - - 0x02FF40 0B:BF30: D0 0D     BNE bra_BF3F
C - - - - - 0x02FF42 0B:BF32: 8A        TXA
C - - - - - 0x02FF43 0B:BF33: F0 02     BEQ bra_BF37
C - - - - - 0x02FF45 0B:BF35: A9 03     LDA #$03
bra_BF37:
C - - - - - 0x02FF47 0B:BF37: 18        CLC
C - - - - - 0x02FF48 0B:BF38: 6D 51 01  ADC ram_0151
C - - - - - 0x02FF4B 0B:BF3B: A8        TAY
C - - - - - 0x02FF4C 0B:BF3C: B9 7A BD  LDA tbl_BD7A_анимация,Y
bra_BF3F:
C - - - - - 0x02FF4F 0B:BF3F: 9D 00 04  STA ram_plr_anim_id,X
C - - - - - 0x02FF52 0B:BF42: 60        RTS



sub_BF4C:
C - - - - - 0x02FF5C 0B:BF4C: A5 2C     LDA ram_002C
C - - - - - 0x02FF5E 0B:BF4E: C9 03     CMP #$03
C - - - - - 0x02FF60 0B:BF50: D0 13     BNE bra_BF65
C - - - - - 0x02FF62 0B:BF52: BD 42 01  LDA ram_0142,X
C - - - - - 0x02FF65 0B:BF55: D0 0B     BNE bra_BF62
C - - - - - 0x02FF67 0B:BF57: BD 40 01  LDA ram_0140,X
C - - - - - 0x02FF6A 0B:BF5A: C9 07     CMP #$07
C - - - - - 0x02FF6C 0B:BF5C: B0 07     BCS bra_BF65
C - - - - - 0x02FF6E 0B:BF5E: DE 30 05  DEC ram_obj_0530,X
C - - - - - 0x02FF71 0B:BF61: 60        RTS
bra_BF62:
- - - - - - 0x02FF72 0B:BF62: FE 42 01  INC ram_0142,X
bra_BF65:
C - - - - - 0x02FF75 0B:BF65: FE 30 05  INC ram_obj_0530,X
C - - - - - 0x02FF78 0B:BF68: 60        RTS



loc_0x02FF80:
C D 1 - - - 0x02FF80 0B:BF70: A8        TAY
C - - - - - 0x02FF81 0B:BF71: B9 EA BF  LDA tbl_BFEA,Y
C - - - - - 0x02FF84 0B:BF74: CD 5C 01  CMP ram_015C
C - - - - - 0x02FF87 0B:BF77: D0 02     BNE bra_BF7B
C - - - - - 0x02FF89 0B:BF79: 49 01     EOR #$01
bra_BF7B:
C - - - - - 0x02FF8B 0B:BF7B: 85 9E     STA ram_009E
C - - - - - 0x02FF8D 0B:BF7D: E0 04     CPX #$04
C - - - - - 0x02FF8F 0B:BF7F: D0 03     BNE bra_BF84
C - - - - - 0x02FF91 0B:BF81: 4C 19 E2  JMP loc_0x03E229
bra_BF84:
C - - - - - 0x02FF94 0B:BF84: AC 50 01  LDY ram_0150
C - - - - - 0x02FF97 0B:BF87: AD 2C 01  LDA ram_option_team_keeps
C - - - - - 0x02FF9A 0B:BF8A: F0 0A     BEQ bra_BF96
C - - - - - 0x02FF9C 0B:BF8C: A2 01     LDX #$01
C - - - - - 0x02FF9E 0B:BF8E: C9 03     CMP #$03
C - - - - - 0x02FFA0 0B:BF90: B0 01     BCS bra_BF93
C - - - - - 0x02FFA2 0B:BF92: CA        DEX
bra_BF93:
C - - - - - 0x02FFA3 0B:BF93: BC 42 01  LDY ram_0142,X
bra_BF96:
C - - - - - 0x02FFA6 0B:BF96: B9 30 01  LDA ram_0130,Y
C - - - - - 0x02FFA9 0B:BF99: 20 B5 BB  JSR sub_BBB5
C - - - - - 0x02FFAC 0B:BF9C: 85 A2     STA ram_plr_id
C - - - - - 0x02FFAE 0B:BF9E: 8A        TXA
C - - - - - 0x02FFAF 0B:BF9F: 49 01     EOR #$01
C - - - - - 0x02FFB1 0B:BFA1: AA        TAX
C - - - - - 0x02FFB2 0B:BFA2: AC 50 01  LDY ram_0150
C - - - - - 0x02FFB5 0B:BFA5: AD 2C 01  LDA ram_option_team_keeps
C - - - - - 0x02FFB8 0B:BFA8: F0 03     BEQ bra_BFAD
C - - - - - 0x02FFBA 0B:BFAA: BC 42 01  LDY ram_0142,X
bra_BFAD:
C - - - - - 0x02FFBD 0B:BFAD: B9 38 01  LDA ram_0138,Y
C - - - - - 0x02FFC0 0B:BFB0: 20 B5 BB  JSR sub_BBB5
C - - - - - 0x02FFC3 0B:BFB3: 85 A3     STA ram_plr_id + $01
C - - - - - 0x02FFC5 0B:BFB5: 4C 46 E2  JMP loc_0x03E256



tbl_BFEA:
- - - - - - 0x02FFFA 0B:BFEA: 00        .byte $00   ; 00
- D 1 - - - 0x02FFFB 0B:BFEB: 06        .byte $06   ; 01
- D 1 - - - 0x02FFFC 0B:BFEC: 04        .byte $04   ; 02
- D 1 - - - 0x02FFFD 0B:BFED: 07        .byte $07   ; 03
- D 1 - - - 0x02FFFE 0B:BFEE: 00        .byte $00   ; 04
- - - - - - 0x02FFFF 0B:BFEF: 07        .byte $07   ; 05
- - - - - - 0x030000 0B:BFF0: 01        .byte $01   ; 06
- - - - - - 0x030001 0B:BFF1: 06        .byte $06   ; 07
- D 1 - - - 0x030002 0B:BFF2: 01        .byte $01   ; 08
- D 1 - - - 0x030003 0B:BFF3: 04        .byte $04   ; 09
- - - - - - 0x030004 0B:BFF4: 06        .byte $06   ; 0A
- D 1 - - - 0x030005 0B:BFF5: 00        .byte $00   ; 0B
- D 1 - - - 0x030006 0B:BFF6: 04        .byte $04   ; 0C
- D 1 - - - 0x030007 0B:BFF7: 01        .byte $01   ; 0D
- - - - - - 0x030008 0B:BFF8: 07        .byte $07   ; 0E
- D 1 - - - 0x030009 0B:BFF9: 06        .byte $06   ; 0F



tbl_BFFA:
- D 1 - - - 0x03000A 0B:BFFA: 10        .byte $10   ; 00
- D 1 - - - 0x03000B 0B:BFFB: 10        .byte $10   ; 01
- D 1 - - - 0x03000C 0B:BFFC: 10        .byte $10   ; 02
- D 1 - - - 0x03000D 0B:BFFD: 3C        .byte $3C   ; 03



