.segment "BANK_18"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
; 0x030010-0x03400F
.org $8000



.export sub_0x030086_написать_текст_на_экране
.export tbl_0x030245_спрайты_объектов
.export sub_0x031010_запись_буферов_в_ppu



- D 0 - - - 0x030010 0C:8000: 08        .byte con_bank_id + $08   ; 



tbl_8001:
- D 0 - - - 0x030011 0C:8001: 00        .byte $00   ; 01 +01
- D 0 - - - 0x030012 0C:8002: 04        .byte $04   ; 02 +32
- D 0 - - - 0x030013 0C:8003: 00        .byte $00   ; 03 +01
- D 0 - - - 0x030014 0C:8004: 00        .byte $00   ; 04 +01
- D 0 - - - 0x030015 0C:8005: 04        .byte $04   ; 05 +32



loc_8006:
; bzk optimize, может лучше сделать таблицу прыжков для всех режимов? так явно быстрее будет
; однако поскольку мы находимся в нми, надо использовать другой код с прыжками, а не оригинальный
; 00 = буфер закрыт
; 01 = записать список байтов, FF = end token, +01
; 02 = записать список байтов, FF = end token, +32
; 03 = счетчик + запись байта N раз, +01
; 04 = счетчик + запись байта N раз с постоянным его увеличением, +01
; 05 = счетчик + запись байта N раз, +32
; 06 = (только после 01 или 02, unused 0x03005D)
C D 0 - - - 0x030016 0C:8006: A0 00     LDY #$00
bra_8008_main_loop:
C - - - - - 0x030018 0C:8008: BE 00 03  LDX ram_ppu_buffer,Y
C - - - - - 0x03001B 0C:800B: F0 28     BEQ bra_8035
C - - - - - 0x03001D 0C:800D: A5 FF     LDA ram_for_2000
C - - - - - 0x03001F 0C:800F: 29 18     AND #$18
C - - - - - 0x030021 0C:8011: 1D 00 80  ORA tbl_8001 - $01,X
C - - - - - 0x030024 0C:8014: 8D 00 20  STA $2000
C - - - - - 0x030027 0C:8017: C8        INY
C - - - - - 0x030028 0C:8018: AD 02 20  LDA $2002
; bzk optimize, INY после каждой записи, а не 2 сразу
C - - - - - 0x03002B 0C:801B: B9 01 03  LDA ram_ppu_buffer + $01,Y
C - - - - - 0x03002E 0C:801E: 8D 06 20  STA $2006
C - - - - - 0x030031 0C:8021: B9 00 03  LDA ram_ppu_buffer,Y
C - - - - - 0x030034 0C:8024: 8D 06 20  STA $2006
C - - - - - 0x030037 0C:8027: C8        INY
C - - - - - 0x030038 0C:8028: C8        INY
C - - - - - 0x030039 0C:8029: E0 03     CPX #$03
C - - - - - 0x03003B 0C:802B: F0 26     BEQ bra_8053
C - - - - - 0x03003D 0C:802D: 90 13     BCC bra_8042
C - - - - - 0x03003F 0C:802F: E0 05     CPX #$05
C - - - - - 0x030041 0C:8031: 90 30     BCC bra_8063
C - - - - - 0x030043 0C:8033: B0 1E     BCS bra_8053    ; jmp
bra_8035:
C - - - - - 0x030045 0C:8035: A9 00     LDA #$00
C - - - - - 0x030047 0C:8037: 8D 00 03  STA ram_ppu_buffer
C - - - - - 0x03004A 0C:803A: 85 25     STA ram_index_ppu_buffer
C - - - - - 0x03004C 0C:803C: 60        RTS
bra_803D:
- - - - - - 0x03004D 0C:803D: A9 FF     LDA #$FF
bra_803F_loop:
C - - - - - 0x03004F 0C:803F: 8D 07 20  STA $2007
bra_8042:
; режим 01 02
C - - - - - 0x030052 0C:8042: B9 00 03  LDA ram_ppu_buffer,Y
C - - - - - 0x030055 0C:8045: C8        INY
C - - - - - 0x030056 0C:8046: C9 FF     CMP #$FF
C - - - - - 0x030058 0C:8048: D0 F5     BNE bra_803F_loop
; FF
; bzk optimize, нет такого режима 06+
                                        ;BEQ bra_8008_main_loop
C - - - - - 0x03005A 0C:804A: B9 00 03  LDA ram_ppu_buffer,Y
C - - - - - 0x03005D 0C:804D: C9 06     CMP #$06
C - - - - - 0x03005F 0C:804F: 90 B7     BCC bra_8008_main_loop
; режим 06+
- - - - - - 0x030061 0C:8051: B0 EA     BCS bra_803D   ; jmp
bra_8053:
; режим 03 05
C - - - - - 0x030063 0C:8053: BE 00 03  LDX ram_ppu_buffer,Y
C - - - - - 0x030066 0C:8056: C8        INY
C - - - - - 0x030067 0C:8057: B9 00 03  LDA ram_ppu_buffer,Y
C - - - - - 0x03006A 0C:805A: C8        INY
bra_805B_loop:
C - - - - - 0x03006B 0C:805B: 8D 07 20  STA $2007
C - - - - - 0x03006E 0C:805E: CA        DEX
C - - - - - 0x03006F 0C:805F: D0 FA     BNE bra_805B_loop
C - - - - - 0x030071 0C:8061: F0 A5     BEQ bra_8008_main_loop    ; jmp
bra_8063:
; режим 04
C - - - - - 0x030073 0C:8063: BE 00 03  LDX ram_ppu_buffer,Y
C - - - - - 0x030076 0C:8066: C8        INY
C - - - - - 0x030077 0C:8067: B9 00 03  LDA ram_ppu_buffer,Y
C - - - - - 0x03007A 0C:806A: C8        INY
C - - - - - 0x03007B 0C:806B: 18        CLC
bra_806C_loop:
C - - - - - 0x03007C 0C:806C: 8D 07 20  STA $2007
C - - - - - 0x03007F 0C:806F: 69 01     ADC #$01
C - - - - - 0x030081 0C:8071: CA        DEX
C - - - - - 0x030082 0C:8072: D0 F8     BNE bra_806C_loop
C - - - - - 0x030084 0C:8074: F0 92     BEQ bra_8008_main_loop    ; jmp



sub_0x030086_написать_текст_на_экране:
; если индекс +80, тогда текст будет затерт
C - - - - - 0x030086 0C:8076: 0A        ASL
C - - - - - 0x030087 0C:8077: A8        TAY
C - - - - - 0x030088 0C:8078: B9 00 8C  LDA tbl_8C00,Y
C - - - - - 0x03008B 0C:807B: 85 00     STA ram_0000
C - - - - - 0x03008D 0C:807D: B9 01 8C  LDA tbl_8C00 + $01,Y
C - - - - - 0x030090 0C:8080: 85 01     STA ram_0001
C - - - - - 0x030092 0C:8082: A9 FF     LDA #$FF
C - - - - - 0x030094 0C:8084: 69 00     ADC #$00
; запишется 00 если индекс был +80
C - - - - - 0x030096 0C:8086: 85 02     STA ram_0002
C - - - - - 0x030098 0C:8088: A0 00     LDY #$00
loc_808A_main_loop:
C D 0 - - - 0x03009A 0C:808A: A9 01     LDA #$01
C - - - - - 0x03009C 0C:808C: 20 5D D2  JSR sub_0x03D26D_записать_A_в_буфер_с_чтением_индекса
C - - - - - 0x03009F 0C:808F: B1 00     LDA (ram_0000),Y
C - - - - - 0x0300A1 0C:8091: 20 5F D2  JSR sub_0x03D26F_записать_A_в_буфер_с_сохранением_индекса
C - - - - - 0x0300A4 0C:8094: C8        INY
C - - - - - 0x0300A5 0C:8095: B1 00     LDA (ram_0000),Y
C - - - - - 0x0300A7 0C:8097: 20 5F D2  JSR sub_0x03D26F_записать_A_в_буфер_с_сохранением_индекса
C - - - - - 0x0300AA 0C:809A: C8        INY
loc_809B_loop:
C D 0 - - - 0x0300AB 0C:809B: B1 00     LDA (ram_0000),Y
C - - - - - 0x0300AD 0C:809D: C8        INY
C - - - - - 0x0300AE 0C:809E: C9 FF     CMP #$FF
C - - - - - 0x0300B0 0C:80A0: F0 12     BEQ bra_80B4_FF
C - - - - - 0x0300B2 0C:80A2: C9 FE     CMP #$FE
C - - - - - 0x0300B4 0C:80A4: F0 08     BEQ bra_80AE_FE
; если индекс был 80, получится AND 00 = 00, и вместо буквы запишется пробел
; в противном случае после AND FF буква не поменяется
C - - - - - 0x0300B6 0C:80A6: 25 02     AND ram_0002
C - - - - - 0x0300B8 0C:80A8: 20 5F D2  JSR sub_0x03D26F_записать_A_в_буфер_с_сохранением_индекса
C - - - - - 0x0300BB 0C:80AB: 4C 9B 80  JMP loc_809B_loop
bra_80AE_FE:
C - - - - - 0x0300BE 0C:80AE: 20 5B D2  JSR sub_0x03D26B_записать_FF_в_буфер_с_чтением_индекса
C - - - - - 0x0300C1 0C:80B1: 4C 8A 80  JMP loc_808A_main_loop
bra_80B4_FF:
C - - - - - 0x0300C4 0C:80B4: 4C 5B D2  JMP loc_0x03D26B_записать_FF_в_буфер_с_чтением_индекса



_off014_811A_00_story:
- D 0 - I - 0x03012A 0C:811A: 0C 22     .word $220C
- D 0 - I - 0x03012C 0C:811C: 9D        .byte $9D, $9E, $99, $9C, $A3   ; STORY

- D 0 - I - 0x030131 0C:8121: FF        .byte $FF   ; end token



_off014_8122_01_vs_player:
- D 0 - I - 0x030132 0C:8122: 4C 22     .word $224C
- D 0 - I - 0x030134 0C:8124: A0        .byte $A0, $9D, $00, $9A, $96, $8B, $A3, $8F, $9C   ; VS PLAYER

- D 0 - I - 0x03013D 0C:812D: FF        .byte $FF   ; end token



_off014_812E_02_vs_cpu:
- D 0 - I - 0x03013E 0C:812E: 8C 22     .word $228C
- D 0 - I - 0x030140 0C:8130: A0        .byte $A0, $9D, $00, $8D, $9A, $9F   ; VS CPU

- D 0 - I - 0x030146 0C:8136: FF        .byte $FF   ; end token



_off014_8137_03_vs_team:
- D 0 - I - 0x030147 0C:8137: CC 22     .word $22CC
- D 0 - I - 0x030149 0C:8139: A0        .byte $A0, $9D, $00, $9E, $8F, $8B, $97   ; VS TEAM

- D 0 - I - 0x030150 0C:8140: FF        .byte $FF   ; end token



_off014_8141_04_tournament:
- D 0 - I - 0x030151 0C:8141: 0C 23     .word $230C
- D 0 - I - 0x030153 0C:8143: 9E        .byte $9E, $99, $9F, $9C, $98, $8B, $97, $8F, $98, $9E   ; TOURNAMENT

- D 0 - I - 0x03015D 0C:814D: FF        .byte $FF   ; end token



_off014_814E_05_option:
- D 0 - I - 0x03015E 0C:814E: 4C 23     .word $234C
- D 0 - I - 0x030160 0C:8150: 99        .byte $99, $9A, $9E, $93, $99, $98   ; OPTION

- D 0 - I - 0x030166 0C:8156: FF        .byte $FF   ; end token



_off014_8157_06_game_over:
; bzk optimize, лишние пробелы в конце
- D 0 - I - 0x030167 0C:8157: 2C 22     .word $222C
- D 0 - I - 0x030169 0C:8159: 91        .byte $91, $8B, $97, $8F, $00, $99, $A0, $8F, $9C, $00, $00, $00   ; GAME OVER

- D 0 - I - 0x030175 0C:8165: FF        .byte $FF   ; end token



_off014_8166_07_continue:
; bzk optimize, лишние пробелы в конце
- D 0 - I - 0x030176 0C:8166: 2C 22     .word $222C
- D 0 - I - 0x030178 0C:8168: 8D        .byte $8D, $99, $98, $9E, $93, $98, $9F, $8F, $00, $00, $00   ; CONTINUE

- D 0 - I - 0x030183 0C:8173: FF        .byte $FF   ; end token



_off014_8174_09_easy:
- D 0 - I - 0x030184 0C:8174: 74 20     .word $2074
- D 0 - I - 0x030186 0C:8176: 8F        .byte $8F, $8B, $9D, $A3, $00, $00   ; EASY

- D 0 - I - 0x03018C 0C:817C: FF        .byte $FF   ; end token



_off014_817D_0A_normal:
- D 0 - I - 0x03018D 0C:817D: 74 20     .word $2074
- D 0 - I - 0x03018F 0C:817F: 98        .byte $98, $99, $9C, $97, $8B, $96   ; NORMAL

- D 0 - I - 0x030195 0C:8185: FF        .byte $FF   ; end token



_off014_8186_0B_hard:
- D 0 - I - 0x030196 0C:8186: 74 20     .word $2074
- D 0 - I - 0x030198 0C:8188: 92        .byte $92, $8B, $9C, $8E, $00, $00   ; HARD

- D 0 - I - 0x03019E 0C:818E: FF        .byte $FF   ; end token



_off014_818F_13_normal:
- D 0 - I - 0x03019F 0C:818F: F4 20     .word $20F4
- D 0 - I - 0x0301A1 0C:8191: 98        .byte $98, $99, $9C, $97, $8B, $96   ; NORMAL

- D 0 - I - 0x0301A7 0C:8197: FF        .byte $FF   ; end token



_off014_8198_14_turbo:
- D 0 - I - 0x0301A8 0C:8198: F4 20     .word $20F4
- D 0 - I - 0x0301AA 0C:819A: 9E        .byte $9E, $9F, $9C, $8C, $99, $00   ; TURBO

- D 0 - I - 0x0301B0 0C:81A0: FF        .byte $FF   ; end token



_off014_81A1_0E_winner:
- - - - - - 0x0301B1 0C:81A1: ED 20     .word $20ED
- - - - - - 0x0301B3 0C:81A3: A1        .byte $A1, $93, $98, $98, $8F, $9C   ; WINNER

- - - - - - 0x0301B9 0C:81A9: FF        .byte $FF   ; end token



_off014_81AA_0F_player1_player2:
- - - - - - 0x0301BA 0C:81AA: 02 25     .word $2502
- - - - - - 0x0301BC 0C:81AC: 9A        .byte $9A, $96, $8B, $A3, $8F, $9C, $82   ; PLAYER1

- - - - - - 0x0301C3 0C:81B3: FE        .byte $FE   ; continue

- - - - - - 0x0301C4 0C:81B4: 1A 23     .word $231A
- - - - - - 0x0301C6 0C:81B6: 9A        .byte $9A, $96, $8B, $A3, $8F, $9C, $83   ; PLAYER2

- - - - - - 0x0301CD 0C:81BD: FF        .byte $FF   ; end token



_off014_81BE_11:
- D 0 - I - 0x0301CE 0C:81BE: AB 23     .word $23AB
- D 0 - I - 0x0301D0 0C:81C0: C9        .byte $C9, $CA, $CB, $CC, $00, $D9, $DA, $DB, $DC, $DD   ; 

- D 0 - I - 0x0301DA 0C:81CA: FF        .byte $FF   ; end token



_off014_81CB_12_cpu:
- D 0 - I - 0x0301DB 0C:81CB: 74 20     .word $2074
- D 0 - I - 0x0301DD 0C:81CD: 00        .byte $00, $00, $8D, $9A, $9F, $00, $00, $00   ; CPU

- D 0 - I - 0x0301E5 0C:81D5: FF        .byte $FF   ; end token



_off014_81D6_15_bonus:
- D 0 - I - 0x0301E6 0C:81D6: 6A 23     .word $236A
- D 0 - I - 0x0301E8 0C:81D8: 8C        .byte $8C, $99, $98, $9F, $9D   ; BONUS

- D 0 - I - 0x0301ED 0C:81DD: FE        .byte $FE   ; continue

- D 0 - I - 0x0301EE 0C:81DE: 75 23     .word $2375
- D 0 - I - 0x0301F0 0C:81E0: 81        .byte $81, $81   ; 00

- D 0 - I - 0x0301F2 0C:81E2: FF        .byte $FF   ; end token



_off014_81E3_16_time:
- D 0 - I - 0x0301F3 0C:81E3: 2A 23     .word $232A
- D 0 - I - 0x0301F5 0C:81E5: 9E        .byte $9E, $93, $97, $8F   ; TIME

- D 0 - I - 0x0301F9 0C:81E9: FF        .byte $FF   ; end token



_off014_81EA_17_perfect:
- D 0 - I - 0x0301FA 0C:81EA: 4A 23     .word $234A
- D 0 - I - 0x0301FC 0C:81EC: 9A        .byte $9A, $8F, $9C, $90, $8F, $8D, $9E   ; PERFECT

- D 0 - I - 0x030203 0C:81F3: FF        .byte $FF   ; end token



_off014_81F4_18_life:
- D 0 - I - 0x030204 0C:81F4: 4A 23     .word $234A
- D 0 - I - 0x030206 0C:81F6: 96        .byte $96, $93, $90, $8F   ; LIFE

- D 0 - I - 0x03020A 0C:81FA: FF        .byte $FF   ; end token



_off014_81FB_19_rematch:
- D 0 - I - 0x03020B 0C:81FB: 0D 23     .word $230D
- D 0 - I - 0x03020D 0C:81FD: 9C        .byte $9C, $8F, $97, $8B, $9E, $8D, $92   ; REMATCH

- D 0 - I - 0x030214 0C:8204: FF        .byte $FF   ; end token



_off014_8205_1A_end:
- D 0 - I - 0x030215 0C:8205: 4D 23     .word $234D
- D 0 - I - 0x030217 0C:8207: 8F        .byte $8F, $98, $8E   ; END

- D 0 - I - 0x03021A 0C:820A: FF        .byte $FF   ; end token



_off014_820B_08_bonus_game:
- D 0 - I - 0x03021B 0C:820B: 0C 22     .word $220C
- D 0 - I - 0x03021D 0C:820D: 8C        .byte $8C, $99, $98, $9F, $9D, $00, $91, $8B, $97, $8F   ; BONUS GAME

- D 0 - I - 0x030227 0C:8217: FF        .byte $FF   ; end token



_off014_8218_0D_time_bonus_game:
- D 0 - I - 0x030228 0C:8218: 89 20     .word $2089
- D 0 - I - 0x03022A 0C:821A: 9E        .byte $9E, $93, $97, $8F   ; TIME

- D 0 - I - 0x03022E 0C:821E: FE        .byte $FE   ; continue

- D 0 - I - 0x03022F 0C:821F: 94 20     .word $2094
- D 0 - I - 0x030231 0C:8221: 8C        .byte $8C, $99, $98, $9F, $9D, $00, $91, $8B, $97, $8F   ; BONUS GAME

- D 0 - I - 0x03023B 0C:822B: FF        .byte $FF   ; end token



_off014_822C_0C_expert:
- D 0 - I - 0x03023C 0C:822C: 74 20     .word $2074
- D 0 - I - 0x03023E 0C:822E: 8F        .byte $8F, $A2, $9A, $8F, $9C, $9E   ; EXPERT

- D 0 - I - 0x030244 0C:8234: FF        .byte $FF   ; end token



tbl_0x030245_спрайты_объектов:
- D 0 - - - 0x030245 0C:8235: 05 83     .word _off001_8305_01
- - - - - - 0x030247 0C:8237: 0E 83     .word _off001_830E_02
- D 0 - - - 0x030249 0C:8239: 13 83     .word _off001_8313_03
- D 0 - - - 0x03024B 0C:823B: 18 83     .word _off001_8318_04
- D 0 - - - 0x03024D 0C:823D: 21 83     .word _off001_8321_05
- - - - - - 0x03024F 0C:823F: 05 83     .word _off001_8305_06
- D 0 - - - 0x030251 0C:8241: 26 83     .word _off001_8326_07
- D 0 - - - 0x030253 0C:8243: 3F 83     .word _off001_833F_08
- D 0 - - - 0x030255 0C:8245: 47 83     .word _off001_8347_09
- D 0 - - - 0x030257 0C:8247: 4F 83     .word _off001_834F_0A
- D 0 - - - 0x030259 0C:8249: 57 83     .word _off001_8357_0B
- D 0 - - - 0x03025B 0C:824B: 73 83     .word _off001_8373_0C
- D 0 - - - 0x03025D 0C:824D: 8C 83     .word _off001_838C_0D
- D 0 - - - 0x03025F 0C:824F: A4 83     .word _off001_83A4_0E
- D 0 - - - 0x030261 0C:8251: B0 83     .word _off001_83B0_0F
- D 0 - - - 0x030263 0C:8253: C9 83     .word _off001_83C9_10
- - - - - - 0x030265 0C:8255: 94 83     .word _off001_8394_11
- - - - - - 0x030267 0C:8257: 9C 83     .word _off001_839C_12
- D 0 - - - 0x030269 0C:8259: F6 83     .word _off001_83F6_13
- D 0 - - - 0x03026B 0C:825B: 4A 84     .word _off001_844A_14
- D 0 - - - 0x03026D 0C:825D: 53 84     .word _off001_8453_15
- D 0 - - - 0x03026F 0C:825F: 17 84     .word _off001_8417_16
- D 0 - - - 0x030271 0C:8261: 28 84     .word _off001_8428_17
- - - - - - 0x030273 0C:8263: 39 84     .word _off001_8439_18
- - - - - - 0x030275 0C:8265: 39 84     .word _off001_8439_19
- D 0 - - - 0x030277 0C:8267: 39 84     .word _off001_8439_1A
- D 0 - - - 0x030279 0C:8269: 64 84     .word _off001_8464_1B
- D 0 - - - 0x03027B 0C:826B: 71 84     .word _off001_8471_1C
- D 0 - - - 0x03027D 0C:826D: 7E 84     .word _off001_847E_1D
- D 0 - - - 0x03027F 0C:826F: 8B 84     .word _off001_848B_1E
- D 0 - - - 0x030281 0C:8271: 98 84     .word _off001_8498_1F
- D 0 - - - 0x030283 0C:8273: A9 84     .word _off001_84A9_20
- D 0 - - - 0x030285 0C:8275: C2 84     .word _off001_84C2_21
- D 0 - - - 0x030287 0C:8277: DB 84     .word _off001_84DB_22
- D 0 - - - 0x030289 0C:8279: E0 84     .word _off001_84E0_23
- D 0 - - - 0x03028B 0C:827B: 31 85     .word _off001_8531_24
- D 0 - - - 0x03028D 0C:827D: EE 85     .word _off001_85EE_25
- D 0 - - - 0x03028F 0C:827F: FF 85     .word _off001_85FF_26
- D 0 - - - 0x030291 0C:8281: 0C 86     .word _off001_860C_27
- D 0 - - - 0x030293 0C:8283: 19 86     .word _off001_8619_28
- D 0 - - - 0x030295 0C:8285: 3E 86     .word _off001_863E_29
- D 0 - - - 0x030297 0C:8287: 5F 86     .word _off001_865F_2A
- D 0 - - - 0x030299 0C:8289: 88 86     .word _off001_8688_2B
- D 0 - - - 0x03029B 0C:828B: 8D 86     .word _off001_868D_2C
- D 0 - - - 0x03029D 0C:828D: 96 86     .word _off001_8696_2D
- D 0 - - - 0x03029F 0C:828F: B7 86     .word _off001_86B7_2E
- D 0 - - - 0x0302A1 0C:8291: D4 86     .word _off001_86D4_2F
- D 0 - - - 0x0302A3 0C:8293: ED 86     .word _off001_86ED_30
- D 0 - - - 0x0302A5 0C:8295: 12 87     .word _off001_8712_31
- D 0 - - - 0x0302A7 0C:8297: 37 87     .word _off001_8737_32
- D 0 - - - 0x0302A9 0C:8299: 5C 87     .word _off001_875C_33
- D 0 - - - 0x0302AB 0C:829B: 81 87     .word _off001_8781_34
- D 0 - - - 0x0302AD 0C:829D: A6 87     .word _off001_87A6_35
- D 0 - - - 0x0302AF 0C:829F: CB 87     .word _off001_87CB_36
- D 0 - - - 0x0302B1 0C:82A1: F4 87     .word _off001_87F4_37
- D 0 - - - 0x0302B3 0C:82A3: 19 88     .word _off001_8819_38
- - - - - - 0x0302B5 0C:82A5: 36 88     .word _off001_8836_39
- D 0 - - - 0x0302B7 0C:82A7: 53 88     .word _off001_8853_3A
- D 0 - - - 0x0302B9 0C:82A9: 98 88     .word _off001_8898_3B
- D 0 - - - 0x0302BB 0C:82AB: D9 88     .word _off001_88D9_3C
- - - - - - 0x0302BD 0C:82AD: 0E 89     .word _off001_890E_3D
- - - - - - 0x0302BF 0C:82AF: 37 89     .word _off001_8937_3E
- - - - - - 0x0302C1 0C:82B1: 6F 89     .word _off001_896F_3F
- - - - - - 0x0302C3 0C:82B3: 4C 89     .word _off001_894C_40
- - - - - - 0x0302C5 0C:82B5: 55 89     .word _off001_8955_41
- - - - - - 0x0302C7 0C:82B7: 78 89     .word _off001_8978_42
- D 0 - - - 0x0302C9 0C:82B9: 5E 89     .word _off001_895E_43
- D 0 - - - 0x0302CB 0C:82BB: 81 89     .word _off001_8981_44
- D 0 - - - 0x0302CD 0C:82BD: 8A 89     .word _off001_898A_45
- D 0 - - - 0x0302CF 0C:82BF: 9C 89     .word _off001_899C_46
- D 0 - - - 0x0302D1 0C:82C1: 93 89     .word _off001_8993_47
- D 0 - - - 0x0302D3 0C:82C3: A5 89     .word _off001_89A5_48
- D 0 - - - 0x0302D5 0C:82C5: AE 89     .word _off001_89AE_49
- D 0 - - - 0x0302D7 0C:82C7: C0 89     .word _off001_89C0_4A
- D 0 - - - 0x0302D9 0C:82C9: B7 89     .word _off001_89B7_4B
- D 0 - - - 0x0302DB 0C:82CB: C9 89     .word _off001_89C9_4C
- D 0 - - - 0x0302DD 0C:82CD: D2 89     .word _off001_89D2_4D
- D 0 - - - 0x0302DF 0C:82CF: 0B 8A     .word _off001_8A0B_4E
- D 0 - - - 0x0302E1 0C:82D1: 34 8A     .word _off001_8A34_4F
- D 0 - - - 0x0302E3 0C:82D3: 55 8A     .word _off001_8A55_50
- D 0 - - - 0x0302E5 0C:82D5: 66 8A     .word _off001_8A66_51
- D 0 - - - 0x0302E7 0C:82D7: 7F 8A     .word _off001_8A7F_52
- D 0 - - - 0x0302E9 0C:82D9: 9C 8A     .word _off001_8A9C_53
- D 0 - - - 0x0302EB 0C:82DB: B5 8A     .word _off001_8AB5_54
- D 0 - - - 0x0302ED 0C:82DD: BE 8A     .word _off001_8ABE_55
- D 0 - - - 0x0302EF 0C:82DF: C7 8A     .word _off001_8AC7_56
- D 0 - - - 0x0302F1 0C:82E1: CC 8A     .word _off001_8ACC_57
- D 0 - - - 0x0302F3 0C:82E3: D1 8A     .word _off001_8AD1_58
- D 0 - - - 0x0302F5 0C:82E5: D6 8A     .word _off001_8AD6_59



_off001_8305_01:
_off001_8305_06:
- D 0 - I - 0x030315 0C:8305: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030316 0C:8306: F8        .byte $F8, $7F, $02, $F9   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03031A 0C:830A: F8        .byte $F8, $7F, $42, $01   ; 
@end:



_off001_830E_02:
- - - - - - 0x03031E 0C:830E: 01        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- - - - - - 0x03031F 0C:830F: F9        .byte $F9, $79, $03, $FC   ; spr_Y, spr_T, spr_A, spr_X
@end:



_off001_8313_03:
- D 0 - I - 0x030323 0C:8313: 01        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030324 0C:8314: F9        .byte $F9, $7B, $02, $FD   ; spr_Y, spr_T, spr_A, spr_X
@end:



_off001_8318_04:
- D 0 - I - 0x030328 0C:8318: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030329 0C:8319: F9        .byte $F9, $7D, $02, $F9   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03032D 0C:831D: F9        .byte $F9, $7D, $C2, $01   ; 
@end:



_off001_8321_05:
- D 0 - I - 0x030331 0C:8321: 01        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030332 0C:8322: 00        .byte $00, $79, $02, $FD   ; spr_Y, spr_T, spr_A, spr_X
@end:



_off001_8326_07:
- D 0 - I - 0x030336 0C:8326: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030337 0C:8327: 00        .byte $00, $C2, $02, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03033B 0C:832B: 00        .byte $00, $C4, $02, $08   ; 
- D 0 - I - 0x03033F 0C:832F: 00        .byte $00, $C6, $02, $10   ; 
- D 0 - I - 0x030343 0C:8333: 00        .byte $00, $C8, $02, $18   ; 
- D 0 - I - 0x030347 0C:8337: 00        .byte $00, $CA, $02, $20   ; 
- D 0 - I - 0x03034B 0C:833B: 00        .byte $00, $CC, $02, $28   ; 
@end:



_off001_833F_08:
- D 0 - I - 0x03034F 0C:833F: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
                                        .byte $00, $C2, $02, $00   ; spr_Y, spr_T, spr_A, spr_X
                                        .byte $00, $C4, $02, $08   ; 
                                        .byte $00, $C6, $02, $10   ; 
                                        .byte $00, $C8, $02, $18   ; 
                                        .byte $00, $CA, $02, $20   ; 
- D 0 - I - 0x030350 0C:8340: 00        .byte $00, $CE, $02, $28   ; 
@end:



_off001_8347_09:
- D 0 - I - 0x030357 0C:8347: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
                                        .byte $00, $C2, $02, $00   ; spr_Y, spr_T, spr_A, spr_X
                                        .byte $00, $C4, $02, $08   ; 
                                        .byte $00, $C6, $02, $10   ; 
                                        .byte $00, $C8, $02, $18   ; 
                                        .byte $00, $CA, $02, $20   ; 
- D 0 - I - 0x030358 0C:8348: 00        .byte $00, $D0, $02, $28   ; 
@end:



_off001_834F_0A:
- D 0 - I - 0x03035F 0C:834F: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
                                        .byte $00, $C2, $02, $00   ; spr_Y, spr_T, spr_A, spr_X
                                        .byte $00, $C4, $02, $08   ; 
                                        .byte $00, $C6, $02, $10   ; 
                                        .byte $00, $C8, $02, $18   ; 
                                        .byte $00, $CA, $02, $20   ; 
- D 0 - I - 0x030360 0C:8350: 00        .byte $00, $D2, $02, $28   ; 
@end:



_off001_8357_0B:
- D 0 - I - 0x030367 0C:8357: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030368 0C:8358: 00        .byte $00, $D4, $02, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03036C 0C:835C: 00        .byte $00, $D6, $02, $08   ; 
- D 0 - I - 0x030370 0C:8360: 00        .byte $00, $D8, $02, $10   ; 
- D 0 - I - 0x030374 0C:8364: 00        .byte $00, $DA, $02, $18   ; 
- D 0 - I - 0x030378 0C:8368: 00        .byte $00, $DC, $02, $20   ; 
- D 0 - I - 0x03037C 0C:836C: 00        .byte $00, $DE, $02, $28   ; 
@end:



_off001_8373_0C:
- D 0 - I - 0x030383 0C:8373: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03038C 0C:837C: 00        .byte $00, $C0, $02, $00   ; 
- D 0 - I - 0x030384 0C:8374: 00        .byte $00, $CC, $02, $08   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030388 0C:8378: 00        .byte $00, $E0, $02, $10   ; 
- D 0 - I - 0x030390 0C:8380: 00        .byte $00, $E6, $02, $18   ; 
- D 0 - I - 0x030394 0C:8384: 00        .byte $00, $E8, $02, $20   ; 
- D 0 - I - 0x030398 0C:8388: 00        .byte $00, $EA, $02, $28   ; 
@end:



_off001_838C_0D:
- D 0 - I - 0x03039C 0C:838C: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
                                        .byte $00, $C0, $02, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03039D 0C:838D: 00        .byte $00, $CE, $02, $08   ; 
                                        .byte $00, $E0, $02, $10   ; 
                                        .byte $00, $E6, $02, $18   ; 
                                        .byte $00, $E8, $02, $20   ; 
                                        .byte $00, $EA, $02, $28   ; 
@end:



_off001_8394_11:
- - - - - - 0x0303A4 0C:8394: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
                                        .byte $00, $C0, $02, $00   ; spr_Y, spr_T, spr_A, spr_X
- - - - - - 0x0303A5 0C:8395: 00        .byte $00, $D0, $02, $08   ; 
                                        .byte $00, $E0, $02, $10   ; 
                                        .byte $00, $E6, $02, $18   ; 
                                        .byte $00, $E8, $02, $20   ; 
                                        .byte $00, $EA, $02, $28   ; 
@end:



_off001_839C_12:
- - - - - - 0x0303AC 0C:839C: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
                                        .byte $00, $C0, $02, $00   ; spr_Y, spr_T, spr_A, spr_X
- - - - - - 0x0303AD 0C:839D: 00        .byte $00, $D2, $02, $08   ; 
                                        .byte $00, $E0, $02, $10   ; 
                                        .byte $00, $E6, $02, $18   ; 
                                        .byte $00, $E8, $02, $20   ; 
                                        .byte $00, $EA, $02, $28   ; 
@end:



_off001_83A4_0E:
- D 0 - I - 0x0303B4 0C:83A4: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
                                        .byte $00, $C0, $02, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0303B5 0C:83A5: 00        .byte $00, $E2, $02, $08   ; 
- D 0 - I - 0x0303B9 0C:83A9: 00        .byte $00, $E4, $02, $10   ; 
                                        .byte $00, $E6, $02, $18   ; 
                                        .byte $00, $E8, $02, $20   ; 
                                        .byte $00, $EA, $02, $28   ; 
@end:



_off001_83B0_0F:
- D 0 - I - 0x0303C0 0C:83B0: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0303C1 0C:83B1: 00        .byte $00, $C0, $02, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0303C5 0C:83B5: 00        .byte $00, $EC, $02, $08   ; 
- D 0 - I - 0x0303C9 0C:83B9: 00        .byte $00, $EE, $02, $10   ; 
- D 0 - I - 0x0303CD 0C:83BD: 00        .byte $00, $F0, $02, $18   ; 
- D 0 - I - 0x0303D1 0C:83C1: 00        .byte $00, $F2, $02, $20   ; 
- D 0 - I - 0x0303D5 0C:83C5: 00        .byte $00, $C0, $42, $28   ; 
@end:



_off001_83C9_10:
- D 0 - I - 0x0303D9 0C:83C9: 0B        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0303DA 0C:83CA: 00        .byte $00, $C0, $02, $F8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0303DE 0C:83CE: 00        .byte $00, $EC, $02, $00   ; 
- D 0 - I - 0x0303E2 0C:83D2: 00        .byte $00, $C4, $02, $08   ; 
- D 0 - I - 0x0303E6 0C:83D6: 00        .byte $00, $C6, $02, $10   ; 
- D 0 - I - 0x0303EA 0C:83DA: 00        .byte $00, $F4, $02, $18   ; 
- D 0 - I - 0x0303EE 0C:83DE: 00        .byte $00, $F6, $02, $20   ; 
- D 0 - I - 0x0303F2 0C:83E2: 00        .byte $00, $C0, $42, $28   ; 
- D 0 - I - 0x0303F6 0C:83E6: 10        .byte $10, $C0, $02, $04   ; 
- D 0 - I - 0x0303FA 0C:83EA: 10        .byte $10, $F8, $02, $0C   ; 
- D 0 - I - 0x0303FE 0C:83EE: 10        .byte $10, $FA, $02, $14   ; 
- D 0 - I - 0x030402 0C:83F2: 10        .byte $10, $FC, $02, $1C   ; 
@end:



_off001_83F6_13:
- D 0 - I - 0x030406 0C:83F6: 08        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030407 0C:83F7: 09        .byte $09, $6F, $03, $F8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03040B 0C:83FB: 09        .byte $09, $6F, $43, $00   ; 
- D 0 - I - 0x03040F 0C:83FF: E9        .byte $E9, $67, $02, $F4   ; 
- D 0 - I - 0x030413 0C:8403: E9        .byte $E9, $69, $02, $FC   ; 
- D 0 - I - 0x030417 0C:8407: F9        .byte $F9, $6B, $02, $F4   ; 
- D 0 - I - 0x03041B 0C:840B: F9        .byte $F9, $6D, $02, $FC   ; 
- D 0 - I - 0x03041F 0C:840F: E9        .byte $E9, $67, $42, $04   ; 
- D 0 - I - 0x030423 0C:8413: F9        .byte $F9, $6B, $42, $04   ; 
@end:



_off001_8417_16:
- D 0 - I - 0x030427 0C:8417: 04        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030428 0C:8418: F8        .byte $F8, $43, $02, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03042C 0C:841C: F8        .byte $F8, $45, $02, $10   ; 
- D 0 - I - 0x030430 0C:8420: F8        .byte $F8, $49, $02, $18   ; 
- D 0 - I - 0x030434 0C:8424: F8        .byte $F8, $43, $42, $28   ; 
@end:



_off001_8428_17:
- D 0 - I - 0x030438 0C:8428: 04        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030439 0C:8429: 32        .byte $32, $4B, $03, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03043D 0C:842D: 32        .byte $32, $4D, $03, $10   ; 
- D 0 - I - 0x030441 0C:8431: 32        .byte $32, $51, $03, $18   ; 
- D 0 - I - 0x030445 0C:8435: 32        .byte $32, $4B, $43, $28   ; 
@end:



_off001_8439_18:
_off001_8439_19:
_off001_8439_1A:
- D 0 - I - 0x030449 0C:8439: 04        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03044A 0C:843A: 32        .byte $32, $4B, $03, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03044E 0C:843E: 32        .byte $32, $4B, $43, $28   ; 
- D 0 - I - 0x030452 0C:8442: 32        .byte $32, $53, $03, $10   ; 
- D 0 - I - 0x030456 0C:8446: 32        .byte $32, $55, $03, $18   ; 
@end:



_off001_844A_14:
- D 0 - I - 0x03045A 0C:844A: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03045B 0C:844B: 00        .byte $00, $57, $80, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03045F 0C:844F: 18        .byte $18, $57, $00, $00   ; 
@end:



_off001_8453_15:
- D 0 - I - 0x030463 0C:8453: 04        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030464 0C:8454: 00        .byte $00, $59, $01, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030468 0C:8458: 00        .byte $00, $59, $41, $38   ; 
- D 0 - I - 0x03046C 0C:845C: 10        .byte $10, $59, $81, $00   ; 
- D 0 - I - 0x030470 0C:8460: 10        .byte $10, $59, $C1, $38   ; 
@end:



_off001_8464_1B:
- D 0 - I - 0x030474 0C:8464: 03        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030475 0C:8465: 08        .byte $08, $03, $00, $0E   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030479 0C:8469: 08        .byte $08, $05, $00, $16   ; 
- D 0 - I - 0x03047D 0C:846D: 08        .byte $08, $07, $00, $1E   ; 
@end:



_off001_8471_1C:
- D 0 - I - 0x030481 0C:8471: 03        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030482 0C:8472: 00        .byte $00, $09, $00, $0D   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030486 0C:8476: 00        .byte $00, $0B, $00, $15   ; 
- D 0 - I - 0x03048A 0C:847A: 00        .byte $00, $0D, $00, $1D   ; 
@end:



_off001_847E_1D:
- D 0 - I - 0x03048E 0C:847E: 03        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03048F 0C:847F: 08        .byte $08, $0F, $00, $08   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030493 0C:8483: 08        .byte $08, $11, $00, $10   ; 
- D 0 - I - 0x030497 0C:8487: 08        .byte $08, $13, $00, $18   ; 
@end:



_off001_848B_1E:
- D 0 - I - 0x03049B 0C:848B: 03        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03049C 0C:848C: 05        .byte $05, $19, $00, $08   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0304A0 0C:8490: 05        .byte $05, $1B, $00, $10   ; 
- D 0 - I - 0x0304A4 0C:8494: 05        .byte $05, $1D, $00, $18   ; 
@end:



_off001_8498_1F:
- D 0 - I - 0x0304A8 0C:8498: 04        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0304A9 0C:8499: 08        .byte $08, $1F, $00, $0D   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0304AD 0C:849D: 18        .byte $18, $21, $00, $08   ; 
- D 0 - I - 0x0304B1 0C:84A1: 18        .byte $18, $23, $00, $10   ; 
- D 0 - I - 0x0304B5 0C:84A5: 18        .byte $18, $25, $00, $18   ; 
@end:



_off001_84A9_20:
- D 0 - I - 0x0304B9 0C:84A9: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0304BA 0C:84AA: 02        .byte $02, $27, $00, $0C   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0304BE 0C:84AE: 02        .byte $02, $29, $00, $14   ; 
- D 0 - I - 0x0304C2 0C:84B2: 02        .byte $02, $2B, $00, $1C   ; 
- D 0 - I - 0x0304C6 0C:84B6: 16        .byte $16, $2D, $00, $10   ; 
- D 0 - I - 0x0304CA 0C:84BA: 15        .byte $15, $2F, $00, $18   ; 
- D 0 - I - 0x0304CE 0C:84BE: 15        .byte $15, $31, $00, $20   ; 
@end:



_off001_84C2_21:
- D 0 - I - 0x0304D2 0C:84C2: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0304D3 0C:84C3: 08        .byte $08, $33, $00, $0C   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0304D7 0C:84C7: 08        .byte $08, $35, $00, $14   ; 
- D 0 - I - 0x0304DB 0C:84CB: 18        .byte $18, $37, $00, $00   ; 
- D 0 - I - 0x0304DF 0C:84CF: 18        .byte $18, $39, $00, $08   ; 
- D 0 - I - 0x0304E3 0C:84D3: 18        .byte $18, $3D, $00, $18   ; 
- D 0 - I - 0x0304E7 0C:84D7: 18        .byte $18, $3B, $00, $10   ; 
@end:



_off001_84DB_22:
- D 0 - I - 0x0304EB 0C:84DB: 01        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0304EC 0C:84DC: F8        .byte $F8, $DD, $03, $FC   ; spr_Y, spr_T, spr_A, spr_X
@end:



_off001_84E0_23:
- D 0 - I - 0x0304F0 0C:84E0: 14        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0304F1 0C:84E1: 10        .byte $10, $49, $01, $E4   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0304F5 0C:84E5: 10        .byte $10, $4B, $01, $EC   ; 
- D 0 - I - 0x0304F9 0C:84E9: 20        .byte $20, $25, $00, $E4   ; 
- D 0 - I - 0x0304FD 0C:84ED: 20        .byte $20, $27, $00, $EC   ; 
- D 0 - I - 0x030501 0C:84F1: 20        .byte $20, $29, $00, $F4   ; 
- D 0 - I - 0x030505 0C:84F5: 30        .byte $30, $79, $03, $E0   ; 
- D 0 - I - 0x030509 0C:84F9: 30        .byte $30, $4D, $01, $F0   ; 
- D 0 - I - 0x03050D 0C:84FD: 40        .byte $40, $2B, $00, $E8   ; 
- D 0 - I - 0x030511 0C:8501: 40        .byte $40, $7B, $03, $F8   ; 
- D 0 - I - 0x030515 0C:8505: 50        .byte $50, $7D, $03, $E0   ; 
- D 0 - I - 0x030519 0C:8509: 50        .byte $50, $4F, $01, $F0   ; 
- D 0 - I - 0x03051D 0C:850D: 00        .byte $00, $2D, $00, $24   ; 
- D 0 - I - 0x030521 0C:8511: 20        .byte $20, $51, $01, $20   ; 
- D 0 - I - 0x030525 0C:8515: 20        .byte $20, $53, $01, $28   ; 
- D 0 - I - 0x030529 0C:8519: 1F        .byte $1F, $2F, $00, $2F   ; 
- D 0 - I - 0x03052D 0C:851D: 10        .byte $10, $7F, $02, $38   ; 
- D 0 - I - 0x030531 0C:8521: 10        .byte $10, $81, $02, $40   ; 
- D 0 - I - 0x030535 0C:8525: 30        .byte $30, $73, $03, $F8   ; 
- D 0 - I - 0x030539 0C:8529: 30        .byte $30, $75, $01, $D0   ; 
- D 0 - I - 0x03053D 0C:852D: 3C        .byte $3C, $77, $00, $D8   ; 
@end:



_off001_8531_24:
- D 0 - I - 0x030541 0C:8531: 2F        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030542 0C:8532: 02        .byte $02, $09, $00, $E0   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030546 0C:8536: 00        .byte $00, $01, $00, $E8   ; 
- D 0 - I - 0x03054A 0C:853A: 00        .byte $00, $03, $00, $F0   ; 
- D 0 - I - 0x03054E 0C:853E: FD        .byte $FD, $05, $00, $F8   ; 
- D 0 - I - 0x030552 0C:8542: FD        .byte $FD, $07, $00, $00   ; 
- D 0 - I - 0x030556 0C:8546: 16        .byte $16, $0B, $00, $E0   ; 
- D 0 - I - 0x03055A 0C:854A: 16        .byte $16, $31, $01, $E8   ; 
- D 0 - I - 0x03055E 0C:854E: 14        .byte $14, $0D, $00, $F2   ; 
- D 0 - I - 0x030562 0C:8552: 14        .byte $14, $0F, $00, $FA   ; 
- D 0 - I - 0x030566 0C:8556: 28        .byte $28, $11, $00, $E8   ; 
- D 0 - I - 0x03056A 0C:855A: 2A        .byte $2A, $33, $01, $F0   ; 
- D 0 - I - 0x03056E 0C:855E: 40        .byte $40, $63, $03, $D1   ; 
- D 0 - I - 0x030572 0C:8562: 6C        .byte $6C, $61, $02, $F0   ; 
- D 0 - I - 0x030576 0C:8566: 57        .byte $57, $5D, $02, $D0   ; 
- D 0 - I - 0x03057A 0C:856A: 5A        .byte $5A, $5F, $02, $D8   ; 
- D 0 - I - 0x03057E 0C:856E: 32        .byte $32, $13, $00, $D8   ; 
- D 0 - I - 0x030582 0C:8572: 60        .byte $60, $23, $00, $E0   ; 
- D 0 - I - 0x030586 0C:8576: 1D        .byte $1D, $35, $01, $08   ; 
- D 0 - I - 0x03058A 0C:857A: 2D        .byte $2D, $39, $01, $08   ; 
- D 0 - I - 0x03058E 0C:857E: 3D        .byte $3D, $15, $00, $03   ; 
- D 0 - I - 0x030592 0C:8582: 3D        .byte $3D, $17, $00, $0B   ; 
- D 0 - I - 0x030596 0C:8586: 2D        .byte $2D, $3B, $01, $10   ; 
- D 0 - I - 0x03059A 0C:858A: 1D        .byte $1D, $37, $01, $10   ; 
- D 0 - I - 0x03059E 0C:858E: 50        .byte $50, $3D, $01, $F9   ; 
- D 0 - I - 0x0305A2 0C:8592: 55        .byte $55, $3F, $01, $01   ; 
- D 0 - I - 0x0305A6 0C:8596: 56        .byte $56, $41, $01, $09   ; 
- D 0 - I - 0x0305AA 0C:859A: 58        .byte $58, $43, $01, $11   ; 
- D 0 - I - 0x0305AE 0C:859E: 60        .byte $60, $19, $00, $10   ; 
- D 0 - I - 0x0305B2 0C:85A2: 46        .byte $46, $45, $01, $20   ; 
- D 0 - I - 0x0305B6 0C:85A6: 25        .byte $25, $1D, $00, $18   ; 
- D 0 - I - 0x0305BA 0C:85AA: 30        .byte $30, $1F, $00, $22   ; 
- D 0 - I - 0x0305BE 0C:85AE: 0B        .byte $0B, $1B, $00, $15   ; 
- D 0 - I - 0x0305C2 0C:85B2: 09        .byte $09, $55, $02, $20   ; 
- D 0 - I - 0x0305C6 0C:85B6: 09        .byte $09, $57, $02, $28   ; 
- D 0 - I - 0x0305CA 0C:85BA: 12        .byte $12, $67, $03, $2B   ; 
- D 0 - I - 0x0305CE 0C:85BE: 32        .byte $32, $21, $00, $33   ; 
- D 0 - I - 0x0305D2 0C:85C2: 22        .byte $22, $69, $03, $35   ; 
- D 0 - I - 0x0305D6 0C:85C6: 22        .byte $22, $6B, $03, $3D   ; 
- D 0 - I - 0x0305DA 0C:85CA: 4B        .byte $4B, $71, $03, $30   ; 
- D 0 - I - 0x0305DE 0C:85CE: 48        .byte $48, $47, $01, $33   ; 
- D 0 - I - 0x0305E2 0C:85D2: 37        .byte $37, $6F, $03, $50   ; 
- D 0 - I - 0x0305E6 0C:85D6: 47        .byte $47, $5B, $03, $3B   ; 
- D 0 - I - 0x0305EA 0C:85DA: 59        .byte $59, $59, $03, $34   ; 
- D 0 - I - 0x0305EE 0C:85DE: 6A        .byte $6A, $85, $03, $08   ; 
- D 0 - I - 0x0305F2 0C:85E2: 68        .byte $68, $83, $03, $00   ; 
- D 0 - I - 0x0305F6 0C:85E6: 40        .byte $40, $6D, $03, $48   ; 
- D 0 - I - 0x0305FA 0C:85EA: 40        .byte $40, $65, $03, $18   ; 
@end:



_off001_85EE_25:
- D 0 - I - 0x0305FE 0C:85EE: 04        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0305FF 0C:85EF: F2        .byte $F2, $ED, $01, $F8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030603 0C:85F3: F2        .byte $F2, $EF, $01, $00   ; 
- D 0 - I - 0x030607 0C:85F7: 02        .byte $02, $F1, $01, $F8   ; 
- D 0 - I - 0x03060B 0C:85FB: 02        .byte $02, $F3, $01, $00   ; 
@end:



_off001_85FF_26:
- D 0 - I - 0x03060F 0C:85FF: 03        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030610 0C:8600: F8        .byte $F8, $F5, $01, $F3   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030614 0C:8604: F8        .byte $F8, $F7, $01, $FB   ; 
- D 0 - I - 0x030618 0C:8608: F8        .byte $F8, $F9, $01, $03   ; 
@end:



_off001_860C_27:
- D 0 - I - 0x03061C 0C:860C: 03        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03061D 0C:860D: EF        .byte $EF, $FB, $01, $F8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030621 0C:8611: FF        .byte $FF, $FD, $01, $F8   ; 
- D 0 - I - 0x030625 0C:8615: F8        .byte $F8, $FF, $01, $00   ; 
@end:



_off001_8619_28:
- D 0 - I - 0x030629 0C:8619: 09        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03062A 0C:861A: C1        .byte $C1, $CB, $02, $FB   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03062E 0C:861E: D1        .byte $D1, $CD, $02, $EF   ; 
- D 0 - I - 0x030632 0C:8622: D1        .byte $D1, $CF, $02, $F7   ; 
- D 0 - I - 0x030636 0C:8626: D1        .byte $D1, $D1, $02, $FF   ; 
- D 0 - I - 0x03063A 0C:862A: D1        .byte $D1, $D3, $02, $07   ; 
- D 0 - I - 0x03063E 0C:862E: E1        .byte $E1, $D5, $02, $F2   ; 
- D 0 - I - 0x030642 0C:8632: E1        .byte $E1, $D7, $02, $FA   ; 
- D 0 - I - 0x030646 0C:8636: E1        .byte $E1, $D9, $02, $02   ; 
- D 0 - I - 0x03064A 0C:863A: F1        .byte $F1, $DB, $02, $FC   ; 
@end:



_off001_863E_29:
- D 0 - I - 0x03064E 0C:863E: 08        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03064F 0C:863F: E1        .byte $E1, $DD, $02, $ED   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030653 0C:8643: E1        .byte $E1, $DF, $02, $F5   ; 
- D 0 - I - 0x030657 0C:8647: E1        .byte $E1, $E1, $02, $FD   ; 
- D 0 - I - 0x03065B 0C:864B: E1        .byte $E1, $E3, $02, $05   ; 
- D 0 - I - 0x03065F 0C:864F: F1        .byte $F1, $E5, $02, $ED   ; 
- D 0 - I - 0x030663 0C:8653: F1        .byte $F1, $E7, $02, $F5   ; 
- D 0 - I - 0x030667 0C:8657: F1        .byte $F1, $EB, $02, $05   ; 
- D 0 - I - 0x03066B 0C:865B: F1        .byte $F1, $E9, $02, $FD   ; 
@end:



_off001_865F_2A:
- D 0 - I - 0x03066F 0C:865F: 0A        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030670 0C:8660: D1        .byte $D1, $ED, $02, $F5   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030674 0C:8664: D1        .byte $D1, $EF, $02, $FD   ; 
- D 0 - I - 0x030678 0C:8668: D1        .byte $D1, $F1, $02, $05   ; 
- D 0 - I - 0x03067C 0C:866C: E1        .byte $E1, $F3, $02, $F5   ; 
- D 0 - I - 0x030680 0C:8670: E1        .byte $E1, $F5, $02, $FD   ; 
- D 0 - I - 0x030684 0C:8674: E1        .byte $E1, $F7, $02, $05   ; 
- D 0 - I - 0x030688 0C:8678: E9        .byte $E9, $F9, $02, $ED   ; 
- D 0 - I - 0x03068C 0C:867C: F1        .byte $F1, $FB, $02, $F5   ; 
- D 0 - I - 0x030690 0C:8680: F1        .byte $F1, $FD, $02, $FD   ; 
- D 0 - I - 0x030694 0C:8684: F1        .byte $F1, $FF, $02, $05   ; 
@end:



_off001_8688_2B:
- D 0 - I - 0x030698 0C:8688: 01        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030699 0C:8689: F7        .byte $F7, $B1, $01, $FC   ; spr_Y, spr_T, spr_A, spr_X
@end:



_off001_868D_2C:
- D 0 - I - 0x03069D 0C:868D: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03069E 0C:868E: F7        .byte $F7, $B3, $01, $F8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0306A2 0C:8692: F7        .byte $F7, $B3, $41, $00   ; 
@end:



_off001_8696_2D:
- D 0 - I - 0x0306A6 0C:8696: 08        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0306A7 0C:8697: EF        .byte $EF, $B5, $01, $F0   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0306AB 0C:869B: EF        .byte $EF, $B7, $01, $F8   ; 
- D 0 - I - 0x0306AF 0C:869F: FF        .byte $FF, $B9, $01, $F0   ; 
- D 0 - I - 0x0306B3 0C:86A3: FF        .byte $FF, $BB, $01, $F8   ; 
- D 0 - I - 0x0306B7 0C:86A7: FD        .byte $FD, $B5, $C1, $08   ; 
- D 0 - I - 0x0306BB 0C:86AB: FD        .byte $FD, $B7, $C1, $00   ; 
- D 0 - I - 0x0306BF 0C:86AF: ED        .byte $ED, $B9, $C1, $08   ; 
- D 0 - I - 0x0306C3 0C:86B3: ED        .byte $ED, $BB, $C1, $00   ; 
@end:



_off001_86B7_2E:
- D 0 - I - 0x0306C7 0C:86B7: 07        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0306C8 0C:86B8: EF        .byte $EF, $BD, $01, $F0   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0306CC 0C:86BC: EF        .byte $EF, $BF, $01, $F8   ; 
- D 0 - I - 0x0306D0 0C:86C0: FF        .byte $FF, $C1, $01, $F4   ; 
- D 0 - I - 0x0306D4 0C:86C4: FF        .byte $FF, $C3, $01, $FC   ; 
- D 0 - I - 0x0306D8 0C:86C8: FF        .byte $FF, $C1, $41, $04   ; 
- D 0 - I - 0x0306DC 0C:86CC: EF        .byte $EF, $BF, $41, $00   ; 
- D 0 - I - 0x0306E0 0C:86D0: EF        .byte $EF, $BD, $41, $08   ; 
@end:



_off001_86D4_2F:
- D 0 - I - 0x0306E4 0C:86D4: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0306E5 0C:86D5: EF        .byte $EF, $C5, $01, $F0   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0306E9 0C:86D9: EF        .byte $EF, $C7, $01, $F8   ; 
- D 0 - I - 0x0306ED 0C:86DD: EF        .byte $EF, $C5, $41, $08   ; 
- D 0 - I - 0x0306F1 0C:86E1: EF        .byte $EF, $C7, $41, $00   ; 
- D 0 - I - 0x0306F5 0C:86E5: FF        .byte $FF, $C9, $41, $00   ; 
- D 0 - I - 0x0306F9 0C:86E9: FF        .byte $FF, $C9, $01, $F8   ; 
@end:



_off001_86ED_30:
- D 0 - I - 0x0306FD 0C:86ED: 09        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0306FE 0C:86EE: 2F        .byte $2F, $1B, $02, $09   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030702 0C:86F2: 2F        .byte $2F, $1D, $02, $11   ; 
- D 0 - I - 0x030706 0C:86F6: 1C        .byte $1C, $17, $02, $1A   ; 
- D 0 - I - 0x03070A 0C:86FA: 1C        .byte $1C, $19, $02, $22   ; 
- D 0 - I - 0x03070E 0C:86FE: 08        .byte $08, $03, $00, $2C   ; 
- D 0 - I - 0x030712 0C:8702: 08        .byte $08, $05, $00, $34   ; 
- D 0 - I - 0x030716 0C:8706: 08        .byte $08, $07, $00, $3C   ; 
- D 0 - I - 0x03071A 0C:870A: 18        .byte $18, $0F, $01, $31   ; 
- D 0 - I - 0x03071E 0C:870E: 18        .byte $18, $11, $01, $39   ; 
@end:



_off001_8712_31:
- D 0 - I - 0x030722 0C:8712: 09        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030723 0C:8713: 2F        .byte $2F, $1B, $02, $09   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030727 0C:8717: 2F        .byte $2F, $1D, $02, $11   ; 
- D 0 - I - 0x03072B 0C:871B: 1C        .byte $1C, $17, $02, $1A   ; 
- D 0 - I - 0x03072F 0C:871F: 1C        .byte $1C, $19, $02, $22   ; 
- D 0 - I - 0x030733 0C:8723: 18        .byte $18, $13, $01, $31   ; 
- D 0 - I - 0x030737 0C:8727: 18        .byte $18, $15, $01, $39   ; 
- D 0 - I - 0x03073B 0C:872B: 08        .byte $08, $09, $00, $2C   ; 
- D 0 - I - 0x03073F 0C:872F: 08        .byte $08, $0B, $00, $34   ; 
- D 0 - I - 0x030743 0C:8733: 08        .byte $08, $0D, $00, $3C   ; 
@end:



_off001_8737_32:
- D 0 - I - 0x030747 0C:8737: 09        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030748 0C:8738: 2F        .byte $2F, $1B, $02, $09   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03074C 0C:873C: 2F        .byte $2F, $1D, $02, $11   ; 
- D 0 - I - 0x030750 0C:8740: 1C        .byte $1C, $17, $02, $1A   ; 
- D 0 - I - 0x030754 0C:8744: 1C        .byte $1C, $19, $02, $22   ; 
- D 0 - I - 0x030758 0C:8748: 08        .byte $08, $03, $00, $2C   ; 
- D 0 - I - 0x03075C 0C:874C: 08        .byte $08, $05, $00, $34   ; 
- D 0 - I - 0x030760 0C:8750: 08        .byte $08, $07, $00, $3C   ; 
- D 0 - I - 0x030764 0C:8754: 18        .byte $18, $0F, $01, $31   ; 
- D 0 - I - 0x030768 0C:8758: 18        .byte $18, $11, $01, $39   ; 
@end:



_off001_875C_33:
- D 0 - I - 0x03076C 0C:875C: 09        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03076D 0C:875D: 2F        .byte $2F, $1B, $02, $09   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030771 0C:8761: 2F        .byte $2F, $1D, $02, $11   ; 
- D 0 - I - 0x030775 0C:8765: 1C        .byte $1C, $17, $02, $1A   ; 
- D 0 - I - 0x030779 0C:8769: 1C        .byte $1C, $19, $02, $22   ; 
- D 0 - I - 0x03077D 0C:876D: 08        .byte $08, $03, $00, $2C   ; 
- D 0 - I - 0x030781 0C:8771: 08        .byte $08, $05, $00, $34   ; 
- D 0 - I - 0x030785 0C:8775: 08        .byte $08, $07, $00, $3C   ; 
- D 0 - I - 0x030789 0C:8779: 18        .byte $18, $13, $01, $31   ; 
- D 0 - I - 0x03078D 0C:877D: 18        .byte $18, $15, $01, $39   ; 
@end:



_off001_8781_34:
- D 0 - I - 0x030791 0C:8781: 09        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030792 0C:8782: 2F        .byte $2F, $1B, $02, $09   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030796 0C:8786: 2F        .byte $2F, $1D, $02, $11   ; 
- D 0 - I - 0x03079A 0C:878A: 1C        .byte $1C, $17, $02, $1A   ; 
- D 0 - I - 0x03079E 0C:878E: 1C        .byte $1C, $19, $02, $22   ; 
- D 0 - I - 0x0307A2 0C:8792: 18        .byte $18, $0F, $01, $31   ; 
- D 0 - I - 0x0307A6 0C:8796: 18        .byte $18, $11, $01, $39   ; 
- D 0 - I - 0x0307AA 0C:879A: 08        .byte $08, $09, $00, $2C   ; 
- D 0 - I - 0x0307AE 0C:879E: 08        .byte $08, $0B, $00, $34   ; 
- D 0 - I - 0x0307B2 0C:87A2: 08        .byte $08, $0D, $00, $3C   ; 
@end:



_off001_87A6_35:
- D 0 - I - 0x0307B6 0C:87A6: 09        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0307B7 0C:87A7: 2F        .byte $2F, $1B, $02, $09   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0307BB 0C:87AB: 2F        .byte $2F, $1D, $02, $11   ; 
- D 0 - I - 0x0307BF 0C:87AF: 1C        .byte $1C, $17, $02, $1A   ; 
- D 0 - I - 0x0307C3 0C:87B3: 1C        .byte $1C, $19, $02, $22   ; 
- D 0 - I - 0x0307C7 0C:87B7: 08        .byte $08, $03, $00, $2C   ; 
- D 0 - I - 0x0307CB 0C:87BB: 08        .byte $08, $05, $00, $34   ; 
- D 0 - I - 0x0307CF 0C:87BF: 08        .byte $08, $07, $00, $3C   ; 
- D 0 - I - 0x0307D3 0C:87C3: 18        .byte $18, $13, $01, $31   ; 
- D 0 - I - 0x0307D7 0C:87C7: 18        .byte $18, $15, $01, $39   ; 
@end:



_off001_87CB_36:
- D 0 - I - 0x0307DB 0C:87CB: 0A        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0307DC 0C:87CC: 1D        .byte $1D, $4F, $00, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0307E0 0C:87D0: 2D        .byte $2D, $51, $00, $00   ; 
- D 0 - I - 0x0307E4 0C:87D4: 18        .byte $18, $53, $00, $08   ; 
- D 0 - I - 0x0307E8 0C:87D8: 28        .byte $28, $55, $00, $08   ; 
- D 0 - I - 0x0307EC 0C:87DC: 1B        .byte $1B, $57, $00, $10   ; 
- D 0 - I - 0x0307F0 0C:87E0: 20        .byte $20, $5D, $00, $18   ; 
- D 0 - I - 0x0307F4 0C:87E4: 18        .byte $18, $5F, $00, $20   ; 
- D 0 - I - 0x0307F8 0C:87E8: 10        .byte $10, $61, $00, $30   ; 
- D 0 - I - 0x0307FC 0C:87EC: 31        .byte $31, $59, $00, $1B   ; 
- D 0 - I - 0x030800 0C:87F0: 31        .byte $31, $5B, $00, $23   ; 
@end:



_off001_87F4_37:
- D 0 - I - 0x030804 0C:87F4: 09        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030805 0C:87F5: 10        .byte $10, $65, $00, $20   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030809 0C:87F9: 21        .byte $21, $63, $00, $21   ; 
- D 0 - I - 0x03080D 0C:87FD: 1D        .byte $1D, $4F, $00, $00   ; 
- D 0 - I - 0x030811 0C:8801: 2D        .byte $2D, $51, $00, $00   ; 
- D 0 - I - 0x030815 0C:8805: 18        .byte $18, $53, $00, $08   ; 
- D 0 - I - 0x030819 0C:8809: 28        .byte $28, $55, $00, $08   ; 
- D 0 - I - 0x03081D 0C:880D: 1B        .byte $1B, $57, $00, $10   ; 
- D 0 - I - 0x030821 0C:8811: 31        .byte $31, $59, $00, $1B   ; 
- D 0 - I - 0x030825 0C:8815: 31        .byte $31, $5B, $00, $23   ; 
@end:



_off001_8819_38:
- D 0 - I - 0x030829 0C:8819: 07        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03082A 0C:881A: 08        .byte $08, $29, $00, $10   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03082E 0C:881E: 0B        .byte $0B, $2B, $00, $18   ; 
- D 0 - I - 0x030832 0C:8822: 04        .byte $04, $2D, $00, $20   ; 
- D 0 - I - 0x030836 0C:8826: 18        .byte $18, $2F, $00, $10   ; 
- D 0 - I - 0x03083A 0C:882A: 1B        .byte $1B, $31, $00, $18   ; 
- D 0 - I - 0x03083E 0C:882E: 14        .byte $14, $33, $00, $20   ; 
- D 0 - I - 0x030842 0C:8832: 24        .byte $24, $35, $00, $20   ; 
@end:



_off001_8836_39:
- - - - - - 0x030846 0C:8836: 07        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- - - - - - 0x030847 0C:8837: 08        .byte $08, $37, $00, $10   ; spr_Y, spr_T, spr_A, spr_X
- - - - - - 0x03084B 0C:883B: 08        .byte $08, $39, $00, $18   ; 
- - - - - - 0x03084F 0C:883F: 18        .byte $18, $3B, $00, $10   ; 
- - - - - - 0x030853 0C:8843: 18        .byte $18, $3D, $00, $18   ; 
- - - - - - 0x030857 0C:8847: 04        .byte $04, $2D, $00, $20   ; 
- - - - - - 0x03085B 0C:884B: 14        .byte $14, $3F, $00, $20   ; 
- - - - - - 0x03085F 0C:884F: 24        .byte $24, $35, $00, $20   ; 
@end:



_off001_8853_3A:
- D 0 - I - 0x030863 0C:8853: 11        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030864 0C:8854: 00        .byte $00, $0D, $00, $18   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030868 0C:8858: 00        .byte $00, $0F, $00, $20   ; 
- D 0 - I - 0x03086C 0C:885C: 00        .byte $00, $11, $00, $28   ; 
- D 0 - I - 0x030870 0C:8860: 00        .byte $00, $13, $00, $30   ; 
- D 0 - I - 0x030874 0C:8864: 00        .byte $00, $15, $00, $38   ; 
- D 0 - I - 0x030878 0C:8868: 10        .byte $10, $17, $00, $10   ; 
- D 0 - I - 0x03087C 0C:886C: 10        .byte $10, $19, $00, $18   ; 
- D 0 - I - 0x030880 0C:8870: 10        .byte $10, $1B, $00, $20   ; 
- D 0 - I - 0x030884 0C:8874: 10        .byte $10, $1D, $00, $28   ; 
- D 0 - I - 0x030888 0C:8878: 10        .byte $10, $1F, $00, $30   ; 
- D 0 - I - 0x03088C 0C:887C: 20        .byte $20, $21, $00, $31   ; 
- D 0 - I - 0x030890 0C:8880: 20        .byte $20, $23, $00, $39   ; 
- D 0 - I - 0x030894 0C:8884: 30        .byte $30, $25, $00, $0A   ; 
- D 0 - I - 0x030898 0C:8888: 36        .byte $36, $27, $00, $1E   ; 
- D 0 - I - 0x03089C 0C:888C: 36        .byte $36, $29, $00, $26   ; 
- D 0 - I - 0x0308A0 0C:8890: 36        .byte $36, $2B, $00, $2E   ; 
- D 0 - I - 0x0308A4 0C:8894: 30        .byte $30, $2D, $00, $36   ; 
@end:



_off001_8898_3B:
- D 0 - I - 0x0308A8 0C:8898: 10        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0308A9 0C:8899: 10        .byte $10, $2F, $00, $10   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0308AD 0C:889D: 08        .byte $08, $31, $00, $18   ; 
- D 0 - I - 0x0308B1 0C:88A1: 00        .byte $00, $0F, $00, $20   ; 
- D 0 - I - 0x0308B5 0C:88A5: 00        .byte $00, $11, $00, $28   ; 
- D 0 - I - 0x0308B9 0C:88A9: 00        .byte $00, $13, $00, $30   ; 
- D 0 - I - 0x0308BD 0C:88AD: 00        .byte $00, $15, $00, $38   ; 
- D 0 - I - 0x0308C1 0C:88B1: 10        .byte $10, $1D, $00, $28   ; 
- D 0 - I - 0x0308C5 0C:88B5: 10        .byte $10, $1F, $00, $30   ; 
- D 0 - I - 0x0308C9 0C:88B9: 20        .byte $20, $21, $00, $31   ; 
- D 0 - I - 0x0308CD 0C:88BD: 20        .byte $20, $23, $00, $39   ; 
- D 0 - I - 0x0308D1 0C:88C1: 30        .byte $30, $25, $00, $0A   ; 
- D 0 - I - 0x0308D5 0C:88C5: 36        .byte $36, $27, $00, $1E   ; 
- D 0 - I - 0x0308D9 0C:88C9: 36        .byte $36, $29, $00, $26   ; 
- D 0 - I - 0x0308DD 0C:88CD: 36        .byte $36, $2B, $00, $2E   ; 
- D 0 - I - 0x0308E1 0C:88D1: 30        .byte $30, $2D, $00, $36   ; 
- D 0 - I - 0x0308E5 0C:88D5: 10        .byte $10, $33, $00, $20   ; 
@end:



_off001_88D9_3C:
- D 0 - I - 0x0308E9 0C:88D9: 0D        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0308EA 0C:88DA: 10        .byte $10, $31, $00, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0308EE 0C:88DE: 20        .byte $20, $35, $00, $00   ; 
- D 0 - I - 0x0308F2 0C:88E2: 18        .byte $18, $33, $00, $08   ; 
- D 0 - I - 0x0308F6 0C:88E6: 10        .byte $10, $47, $00, $14   ; 
- D 0 - I - 0x0308FA 0C:88EA: 10        .byte $10, $49, $00, $1C   ; 
- D 0 - I - 0x0308FE 0C:88EE: 30        .byte $30, $37, $00, $04   ; 
- D 0 - I - 0x030902 0C:88F2: 30        .byte $30, $39, $00, $0C   ; 
- D 0 - I - 0x030906 0C:88F6: 30        .byte $30, $3B, $00, $14   ; 
- D 0 - I - 0x03090A 0C:88FA: 2E        .byte $2E, $3D, $00, $1C   ; 
- D 0 - I - 0x03090E 0C:88FE: 20        .byte $20, $3F, $00, $24   ; 
- D 0 - I - 0x030912 0C:8902: 30        .byte $30, $41, $00, $24   ; 
- D 0 - I - 0x030916 0C:8906: 2A        .byte $2A, $43, $00, $2C   ; 
- D 0 - I - 0x03091A 0C:890A: 30        .byte $30, $45, $00, $38   ; 
@end:



_off001_890E_3D:
- - - - - - 0x03091E 0C:890E: 0A        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- - - - - - 0x03091F 0C:890F: 10        .byte $10, $4B, $00, $13   ; spr_Y, spr_T, spr_A, spr_X
- - - - - - 0x030923 0C:8913: 10        .byte $10, $4D, $00, $1B   ; 
- - - - - - 0x030927 0C:8917: 30        .byte $30, $37, $00, $04   ; 
- - - - - - 0x03092B 0C:891B: 30        .byte $30, $39, $00, $0C   ; 
- - - - - - 0x03092F 0C:891F: 30        .byte $30, $3B, $00, $14   ; 
- - - - - - 0x030933 0C:8923: 2E        .byte $2E, $3D, $00, $1C   ; 
- - - - - - 0x030937 0C:8927: 20        .byte $20, $3F, $00, $24   ; 
- - - - - - 0x03093B 0C:892B: 30        .byte $30, $41, $00, $24   ; 
- - - - - - 0x03093F 0C:892F: 2A        .byte $2A, $43, $00, $2C   ; 
- - - - - - 0x030943 0C:8933: 30        .byte $30, $45, $00, $38   ; 
@end:



_off001_8937_3E:
- - - - - - 0x030947 0C:8937: 05        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- - - - - - 0x030948 0C:8938: 00        .byte $00, $21, $00, $00   ; spr_Y, spr_T, spr_A, spr_X
- - - - - - 0x03094C 0C:893C: 00        .byte $00, $23, $00, $08   ; 
- - - - - - 0x030950 0C:8940: 00        .byte $00, $25, $00, $10   ; 
- - - - - - 0x030954 0C:8944: 00        .byte $00, $27, $00, $18   ; 
- - - - - - 0x030958 0C:8948: 00        .byte $00, $29, $00, $20   ; 
@end:



_off001_894C_40:
- - - - - - 0x03095C 0C:894C: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- - - - - - 0x03095D 0C:894D: 00        .byte $00, $2D, $00, $00   ; spr_Y, spr_T, spr_A, spr_X
- - - - - - 0x030961 0C:8951: 00        .byte $00, $2F, $00, $08   ; 
@end:



_off001_8955_41:
- - - - - - 0x030965 0C:8955: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- - - - - - 0x030966 0C:8956: 00        .byte $00, $31, $00, $00   ; spr_Y, spr_T, spr_A, spr_X
- - - - - - 0x03096A 0C:895A: 00        .byte $00, $31, $00, $08   ; 
@end:



_off001_895E_43:
- D 0 - I - 0x03096E 0C:895E: 04        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03096F 0C:895F: 00        .byte $00, $2B, $00, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030973 0C:8963: 00        .byte $00, $2D, $00, $08   ; 
- D 0 - I - 0x030977 0C:8967: 00        .byte $00, $2F, $00, $10   ; 
- D 0 - I - 0x03097B 0C:896B: 00        .byte $00, $31, $00, $18   ; 
@end:



_off001_896F_3F:
- - - - - - 0x03097F 0C:896F: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- - - - - - 0x030980 0C:8970: 00        .byte $00, $33, $00, $00   ; spr_Y, spr_T, spr_A, spr_X
- - - - - - 0x030984 0C:8974: 00        .byte $00, $35, $00, $08   ; 
@end:



_off001_8978_42:
- - - - - - 0x030988 0C:8978: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- - - - - - 0x030989 0C:8979: 00        .byte $00, $37, $00, $00   ; spr_Y, spr_T, spr_A, spr_X
- - - - - - 0x03098D 0C:897D: 00        .byte $00, $39, $00, $08   ; 
@end:



_off001_8981_44:
- D 0 - I - 0x030991 0C:8981: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030992 0C:8982: F7        .byte $F7, $21, $00, $F8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030996 0C:8986: F7        .byte $F7, $23, $00, $00   ; 
@end:



_off001_898A_45:
- D 0 - I - 0x03099A 0C:898A: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x03099B 0C:898B: F6        .byte $F6, $21, $00, $F8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x03099F 0C:898F: F6        .byte $F6, $23, $00, $00   ; 
@end:



_off001_8993_47:
- D 0 - I - 0x0309A3 0C:8993: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0309A4 0C:8994: F6        .byte $F6, $25, $00, $F9   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0309A8 0C:8998: F6        .byte $F6, $27, $00, $01   ; 
@end:



_off001_899C_46:
- D 0 - I - 0x0309AC 0C:899C: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0309AD 0C:899D: F7        .byte $F7, $25, $00, $F9   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0309B1 0C:89A1: F7        .byte $F7, $27, $00, $01   ; 
@end:



_off001_89A5_48:
- D 0 - I - 0x0309B5 0C:89A5: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0309B6 0C:89A6: F7        .byte $F7, $29, $00, $F8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0309BA 0C:89AA: F7        .byte $F7, $2B, $00, $00   ; 
@end:



_off001_89AE_49:
- D 0 - I - 0x0309BE 0C:89AE: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0309BF 0C:89AF: F6        .byte $F6, $29, $00, $F8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0309C3 0C:89B3: F6        .byte $F6, $2B, $00, $00   ; 
@end:



_off001_89B7_4B:
- D 0 - I - 0x0309C7 0C:89B7: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0309C8 0C:89B8: F5        .byte $F5, $2D, $00, $F8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0309CC 0C:89BC: F5        .byte $F5, $2F, $00, $00   ; 
@end:



_off001_89C0_4A:
- D 0 - I - 0x0309D0 0C:89C0: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0309D1 0C:89C1: F6        .byte $F6, $2D, $00, $F8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0309D5 0C:89C5: F6        .byte $F6, $2F, $00, $00   ; 
@end:



_off001_89C9_4C:
- D 0 - I - 0x0309D9 0C:89C9: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0309DA 0C:89CA: F7        .byte $F7, $31, $01, $F8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0309DE 0C:89CE: F7        .byte $F7, $33, $01, $00   ; 
@end:



_off001_89D2_4D:
- D 0 - I - 0x0309E2 0C:89D2: 0E        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x0309E3 0C:89D3: 00        .byte $00, $2B, $00, $18   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x0309E7 0C:89D7: 00        .byte $00, $2D, $00, $20   ; 
- D 0 - I - 0x0309EB 0C:89DB: 3C        .byte $3C, $2F, $01, $46   ; 
- D 0 - I - 0x0309EF 0C:89DF: 41        .byte $41, $2F, $01, $3D   ; 
- D 0 - I - 0x0309F3 0C:89E3: 46        .byte $46, $2F, $01, $34   ; 
- D 0 - I - 0x0309F7 0C:89E7: 3D        .byte $3D, $2F, $01, $2C   ; 
- D 0 - I - 0x0309FB 0C:89EB: 4B        .byte $4B, $2F, $01, $27   ; 
- D 0 - I - 0x0309FF 0C:89EF: 42        .byte $42, $2F, $01, $1D   ; 
- D 0 - I - 0x030A03 0C:89F3: 51        .byte $51, $2F, $01, $18   ; 
- D 0 - I - 0x030A07 0C:89F7: 47        .byte $47, $2F, $01, $0F   ; 
- D 0 - I - 0x030A0B 0C:89FB: 56        .byte $56, $2F, $01, $09   ; 
- D 0 - I - 0x030A0F 0C:89FF: 4C        .byte $4C, $2F, $01, $01   ; 
- D 0 - I - 0x030A13 0C:8A03: 51        .byte $51, $2F, $01, $F2   ; 
- D 0 - I - 0x030A17 0C:8A07: 56        .byte $56, $2F, $01, $E2   ; 
@end:



_off001_8A0B_4E:
- D 0 - I - 0x030A1B 0C:8A0B: 0A        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030A1C 0C:8A0C: 1A        .byte $1A, $19, $01, $D7   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030A20 0C:8A10: 18        .byte $18, $19, $01, $E8   ; 
- D 0 - I - 0x030A24 0C:8A14: 08        .byte $08, $1B, $01, $18   ; 
- D 0 - I - 0x030A28 0C:8A18: 40        .byte $40, $1D, $00, $D0   ; 
- D 0 - I - 0x030A2C 0C:8A1C: 40        .byte $40, $1F, $00, $D8   ; 
- D 0 - I - 0x030A30 0C:8A20: 48        .byte $48, $21, $00, $E0   ; 
- D 0 - I - 0x030A34 0C:8A24: 50        .byte $50, $23, $00, $E8   ; 
- D 0 - I - 0x030A38 0C:8A28: 40        .byte $40, $25, $00, $E8   ; 
- D 0 - I - 0x030A3C 0C:8A2C: 40        .byte $40, $27, $00, $F0   ; 
- D 0 - I - 0x030A40 0C:8A30: 40        .byte $40, $29, $00, $F8   ; 
@end:



_off001_8A34_4F:
- D 0 - I - 0x030A44 0C:8A34: 08        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030A45 0C:8A35: DF        .byte $DF, $31, $00, $F4   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030A49 0C:8A39: FD        .byte $FD, $33, $00, $EE   ; 
- D 0 - I - 0x030A4D 0C:8A3D: F5        .byte $F5, $35, $00, $F6   ; 
- D 0 - I - 0x030A51 0C:8A41: ED        .byte $ED, $37, $00, $FE   ; 
- D 0 - I - 0x030A55 0C:8A45: ED        .byte $ED, $39, $00, $06   ; 
- D 0 - I - 0x030A59 0C:8A49: FD        .byte $FD, $3B, $00, $FE   ; 
- D 0 - I - 0x030A5D 0C:8A4D: FD        .byte $FD, $3D, $00, $06   ; 
- D 0 - I - 0x030A61 0C:8A51: 0D        .byte $0D, $3F, $00, $02   ; 
@end:



_off001_8A55_50:
- D 0 - I - 0x030A65 0C:8A55: 04        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030A66 0C:8A56: E9        .byte $E9, $31, $00, $F7   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030A6A 0C:8A5A: EB        .byte $EB, $33, $00, $FF   ; 
- D 0 - I - 0x030A6E 0C:8A5E: F9        .byte $F9, $35, $00, $F7   ; 
- D 0 - I - 0x030A72 0C:8A62: FB        .byte $FB, $37, $00, $FF   ; 
@end:



_off001_8A66_51:
- D 0 - I - 0x030A76 0C:8A66: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030A77 0C:8A67: F3        .byte $F3, $35, $00, $F4   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030A7B 0C:8A6B: E9        .byte $E9, $37, $00, $FC   ; 
- D 0 - I - 0x030A7F 0C:8A6F: E9        .byte $E9, $39, $00, $04   ; 
- D 0 - I - 0x030A83 0C:8A73: F9        .byte $F9, $3B, $00, $FC   ; 
- D 0 - I - 0x030A87 0C:8A77: F9        .byte $F9, $3D, $00, $04   ; 
- D 0 - I - 0x030A8B 0C:8A7B: 09        .byte $09, $3F, $00, $F8   ; 
@end:



_off001_8A7F_52:
- D 0 - I - 0x030A8F 0C:8A7F: 07        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030A90 0C:8A80: F4        .byte $F4, $33, $00, $E8   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030A94 0C:8A84: 04        .byte $04, $35, $00, $E8   ; 
- D 0 - I - 0x030A98 0C:8A88: ED        .byte $ED, $37, $00, $F0   ; 
- D 0 - I - 0x030A9C 0C:8A8C: FD        .byte $FD, $39, $00, $F0   ; 
- D 0 - I - 0x030AA0 0C:8A90: 0D        .byte $0D, $3B, $00, $F0   ; 
- D 0 - I - 0x030AA4 0C:8A94: F5        .byte $F5, $3D, $00, $F8   ; 
- D 0 - I - 0x030AA8 0C:8A98: 0D        .byte $0D, $3F, $00, $F9   ; 
@end:



_off001_8A9C_53:
- D 0 - I - 0x030AAC 0C:8A9C: 06        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030AAD 0C:8A9D: D5        .byte $D5, $27, $00, $FB   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030AB1 0C:8AA1: D5        .byte $D5, $29, $00, $03   ; 
- D 0 - I - 0x030AB5 0C:8AA5: E5        .byte $E5, $2B, $00, $F8   ; 
- D 0 - I - 0x030AB9 0C:8AA9: ED        .byte $ED, $2D, $00, $F0   ; 
- D 0 - I - 0x030ABD 0C:8AAD: F6        .byte $F6, $2F, $00, $E0   ; 
- D 0 - I - 0x030AC1 0C:8AB1: F6        .byte $F6, $31, $00, $E8   ; 
@end:



_off001_8AB5_54:
- D 0 - I - 0x030AC5 0C:8AB5: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030AC6 0C:8AB6: 15        .byte $15, $23, $00, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030ACA 0C:8ABA: 15        .byte $15, $25, $00, $08   ; 
@end:



_off001_8ABE_55:
- D 0 - I - 0x030ACE 0C:8ABE: 02        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030ACF 0C:8ABF: F8        .byte $F8, $71, $02, $F9   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030AD3 0C:8AC3: F8        .byte $F8, $73, $02, $01   ; 
@end:



_off001_8AC7_56:
- D 0 - I - 0x030AD7 0C:8AC7: 01        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030AD8 0C:8AC8: F8        .byte $F8, $75, $02, $FD   ; spr_Y, spr_T, spr_A, spr_X
@end:



_off001_8ACC_57:
- D 0 - I - 0x030ADC 0C:8ACC: 01        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030ADD 0C:8ACD: F8        .byte $F8, $77, $02, $FD   ; spr_Y, spr_T, spr_A, spr_X
@end:



_off001_8AD1_58:
- D 0 - I - 0x030AE1 0C:8AD1: 01        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030AE2 0C:8AD2: F8        .byte $F8, $79, $02, $FD   ; spr_Y, spr_T, spr_A, spr_X
@end:



_off001_8AD6_59:
- D 0 - I - 0x030AE6 0C:8AD6: 04        .byte (@end - * - $01) / $04 ; счетчик спрайтов
- D 0 - I - 0x030AE7 0C:8AD7: F8        .byte $F8, $43, $03, $00   ; spr_Y, spr_T, spr_A, spr_X
- D 0 - I - 0x030AEB 0C:8ADB: F8        .byte $F8, $43, $43, $28   ; 
- D 0 - I - 0x030AEF 0C:8ADF: 00        .byte $00, $5F, $03, $10   ; 
- D 0 - I - 0x030AF3 0C:8AE3: 00        .byte $00, $61, $03, $18   ; 
@end:



_off014_8AF8_30_off:
- D 0 - I - 0x030B08 0C:8AF8: 74 20     .word $2474
- D 0 - I - 0x030B0A 0C:8AFA: 99        .byte $99, $90, $90   ; OFF

- D 0 - I - 0x030B10 0C:8B00: FF        .byte $FF   ; end token



_off014_8B01_31_on:
; bzk optimize, лишние пробелы в конце
- D 0 - I - 0x030B11 0C:8B01: 74 20     .word $2474
- D 0 - I - 0x030B13 0C:8B03: 99        .byte $99, $98, $00   ; ON

- D 0 - I - 0x030B19 0C:8B09: FF        .byte $FF   ; end token



_off014_8B0A_32_off:
; bzk optimize, лишние пробелы в конце
- D 0 - I - 0x030B1A 0C:8B0A: B4 20     .word $24B4
- D 0 - I - 0x030B1C 0C:8B0C: 99        .byte $99, $90, $90   ; OFF

- D 0 - I - 0x030B24 0C:8B14: FF        .byte $FF   ; end token



_off014_8B15_33_on:
- D 0 - I - 0x030B25 0C:8B15: B4 20     .word $24B4
- D 0 - I - 0x030B27 0C:8B17: 99        .byte $99, $98, $00   ; ON

- D 0 - I - 0x030B2F 0C:8B1F: FF        .byte $FF   ; end token



_off014_8BAD_36_losermix:
- D 0 - I - 0x030BBD 0C:8BAD: 34 21     .word $2534
- D 0 - I - 0x030BBF 0C:8BAF: 96        .byte $96, $99, $9D, $8F, $9C, $97, $93, $A2   ; LOSERMIX

- D 0 - I - 0x030BC7 0C:8BB7: FF        .byte $FF   ; end token



_off014_8BB8_35_loser:
- D 0 - I - 0x030BC8 0C:8BB8: 34 21     .word $2534
- D 0 - I - 0x030BCA 0C:8BBA: 96        .byte $96, $99, $9D, $8F, $9C, $00, $00, $00   ; LOSER

- D 0 - I - 0x030BD2 0C:8BC2: FF        .byte $FF   ; end token



_off014_8BC3_37_winner:
- D 0 - I - 0x030BD3 0C:8BC3: 34 21     .word $2534
- D 0 - I - 0x030BD5 0C:8BC5: A1        .byte $A1, $93, $98, $98, $8F, $9C, $00, $00   ; WINNER

- D 0 - I - 0x030BDD 0C:8BCD: FF        .byte $FF   ; end token



_off014_8BCE_38_survival:
- D 0 - I - 0x030BDE 0C:8BCE: 34 21     .word $2534
- D 0 - I - 0x030BE0 0C:8BD0: 9D        .byte $9D, $9F, $9C, $A0, $93, $A0, $8B, $96   ; SURVIVAL

- D 0 - I - 0x030BE8 0C:8BD8: FF        .byte $FF   ; end token



_off014_8BD9_34_no_one:
- D 0 - I - 0x030BE9 0C:8BD9: 34 21     .word $2534
- D 0 - I - 0x030BEB 0C:8BDB: 98        .byte $98, $99, $00, $99, $98, $8F, $00, $00   ; NO ONE

- D 0 - I - 0x030BF3 0C:8BE3: FF        .byte $FF   ; end token



tbl_8C00:
; bzk garbage, проверить чтоб нигде не было лишних пробелов в конце, если это не необходимо
; также проверить чтобы все пробелы были 00 а не 80
- D 0 - - - 0x030C10 0C:8C00: 1A 81     .word _off014_811A_00_story
- D 0 - - - 0x030C12 0C:8C02: 22 81     .word _off014_8122_01_vs_player
- D 0 - - - 0x030C14 0C:8C04: 2E 81     .word _off014_812E_02_vs_cpu
- D 0 - - - 0x030C16 0C:8C06: 37 81     .word _off014_8137_03_vs_team
- D 0 - - - 0x030C18 0C:8C08: 41 81     .word _off014_8141_04_tournament
- D 0 - - - 0x030C1A 0C:8C0A: 4E 81     .word _off014_814E_05_option
- D 0 - - - 0x030C1C 0C:8C0C: 57 81     .word _off014_8157_06_game_over
- D 0 - - - 0x030C1E 0C:8C0E: 66 81     .word _off014_8166_07_continue
- D 0 - - - 0x030C20 0C:8C10: 0B 82     .word _off014_820B_08_bonus_game
- D 0 - - - 0x030C22 0C:8C12: 74 81     .word _off014_8174_09_easy
- D 0 - - - 0x030C24 0C:8C14: 7D 81     .word _off014_817D_0A_normal
- D 0 - - - 0x030C26 0C:8C16: 86 81     .word _off014_8186_0B_hard
- D 0 - - - 0x030C28 0C:8C18: 2C 82     .word _off014_822C_0C_expert
- D 0 - - - 0x030C2A 0C:8C1A: 18 82     .word _off014_8218_0D_time_bonus_game
- - - - - - 0x030C2C 0C:8C1C: A1 81     .word _off014_81A1_0E_winner
- - - - - - 0x030C2E 0C:8C1E: AA 81     .word _off014_81AA_0F_player1_player2
- - - - - - 0x030C30 0C:8C20: FF FF     .word $FFFF      ; 10 индекс не существует
- D 0 - - - 0x030C32 0C:8C22: BE 81     .word _off014_81BE_11
- D 0 - - - 0x030C34 0C:8C24: CB 81     .word _off014_81CB_12_cpu
- D 0 - - - 0x030C36 0C:8C26: 8F 81     .word _off014_818F_13_normal
- D 0 - - - 0x030C38 0C:8C28: 98 81     .word _off014_8198_14_turbo
- D 0 - - - 0x030C3A 0C:8C2A: D6 81     .word _off014_81D6_15_bonus
- D 0 - - - 0x030C3C 0C:8C2C: E3 81     .word _off014_81E3_16_time
- D 0 - - - 0x030C3E 0C:8C2E: EA 81     .word _off014_81EA_17_perfect
- D 0 - - - 0x030C40 0C:8C30: F4 81     .word _off014_81F4_18_life
- D 0 - - - 0x030C42 0C:8C32: FB 81     .word _off014_81FB_19_rematch
- D 0 - - - 0x030C44 0C:8C34: 05 82     .word _off014_8205_1A_end
- D 0 - - - 0x030C46 0C:8C36: 1D B0     .word _off014_B01D_1B_100
- D 0 - - - 0x030C48 0C:8C38: 24 B0     .word _off014_B024_1C_150
- D 0 - - - 0x030C4A 0C:8C3A: 2B B0     .word _off014_B02B_1D_200
- D 0 - - - 0x030C4C 0C:8C3C: 32 B0     .word _off014_B032_1E_бесконечность
- D 0 - - - 0x030C4E 0C:8C3E: F1 AF     .word _off014_AFF1_1F_45
- D 0 - - - 0x030C50 0C:8C40: FC AF     .word _off014_AFFC_20_60
- D 0 - - - 0x030C52 0C:8C42: 07 B0     .word _off014_B007_21_99
- D 0 - - - 0x030C54 0C:8C44: 12 B0     .word _off014_B012_22_бесконечность
- D 0 - - - 0x030C56 0C:8C46: 39 B0     .word _off014_B039_23_green
- D 0 - - - 0x030C58 0C:8C48: 44 B0     .word _off014_B044_24_original
- D 0 - - - 0x030C5A 0C:8C4A: 4F B0     .word _off014_B04F_25_night
- D 0 - - - 0x030C5C 0C:8C4C: 20 8B     .word $FFFF      ; 26 индекс не существует
- D 0 - - - 0x030C5E 0C:8C4E: 2D 8B     .word $FFFF      ; 27 индекс не существует
- D 0 - - - 0x030C60 0C:8C50: 3A 8B     .word $FFFF      ; 28 индекс не существует
- D 0 - - - 0x030C62 0C:8C52: 42 8B     .word $FFFF      ; 29 индекс не существует
- D 0 - - - 0x030C64 0C:8C54: 52 8B     .word $FFFF      ; 2A индекс не существует
- D 0 - - - 0x030C66 0C:8C56: 62 8B     .word $FFFF      ; 2B индекс не существует
- D 0 - - - 0x030C68 0C:8C58: 6F 8B     .word $FFFF      ; 2C индекс не существует
- D 0 - - - 0x030C6A 0C:8C5A: 7C 8B     .word $FFFF      ; 2D индекс не существует
- D 0 - - - 0x030C6C 0C:8C5C: 84 8B     .word $FFFF      ; 2E индекс не существует
- D 0 - - - 0x030C6E 0C:8C5E: 98 8B     .word $FFFF      ; 2F индекс не существует
- D 0 - - - 0x030C70 0C:8C60: F8 8A     .word _off014_8AF8_30_off
- D 0 - - - 0x030C72 0C:8C62: 01 8B     .word _off014_8B01_31_on
- D 0 - - - 0x030C74 0C:8C64: 0A 8B     .word _off014_8B0A_32_off
- D 0 - - - 0x030C76 0C:8C66: 15 8B     .word _off014_8B15_33_on
- D 0 - - - 0x030C78 0C:8C68: D9 8B     .word _off014_8BD9_34_no_one
- D 0 - - - 0x030C7A 0C:8C6A: B8 8B     .word _off014_8BB8_35_loser
- D 0 - - - 0x030C7C 0C:8C6C: AD 8B     .word _off014_8BAD_36_losermix
- D 0 - - - 0x030C7E 0C:8C6E: C3 8B     .word _off014_8BC3_37_winner
- D 0 - - - 0x030C80 0C:8C70: CE 8B     .word _off014_8BCE_38_survival
                                        .word $FFFF      ; 39 индекс не существует
                                        .word $FFFF      ; 3A индекс не существует
                                        .word $FFFF      ; 3B индекс не существует
                                        .word $FFFF      ; 3C индекс не существует
                                        .word $FFFF      ; 3D индекс не существует
                                        .word $FFFF      ; 3E индекс не существует
                                        .word $FFFF      ; 3F индекс не существует
                                        .word _off014_8FD0_40_bgm1
                                        .word _off014_8FD0_41_bgm2
                                        .word _off014_8FD0_42_bgm3
                                        .word _off014_8FD0_43_bgm4
                                        .word _off014_8FD0_44_open1
                                        .word _off014_8FD0_45_open2
                                        .word _off014_8FD0_46_se1
                                        .word _off014_8FD0_47_se2
                                        .word _off014_8FD0_48_se3
                                        .word _off014_8FD0_49_se4
                                        .word _off014_8FD0_4A_se5
                                        .word _off014_8FD0_4B_se6
                                        .word _off014_8FD0_4C_se7
                                        .word _off014_8FD0_4D_se8
                                        .word _off014_8FD0_4E_se9
                                        .word _off014_8FD0_4F_se10
                                        .word _off014_8FD0_50_se11
                                        .word _off014_8FD0_51_se12



_off014_8FD0_40_bgm1:
                                        .word $24F4
                                        .byte $8C, $91, $97, $82, $80   ; BGM1
                                        
                                        .byte $FF   ; end token



_off014_8FD0_41_bgm2:
                                        .word $24F4
                                        .byte $8C, $91, $97, $83, $80   ; BGM2
                                        
                                        .byte $FF   ; end token



_off014_8FD0_42_bgm3:
                                        .word $24F4
                                        .byte $8C, $91, $97, $84, $80   ; BGM3
                                        
                                        .byte $FF   ; end token



_off014_8FD0_43_bgm4:
                                        .word $24F4
                                        .byte $8C, $91, $97, $85, $80   ; BGM4
                                        
                                        .byte $FF   ; end token



_off014_8FD0_44_open1:
                                        .word $24F4
                                        .byte $99, $9A, $8F, $98, $82   ; OPEN1
                                        
                                        .byte $FF   ; end token



_off014_8FD0_45_open2:
                                        .word $24F4
                                        .byte $99, $9A, $8F, $98, $83   ; OPEN2
                                        
                                        .byte $FF   ; end token



_off014_8FD0_46_se1:
                                        .word $24F4
                                        .byte $9D, $8F, $82, $80, $80   ; SE1
                                        
                                        .byte $FF   ; end token



_off014_8FD0_47_se2:
                                        .word $24F4
                                        .byte $9D, $8F, $83, $80, $80   ; SE2
                                        
                                        .byte $FF   ; end token



_off014_8FD0_48_se3:
                                        .word $24F4
                                        .byte $9D, $8F, $84, $80, $80   ; SE3
                                        
                                        .byte $FF   ; end token



_off014_8FD0_49_se4:
                                        .word $24F4
                                        .byte $9D, $8F, $85, $80, $80   ; SE4
                                        
                                        .byte $FF   ; end token



_off014_8FD0_4A_se5:
                                        .word $24F4
                                        .byte $9D, $8F, $86, $80, $80   ; SE5
                                        
                                        .byte $FF   ; end token



_off014_8FD0_4B_se6:
                                        .word $24F4
                                        .byte $9D, $8F, $87, $80, $80   ; SE6
                                        
                                        .byte $FF   ; end token



_off014_8FD0_4C_se7:
                                        .word $24F4
                                        .byte $9D, $8F, $88, $80, $80   ; SE7
                                        
                                        .byte $FF   ; end token



_off014_8FD0_4D_se8:
                                        .word $24F4
                                        .byte $9D, $8F, $89, $80, $80   ; SE8
                                        
                                        .byte $FF   ; end token



_off014_8FD0_4E_se9:
                                        .word $24F4
                                        .byte $9D, $8F, $8A, $80, $80   ; SE9
                                        
                                        .byte $FF   ; end token



_off014_8FD0_4F_se10:
                                        .word $24F4
                                        .byte $9D, $8F, $82, $81, $80   ; SE10
                                        
                                        .byte $FF   ; end token



_off014_8FD0_50_se11:
                                        .word $24F4
                                        .byte $9D, $8F, $82, $82, $80   ; SE11
                                        
                                        .byte $FF   ; end token



_off014_8FD0_51_se12:
                                        .word $24F4
                                        .byte $9D, $8F, $82, $83, $80   ; SE12
                                        
                                        .byte $FF   ; end token



tbl_8FD1_имена_из_3х_букв:
- D 0 - - - 0x030FE1 0C:8FD1: C6        .byte $C6, $BF, $C9, $FF   ; 00 LEO
- D 0 - - - 0x030FE5 0C:8FD5: CC        .byte $CC, $BB, $CA, $FF   ; 01 RAP
- D 0 - - - 0x030FE9 0C:8FD9: C7        .byte $C7, $C3, $C5, $FF   ; 02 MIK
- D 0 - - - 0x030FED 0C:8FDD: BE        .byte $BE, $C9, $C8, $FF   ; 03 DON
- D 0 - - - 0x030FF1 0C:8FE1: BD        .byte $BD, $BB, $CD, $FF   ; 04 CAS
- D 0 - - - 0x030FF5 0C:8FE5: C2        .byte $C2, $C9, $CE, $FF   ; 05 HOT
- D 0 - - - 0x030FF9 0C:8FE9: CD        .byte $CD, $C2, $CC, $FF   ; 06 SHR
- - - - - - 0x030FFD 0C:8FED: CC        .byte $CC, $C8, $BE, $FF   ; 07 RND
- D 0 - - - 0x031001 0C:8FF1: A9        .byte $A9, $A9, $A9, $FF   ; 08 ???
- - - - - - 0x031005 0C:8FF5: FF        .byte $FF, $FF, $FF, $FF   ; 09



tbl_8FFB_ppu_lo:
- D 0 - - - 0x03100B 0C:8FFB: 9E        .byte < $209E   ; 00
- D 0 - - - 0x03100C 0C:8FFC: 3E        .byte < $233E   ; 01

tbl_8FFD_ppu_hi:
- D 0 - - - 0x03100D 0C:8FFD: 20        .byte > $209E   ; 00
- D 0 - - - 0x03100E 0C:8FFE: 23        .byte > $233E   ; 01



sub_0x031010_запись_буферов_в_ppu:
C - - - - - 0x031010 0C:9000: A5 2C     LDA ram_game_mode
; con_gm_story
; con_gm_vs_player
; con_gm_vs_cpu
; con_gm_vs_team
; con_gm_tournament
; con_gm_options
C - - - - - 0x031012 0C:9002: 49 03     EOR #$03
C - - - - - 0x031014 0C:9004: D0 0A     BNE bra_9010
; con_gm_vs_team
C - - - - - 0x031016 0C:9006: A2 01     LDX #$01
bra_9008_loop:
C - - - - - 0x031018 0C:9008: BD 44 01  LDA ram_0144,X
C - - - - - 0x03101B 0C:900B: 30 06     BMI bra_9013
C - - - - - 0x03101D 0C:900D: CA        DEX
C - - - - - 0x03101E 0C:900E: 10 F8     BPL bra_9008_loop
bra_9010:
C - - - - - 0x031020 0C:9010: 4C 06 80  JMP loc_8006
bra_9013:
C - - - - - 0x031023 0C:9013: A9 01     LDA #con_buf_mode_01
C - - - - - 0x031025 0C:9015: 8D 46 01  STA ram_0146
C - - - - - 0x031028 0C:9018: BD 40 01  LDA ram_0140,X
C - - - - - 0x03102B 0C:901B: 0A        ASL
C - - - - - 0x03102C 0C:901C: 0A        ASL
C - - - - - 0x03102D 0C:901D: 7D FB 8F  ADC tbl_8FFB_ppu_lo,X
C - - - - - 0x031030 0C:9020: 8D 47 01  STA ram_0147
C - - - - - 0x031033 0C:9023: BD FD 8F  LDA tbl_8FFD_ppu_hi,X
C - - - - - 0x031036 0C:9026: 8D 48 01  STA ram_0148
C - - - - - 0x031039 0C:9029: FE 44 01  INC ram_0144,X
C - - - - - 0x03103C 0C:902C: F0 13     BEQ bra_9041
C - - - - - 0x03103E 0C:902E: FE 44 01  INC ram_0144,X
C - - - - - 0x031041 0C:9031: D0 07     BNE bra_903A
C - - - - - 0x031043 0C:9033: DE 40 01  DEC ram_0140,X
C - - - - - 0x031046 0C:9036: A2 24     LDX #$24
C - - - - - 0x031048 0C:9038: D0 17     BNE bra_9051    ; jmp
bra_903A:
- - - - - - 0x03104A 0C:903A: FE 44 01  INC ram_0144,X
- - - - - - 0x03104D 0C:903D: A2 20     LDX #$20
- - - - - - 0x03104F 0C:903F: D0 10     BNE bra_9051   ; jmp
bra_9041:
C - - - - - 0x031051 0C:9041: 8A        TXA
C - - - - - 0x031052 0C:9042: 0A        ASL
C - - - - - 0x031053 0C:9043: 0A        ASL
C - - - - - 0x031054 0C:9044: 0A        ASL
C - - - - - 0x031055 0C:9045: 7D 40 01  ADC ram_0140,X
C - - - - - 0x031058 0C:9048: A8        TAY
C - - - - - 0x031059 0C:9049: B9 2F 01  LDA ram_012F,Y
C - - - - - 0x03105C 0C:904C: 0A        ASL
C - - - - - 0x03105D 0C:904D: 0A        ASL
C - - - - - 0x03105E 0C:904E: 69 04     ADC #$04
C - - - - - 0x031060 0C:9050: AA        TAX
bra_9051:
C - - - - - 0x031061 0C:9051: A0 04     LDY #$04
bra_9053_loop:
C - - - - - 0x031063 0C:9053: BD D0 8F  LDA tbl_8FD1_имена_из_3х_букв - $01,X
C - - - - - 0x031066 0C:9056: 99 48 01  STA ram_0149 - $01,Y
C - - - - - 0x031069 0C:9059: CA        DEX
C - - - - - 0x03106A 0C:905A: 88        DEY
C - - - - - 0x03106B 0C:905B: D0 F6     BNE bra_9053_loop
; Y = 00
C - - - - - 0x03106D 0C:905D: A6 25     LDX ram_index_ppu_buffer
bra_905F_loop:
C - - - - - 0x03106F 0C:905F: B9 46 01  LDA ram_0146,Y
C - - - - - 0x031072 0C:9062: 9D FF 02  STA ram_ppu_buffer - $01,X
C - - - - - 0x031075 0C:9065: F0 A9     BEQ bra_9010    ; if найден end token
C - - - - - 0x031077 0C:9067: E8        INX
C - - - - - 0x031078 0C:9068: C8        INY
C - - - - - 0x031079 0C:9069: D0 F4     BNE bra_905F_loop    ; jmp



_off014_AFF1_1F_45:
- D 1 - I - 0x033001 0C:AFF1: 34 21     .word $2135
- D 1 - I - 0x033003 0C:AFF3: 00        .byte $85, $86   ; 45

- D 1 - I - 0x03300B 0C:AFFB: FF        .byte $FF   ; end token



_off014_AFFC_20_60:
- D 1 - I - 0x03300C 0C:AFFC: 34 21     .word $2135
- D 1 - I - 0x03300E 0C:AFFE: 00        .byte $87, $81   ; 60

- D 1 - I - 0x033016 0C:B006: FF        .byte $FF   ; end token



_off014_B007_21_99:
- D 1 - I - 0x033017 0C:B007: 34 21     .word $2135
- D 1 - I - 0x033019 0C:B009: 00        .byte $8A, $8A   ; 99

- D 1 - I - 0x033021 0C:B011: FF        .byte $FF   ; end token



_off014_B012_22_бесконечность:
- D 1 - I - 0x033022 0C:B012: 34 21     .word $2135
- D 1 - I - 0x033024 0C:B014: 00        .byte $BA, $BB   ; бесконечность

- D 1 - I - 0x03302C 0C:B01C: FF        .byte $FF   ; end token



_off014_B01D_1B_100:
- D 1 - I - 0x03302D 0C:B01D: 74 21     .word $2174
- D 1 - I - 0x03302F 0C:B01F: 82        .byte $82, $81, $81, $BC   ; 100%

- D 1 - I - 0x033033 0C:B023: FF        .byte $FF   ; end token



_off014_B024_1C_150:
- D 1 - I - 0x033034 0C:B024: 74 21     .word $2174
- D 1 - I - 0x033036 0C:B026: 82        .byte $82, $86, $81, $BC   ; 150%

- D 1 - I - 0x03303A 0C:B02A: FF        .byte $FF   ; end token



_off014_B02B_1D_200:
- D 1 - I - 0x03303B 0C:B02B: 74 21     .word $2174
- D 1 - I - 0x03303D 0C:B02D: 83        .byte $83, $81, $81, $BC   ; 200%

- D 1 - I - 0x033041 0C:B031: FF        .byte $FF   ; end token



_off014_B032_1E_бесконечность:
- D 1 - I - 0x033042 0C:B032: 74 21     .word $2174
- D 1 - I - 0x033044 0C:B034: 80        .byte $00, $BA, $BB, $00   ; бесконечность

- D 1 - I - 0x033048 0C:B038: FF        .byte $FF   ; end token



_off014_B039_23_green:
- D 1 - I - 0x033049 0C:B039: B4 20     .word $20B4
- D 1 - I - 0x03304B 0C:B03B: 91        .byte $91, $9C, $8F, $8F, $98, $00, $00, $00   ; GREEN

- D 1 - I - 0x033053 0C:B043: FF        .byte $FF   ; end token



_off014_B044_24_original:
- D 1 - I - 0x033054 0C:B044: B4 20     .word $20B4
- D 1 - I - 0x033056 0C:B046: 99        .byte $99, $9C, $93, $91, $93, $98, $8B, $96   ; ORIGINAL

- D 1 - I - 0x03305E 0C:B04E: FF        .byte $FF   ; end token



_off014_B04F_25_night:
- D 1 - I - 0x03305F 0C:B04F: B4 20     .word $20B4
- D 1 - I - 0x033061 0C:B051: 98        .byte $98, $93, $91, $92, $9E, $00, $00, $00   ; NIGHT

- D 1 - I - 0x033069 0C:B059: FF        .byte $FF   ; end token



