.segment "BANK_0C"
.include "copy_bank_ram.inc"
.include "copy_bank_val.inc"
; 0x018010-0x01A00F
.org $A000



.export sub_0x024BD5_анимации___атаки___звуки
.export sub_0x02630E_таблицы



sub_0x024BD5_анимации___атаки___звуки:
; перемещено из банка 12
C - - - - - 0x024BD5 09:8BC5: BD 12 06  LDA ram_plr_индекс_атаки,X ; 0612 0613 
C - - - - - 0x024BD8 09:8BC8: 0A        ASL
C - - - - - 0x024BD9 09:8BC9: A8        TAY
C - - - - - 0x024BDA 09:8BCA: B9 01 94  LDA tbl_9401_анимации___атаки___звуки,Y
C - - - - - 0x024BDD 09:8BCD: 85 00     STA ram_0000
C - - - - - 0x024BDF 09:8BCF: B9 02 94  LDA tbl_9401_анимации___атаки___звуки + $01,Y
C - - - - - 0x024BE2 09:8BD2: 85 01     STA ram_0001
bra_8BD4_loop:
C - - - - - 0x024BE4 09:8BD4: BD 16 06  LDA ram_plr_этап_удара,X ; 0616 0617 
C - - - - - 0x024BE7 09:8BD7: 0A        ASL
C - - - - - 0x024BE8 09:8BD8: A8        TAY
C - - - - - 0x024BE9 09:8BD9: B1 00     LDA (ram_0000),Y
C - - - - - 0x024BEB 09:8BDB: F0 2F     BEQ bra_8C0C_00
C - - - - - 0x024BED 09:8BDD: C9 FE     CMP #$FE
C - - - - - 0x024BEF 09:8BDF: F0 08     BEQ bra_8BE9_FE
C - - - - - 0x024BF1 09:8BE1: C9 FF     CMP #$FF
C - - - - - 0x024BF3 09:8BE3: F0 0D     BEQ bra_8BF2_FF
C - - - - - 0x024BF5 09:8BE5: 9D 00 04  STA ram_obj_anim_id,X
C - - - - - 0x024BF8 09:8BE8: 60        RTS
bra_8BE9_FE:
; воспроизвести звук
C - - - - - 0x024BF9 09:8BE9: C8        INY
C - - - - - 0x024BFA 09:8BEA: B1 00     LDA (ram_0000),Y
C - - - - - 0x024BFC 09:8BEC: 20 94 F6  JSR sub_0x03F6A4_записать_звук
C D 1 - - - 0x0277AC 09:B79C: BD 20 05  LDA ram_obj_state_hi,X ; 0520 0521 
C - - - - - 0x0277AF 09:B79F: C9 07     CMP #con_plr_state_сидит     
C - - - - - 0x0277B1 09:B7A1: BD 00 06  LDA ram_0600_plr,X ; 0600 0601 
C - - - - - 0x0277B4 09:B7A4: 90 0B     BCC bra_B7B1
C - - - - - 0x0277B6 09:B7A6: FE 00 06  INC ram_0600_plr,X ; 0600 0601 
C D 1 - - - 0x0277B9 09:B7A9: C9 0E     CMP #$0E
C - - - - - 0x0277BB 09:B7AB: F0 04     BEQ bra_B7B1
C - - - - - 0x0277BD 09:B7AD: C9 8E     CMP #$8E
C - - - - - 0x0277BF 09:B7AF: D0 05     BNE bra_B7B6
bra_B7B1:
C - - - - - 0x0277C1 09:B7B1: 29 F0     AND #$F0
C - - - - - 0x0277C3 09:B7B3: 9D 00 06  STA ram_0600_plr,X ; 0600 0601 
bra_B7B6:
C - - - - - 0x0277C6 09:B7B6: 4C 07 8C  JMP loc_8C07
bra_8BF2_FF:
; индекс удара
C - - - - - 0x024C02 09:8BF2: C8        INY
C - - - - - 0x024C03 09:8BF3: B1 00     LDA (ram_0000),Y
C - - - - - 0x024C05 09:8BF5: 9D 52 05  STA ram_obj_id + $02,X ; 0552 0553 
C - - - - - 0x024C08 09:8BF8: BD 10 05  LDA ram_obj_flip,X ; 0510 0511 
C - - - - - 0x024C0B 09:8BFB: 9D 12 05  STA ram_obj_flip + $02,X ; 0512 0513 
C - - - - - 0x024C0E 09:8BFE: A9 00     LDA #$00
C - - - - - 0x024C10 09:8C00: 9D 32 05  STA ram_0530_obj_state + $02,X ; 0532 0533 
C - - - - - 0x024C13 09:8C03: 8A        TXA
C - - - - - 0x024C14 09:8C04: 9D 22 05  STA ram_obj_state_hi + $02,X ; 0522 0523 
loc_8C07:
C D 0 - - - 0x024C17 09:8C07: FE 16 06  INC ram_plr_этап_удара,X ; 0616 0617 
C - - - - - 0x024C1A 09:8C0A: D0 C8     BNE bra_8BD4_loop   ; jmp?
bra_8C0C_00:    ; A = 00
C - - - - - 0x024C1C 09:8C0C: 9D 10 06  STA ram_plr_флаг_индекса_атаки,X ; 0610 0611 
C - - - - - 0x024C1F 09:8C0F: 9D 14 06  STA ram_plr_время_анимации_удара,X ; 0614 0615 
C - - - - - 0x024C22 09:8C12: 9D 26 06  STA ram_0626_plr,X ; 0626 0627 
C - - - - - 0x024C25 09:8C15: 4C 18 D2  JMP loc_0x03D228_вычислить_поворот_игрока_относительно_другого



tbl_9401_анимации___атаки___звуки:
- D 0 - - - 0x025411 09:9401: 5D 94     .word _off010_945D_00_черепаха_рука_дальняя
- D 0 - - - 0x025413 09:9403: 6A 94     .word _off010_946A_01_черепаха_нога_ближняя
- D 0 - - - 0x025415 09:9405: 77 94     .word _off010_9477_02_черепаха_рука_в_воздухе
- D 0 - - - 0x025417 09:9407: 7E 94     .word _off010_947E_03_черепаха_нога_в_воздухе
- D 0 - - - 0x025419 09:9409: 89 94     .word _off010_9489_04_черепаха_рука_сидя
- D 0 - - - 0x02541B 09:940B: 92 94     .word _off010_9492_05_черепаха_нога_сидя_обычная
- D 0 - - - 0x02541D 09:940D: 9D 94     .word _off010_949D_06_черепаха_рука_ближняя
- D 0 - - - 0x02541F 09:940F: A8 94     .word _off010_94A8_07_черепаха_нога_дальняя_обычная
- D 0 - - - 0x025421 09:9411: B7 94     .word _off010_94B7_08_черепаха_нога_дальняя_raph
- D 0 - - - 0x025423 09:9413: C4 94     .word _off010_94C4_09_черепаха_нога_сидя_leo
- D 0 - - - 0x025425 09:9415: D1 94     .word _off010_94D1_0A_черепаха_деш_локтем
- D 0 - - - 0x025427 09:9417: DE 94     .word _off010_94DE_0B_черепаха_нога_антиэйр
- D 0 - - - 0x025429 09:9419: ED 94     .word _off010_94ED_0C_черепаха_рука_антиэйр
- D 0 - - - 0x02542B 09:941B: FE 94     .word _off010_94FE_0D_черепаха_деш_ногой
- D 0 - - - 0x02542D 09:941D: 09 95     .word _off010_9509_0E_casey_рука_дальняя
- D 0 - - - 0x02542F 09:941F: 18 95     .word _off010_9518_0F_casey_рука_в_воздухе
- D 0 - - - 0x025431 09:9421: 21 95     .word _off010_9521_10_casey_рука_сидя
- D 0 - - - 0x025433 09:9423: 2C 95     .word _off010_952C_11_casey_рука_ближняя
- D 0 - - - 0x025435 09:9425: 39 95     .word _off010_9539_12_casey_рука_антиэйр
- D 0 - - - 0x025437 09:9427: 4A 95     .word _off010_954A_13_casey_нога_ближняя
- D 0 - - - 0x025439 09:9429: 59 95     .word _off010_9559_14_casey_нога_дальняя
- D 0 - - - 0x02543B 09:942B: 68 95     .word _off010_9568_15_casey_нога_в_воздухе
- D 0 - - - 0x02543D 09:942D: 71 95     .word _off010_9571_16_casey_нога_сидя
- D 0 - - - 0x02543F 09:942F: 7C 95     .word _off010_957C_17_casey_нога_антиэйр
- D 0 - - - 0x025441 09:9431: 8D 95     .word _off010_958D_18_hot_рука_ближняя
- D 0 - - - 0x025443 09:9433: 9A 95     .word _off010_959A_19_hot_рука_дальняя
- D 0 - - - 0x025445 09:9435: A9 95     .word _off010_95A9_1A_hot_рука_в_воздухе
- D 0 - - - 0x025447 09:9437: B2 95     .word _off010_95B2_1B_hot_рука_сидя
- D 0 - - - 0x025449 09:9439: BD 95     .word _off010_95BD_1C_hot_нога_ближняя
- D 0 - - - 0x02544B 09:943B: C8 95     .word _off010_95C8_1D_hot_нога_дальняя
- D 0 - - - 0x02544D 09:943D: D5 95     .word _off010_95D5_1E_hot_нога_в_воздухе
- D 0 - - - 0x02544F 09:943F: DE 95     .word _off010_95DE_1F_hot_нога_сидя
; bzk bug? оба байта также читаются из 0x024BBD
; это все потому что он бабочка, да?
- D 0 - I - 0x025451 09:9441: E9 95     .word _off010_95E9_20_hot_бабочка
- D 0 - - - 0x025453 09:9443: F2 95     .word _off010_95F2_21_hot_рука_антиэйр
- D 0 - - - 0x025455 09:9445: 05 96     .word _off010_9605_22_hot_нога_антиэйр
- D 0 - - - 0x025457 09:9447: 12 96     .word _off010_9612_23_shred_рука_ближняя
- D 0 - - - 0x025459 09:9449: 1F 96     .word _off010_961F_24_shred_рука_средняя
- D 0 - - - 0x02545B 09:944B: 2A 96     .word _off010_962A_25_shred_рука_дальняя
- D 0 - - - 0x02545D 09:944D: 35 96     .word _off010_9635_26_shred_рука_антиэйр
- D 0 - - - 0x02545F 09:944F: 42 96     .word _off010_9642_27_shred_рука_в_воздухе
- D 0 - - - 0x025461 09:9451: 4B 96     .word _off010_964B_28_shred_рука_сидя
- D 0 - - - 0x025463 09:9453: 56 96     .word _off010_9656_29_shred_нога_ближняя
- D 0 - - - 0x025465 09:9455: 63 96     .word _off010_9663_2A_shred_нога_дальняя
- D 0 - - - 0x025467 09:9457: 72 96     .word _off010_9672_2B_shred_нога_в_воздухе
- D 0 - - - 0x025469 09:9459: 79 96     .word _off010_9679_2C_shred_нога_сидя
- D 0 - - - 0x02546B 09:945B: 84 96     .word _off010_9684_2D_shred_нога_антиэйр
                                        .word _off010_9605_2E_hot_ручка_быстрая
                                        .word $0000      ; 30 rezerv
                                        .word $0000      ; 31 rezerv
                                        .word $0000      ; 32 rezerv
                                        .word $0000      ; 33 rezerv
                                        .word $0000      ; 34 rezerv
                                        .word $0000      ; 35 rezerv
                                        .word $0000      ; 36 rezerv
                                        .word $0000      ; 37 rezerv
                                        .word $0000      ; 38 rezerv
                                        .word $0000      ; 39 rezerv
                                        .word $0000      ; 3A rezerv
                                        .word $0000      ; 3B rezerv
                                        .word $0000      ; 3C rezerv
                                        .word $0000      ; 3D rezerv
                                        .word $0000      ; 3E rezerv



_off010_945D_00_черепаха_рука_дальняя:
- D 0 - I - 0x02546D 09:945D: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x02546F 09:945F: 8D        .byte $8D, $05   ; 01
- D 0 - I - 0x025471 09:9461: 8F        .byte $8F, $00   ; 02
- D 0 - I - 0x025473 09:9463: FF        .byte $FF, con_0552_черепаха_рука_дальняя   ; 03
- D 0 - I - 0x025475 09:9465: 8F        .byte $8F, $06   ; 04
- D 0 - I - 0x025477 09:9467: 8D        .byte $8D, $09   ; 05
- D 0 - I - 0x025479 09:9469: 00        .byte $00   ; end token



_off010_946A_01_черепаха_нога_ближняя:
- D 0 - I - 0x02547A 09:946A: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x02547C 09:946C: 8B        .byte $8B, $02   ; 01
- D 0 - I - 0x02547E 09:946E: 92        .byte $92, $04   ; 02
- D 0 - I - 0x025480 09:9470: FF        .byte $FF, con_0552_черепаха_нога_ближняя   ; 03
- D 0 - I - 0x025482 09:9472: 93        .byte $93, $06   ; 04
- D 0 - I - 0x025484 09:9474: 92        .byte $92, $04   ; 05
- D 0 - I - 0x025486 09:9476: 00        .byte $00   ; end token



_off010_9477_02_черепаха_рука_в_воздухе:
- D 0 - I - 0x025487 09:9477: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x025489 09:9479: FF        .byte $FF, con_0552_черепаха_рука_в_воздухе   ; 01
- D 0 - I - 0x02548B 09:947B: DF        .byte $DF, $0C   ; 02
- D 0 - I - 0x02548D 09:947D: 00        .byte $00   ; end token



_off010_947E_03_черепаха_нога_в_воздухе:
- D 0 - I - 0x02548E 09:947E: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x025490 09:9480: 97        .byte $97, $06   ; 01
- D 0 - I - 0x025492 09:9482: E1        .byte $E1, $00   ; 02
- D 0 - I - 0x025494 09:9484: FF        .byte $FF, con_0552_черепаха_нога_в_воздухе   ; 03
- D 0 - I - 0x025496 09:9486: E1        .byte $E1, $0D   ; 04
- D 0 - I - 0x025498 09:9488: 00        .byte $00   ; end token



_off010_9489_04_черепаха_рука_сидя:
- D 0 - I - 0x025499 09:9489: FE        .byte $FE, con_075C_07   ; 00
- D 0 - I - 0x02549B 09:948B: FF        .byte $FF, con_0552_черепаха_рука_сидя   ; 01
- D 0 - I - 0x02549D 09:948D: DE        .byte $DE, $0A   ; 02
- D 0 - I - 0x02549F 09:948F: 99        .byte $99, $04   ; 03
- D 0 - I - 0x0254A1 09:9491: 00        .byte $00   ; end token



_off010_9492_05_черепаха_нога_сидя_обычная:
- D 0 - I - 0x0254A2 09:9492: FE        .byte $FE, con_075C_07   ; 00
- D 0 - I - 0x0254A4 09:9494: 99        .byte $99, $03   ; 01
- D 0 - I - 0x0254A6 09:9496: FF        .byte $FF, con_0552_черепаха_нога_сидя_обычная   ; 02
- D 0 - I - 0x0254A8 09:9498: 9A        .byte $9A, $07   ; 03
- D 0 - I - 0x0254AA 09:949A: 99        .byte $99, $04   ; 04
- D 0 - I - 0x0254AC 09:949C: 00        .byte $00   ; end token



_off010_949D_06_черепаха_рука_ближняя:
- D 0 - I - 0x0254AD 09:949D: FE        .byte $FE, con_075C_07   ; 00
- D 0 - I - 0x0254AF 09:949F: 90        .byte $90, $04   ; 01
- D 0 - I - 0x0254B1 09:94A1: FF        .byte $FF, con_0552_черепаха_рука_ближняя   ; 02
- D 0 - I - 0x0254B3 09:94A3: 91        .byte $91, $05   ; 03
- D 0 - I - 0x0254B5 09:94A5: 90        .byte $90, $03   ; 04
- D 0 - I - 0x0254B7 09:94A7: 00        .byte $00   ; end token



_off010_94A8_07_черепаха_нога_дальняя_обычная:
- D 0 - I - 0x0254B8 09:94A8: FE        .byte $FE, con_075C_04   ; 00
- D 0 - I - 0x0254BA 09:94AA: 95        .byte $95, $08   ; 01
- D 0 - I - 0x0254BC 09:94AC: 93        .byte $93, $00   ; 02
- D 0 - I - 0x0254BE 09:94AE: FF        .byte $FF, con_0552_черепаха_нога_дальняя_обычная   ; 03
- D 0 - I - 0x0254C0 09:94B0: 93        .byte $93, $04   ; 04
- D 0 - I - 0x0254C2 09:94B2: 93        .byte $93, $04   ; 05
- D 0 - I - 0x0254C4 09:94B4: 92        .byte $92, $0A   ; 06
- D 0 - I - 0x0254C6 09:94B6: 00        .byte $00   ; end token



_off010_94B7_08_черепаха_нога_дальняя_raph:
- D 0 - I - 0x0254C7 09:94B7: FE        .byte $FE, con_075C_04   ; 00
- D 0 - I - 0x0254C9 09:94B9: 8B        .byte $8B, $07   ; 01
- D 0 - I - 0x0254CB 09:94BB: 94        .byte $94, $07   ; 02
- D 0 - I - 0x0254CD 09:94BD: FF        .byte $FF, con_0552_черепаха_нога_дальняя_raph   ; 03
- D 0 - I - 0x0254CF 09:94BF: 93        .byte $93, $07   ; 04
- D 0 - I - 0x0254D1 09:94C1: 92        .byte $92, $0C   ; 05
- D 0 - I - 0x0254D3 09:94C3: 00        .byte $00   ; end token



_off010_94C4_09_черепаха_нога_сидя_leo:
- D 0 - I - 0x0254D4 09:94C4: FE        .byte $FE, con_075C_09   ; 00
- D 0 - I - 0x0254D6 09:94C6: B9        .byte $B9, $06   ; 01
- D 0 - I - 0x0254D8 09:94C8: FF        .byte $FF, con_0552_черепаха_нога_сидя_leo   ; 02
- D 0 - I - 0x0254DA 09:94CA: DA        .byte $DA, $0C   ; 03
- D 0 - I - 0x0254DC 09:94CC: 9A        .byte $9A, $06   ; 04
- D 0 - I - 0x0254DE 09:94CE: 99        .byte $99, $0A   ; 05
- D 0 - I - 0x0254E0 09:94D0: 00        .byte $00   ; end token



_off010_94D1_0A_черепаха_деш_локтем:
- D 0 - I - 0x0254E1 09:94D1: FE        .byte $FE, con_dpcm_warcry_turtle_1   ; 00
- D 0 - I - 0x0254E3 09:94D3: 90        .byte $90, $04   ; 01
- D 0 - I - 0x0254E5 09:94D5: FF        .byte $FF, con_0552_черепаха_деш_локтем   ; 02
- D 0 - I - 0x0254E7 09:94D7: E2        .byte $E2, $0E   ; 03
- D 0 - I - 0x0254E9 09:94D9: 89        .byte $89, $06   ; 04
- D 0 - I - 0x0254EB 09:94DB: 88        .byte $88, $04   ; 05
- D 0 - I - 0x0254ED 09:94DD: 00        .byte $00   ; end token



_off010_94DE_0B_черепаха_нога_антиэйр:
- D 0 - I - 0x0254EE 09:94DE: FE        .byte $FE, con_075C_04   ; 00
- D 0 - I - 0x0254F0 09:94E0: D6        .byte $D6, $04   ; 01
- D 0 - I - 0x0254F2 09:94E2: D7        .byte $D7, $04   ; 02
- D 0 - I - 0x0254F4 09:94E4: D8        .byte $D8, $00   ; 03
- D 0 - I - 0x0254F6 09:94E6: FF        .byte $FF, con_0552_черепаха_нога_антиэйр   ; 04
- D 0 - I - 0x0254F8 09:94E8: D8        .byte $D8, $0B   ; 05
- D 0 - I - 0x0254FA 09:94EA: D7        .byte $D7, $0B   ; 06
- D 0 - I - 0x0254FC 09:94EC: 00        .byte $00   ; end token



_off010_94ED_0C_черепаха_рука_антиэйр:
- D 0 - I - 0x0254FD 09:94ED: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x0254FF 09:94EF: 99        .byte $99, $05   ; 01
- D 0 - I - 0x025501 09:94F1: DB        .byte $DB, $04   ; 02
- D 0 - I - 0x025503 09:94F3: DC        .byte $DC, $00   ; 03
- D 0 - I - 0x025505 09:94F5: FF        .byte $FF, con_0552_черепаха_рука_антиэйр   ; 04
- D 0 - I - 0x025507 09:94F7: DC        .byte $DC, $06   ; 05
- D 0 - I - 0x025509 09:94F9: DD        .byte $DD, $05   ; 06
- D 0 - I - 0x02550B 09:94FB: DC        .byte $DC, $0B   ; 07
- D 0 - I - 0x02550D 09:94FD: 00        .byte $00   ; end token



_off010_94FE_0D_черепаха_деш_ногой:
- D 0 - I - 0x02550E 09:94FE: FE        .byte $FE, con_075C_09   ; 00
- D 0 - I - 0x025510 09:9500: 97        .byte $97, $04   ; 01
- D 0 - I - 0x025512 09:9502: FF        .byte $FF, con_0552_черепаха_деш_ногой   ; 02
- D 0 - I - 0x025514 09:9504: 98        .byte $98, $0E   ; 03
- D 0 - I - 0x025516 09:9506: 97        .byte $97, $06   ; 04
- D 0 - I - 0x025518 09:9508: 00        .byte $00   ; end token



_off010_9509_0E_casey_рука_дальняя:
- D 0 - I - 0x025519 09:9509: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x02551B 09:950B: 8E        .byte $8E, $03   ; 01
- D 0 - I - 0x02551D 09:950D: 8F        .byte $8F, $03   ; 02
- D 0 - I - 0x02551F 09:950F: 90        .byte $90, $00   ; 03
- D 0 - I - 0x025521 09:9511: FF        .byte $FF, con_0552_casey_рука_дальняя   ; 04
- D 0 - I - 0x025523 09:9513: 90        .byte $90, $07   ; 05
- D 0 - I - 0x025525 09:9515: 8F        .byte $8F, $07   ; 06
- D 0 - I - 0x025527 09:9517: 00        .byte $00   ; end token



_off010_9518_0F_casey_рука_в_воздухе:
- D 0 - I - 0x025528 09:9518: FE        .byte $FE, con_075C_07   ; 00
- D 0 - I - 0x02552A 09:951A: 91        .byte $91, $06   ; 01
- D 0 - I - 0x02552C 09:951C: FF        .byte $FF, con_0552_casey_рука_в_воздухе   ; 02
- D 0 - I - 0x02552E 09:951E: 92        .byte $92, $0A   ; 03
- D 0 - I - 0x025530 09:9520: 00        .byte $00   ; end token



_off010_9521_10_casey_рука_сидя:
- D 0 - I - 0x025531 09:9521: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x025533 09:9523: 93        .byte $93, $06   ; 01
- D 0 - I - 0x025535 09:9525: 94        .byte $94, $00   ; 02
- D 0 - I - 0x025537 09:9527: FF        .byte $FF, con_0552_casey_рука_сидя   ; 03
- D 0 - I - 0x025539 09:9529: 94        .byte $94, $07   ; 04
- D 0 - I - 0x02553B 09:952B: 00        .byte $00   ; end token



_off010_952C_11_casey_рука_ближняя:
- D 0 - I - 0x02553C 09:952C: FE        .byte $FE, con_075C_04   ; 00
- D 0 - I - 0x02553E 09:952E: 8E        .byte $8E, $04   ; 01
- D 0 - I - 0x025540 09:9530: 95        .byte $95, $04   ; 02
- D 0 - I - 0x025542 09:9532: 96        .byte $96, $00   ; 03
- D 0 - I - 0x025544 09:9534: FF        .byte $FF, con_0552_casey_рука_ближняя   ; 04
- D 0 - I - 0x025546 09:9536: 96        .byte $96, $0A   ; 05
- D 0 - I - 0x025548 09:9538: 00        .byte $00   ; end token



_off010_9539_12_casey_рука_антиэйр:
- D 0 - I - 0x025549 09:9539: FE        .byte $FE, con_075C_04   ; 00
- D 0 - I - 0x02554B 09:953B: 8E        .byte $8E, $01   ; 01
- D 0 - I - 0x02554D 09:953D: A2        .byte $A2, $04   ; 02
- D 0 - I - 0x02554F 09:953F: 95        .byte $95, $04   ; 03
- D 0 - I - 0x025551 09:9541: FF        .byte $FF, con_0552_casey_рука_антиэйр   ; 04
- D 0 - I - 0x025553 09:9543: 97        .byte $97, $05   ; 05
- D 0 - I - 0x025555 09:9545: 98        .byte $98, $08   ; 06
- D 0 - I - 0x025557 09:9547: 80        .byte $80, $05   ; 07
- D 0 - I - 0x025559 09:9549: 00        .byte $00   ; end token



_off010_954A_13_casey_нога_ближняя:
- D 0 - I - 0x02555A 09:954A: FE        .byte $FE, con_075C_07   ; 00
- D 0 - I - 0x02555C 09:954C: 86        .byte $86, $04   ; 01
- D 0 - I - 0x02555E 09:954E: A1        .byte $A1, $04   ; 02
- D 0 - I - 0x025560 09:9550: FF        .byte $FF, con_0552_casey_нога_ближняя   ; 03
- D 0 - I - 0x025562 09:9552: 99        .byte $99, $06   ; 04
- D 0 - I - 0x025564 09:9554: 86        .byte $86, $05   ; 05
- D 0 - I - 0x025566 09:9556: 80        .byte $80, $02   ; 06
- D 0 - I - 0x025568 09:9558: 00        .byte $00   ; end token



_off010_9559_14_casey_нога_дальняя:
- D 0 - I - 0x025569 09:9559: FE        .byte $FE, con_075C_04   ; 00
- D 0 - I - 0x02556B 09:955B: 8E        .byte $8E, $05   ; 01
- D 0 - I - 0x02556D 09:955D: 9A        .byte $9A, $04   ; 02
- D 0 - I - 0x02556F 09:955F: 9B        .byte $9B, $00   ; 03
- D 0 - I - 0x025571 09:9561: FF        .byte $FF, con_0552_casey_нога_дальняя   ; 04
- D 0 - I - 0x025573 09:9563: 9B        .byte $9B, $08   ; 05
- D 0 - I - 0x025575 09:9565: 9A        .byte $9A, $0B   ; 06
- D 0 - I - 0x025577 09:9567: 00        .byte $00   ; end token



_off010_9568_15_casey_нога_в_воздухе:
- D 0 - I - 0x025578 09:9568: FE        .byte $FE, con_075C_05   ; 00
- D 0 - I - 0x02557A 09:956A: 9C        .byte $9C, $06   ; 01
- D 0 - I - 0x02557C 09:956C: FF        .byte $FF, con_0552_casey_нога_в_воздухе   ; 02
- D 0 - I - 0x02557E 09:956E: 9D        .byte $9D, $0A   ; 03
- D 0 - I - 0x025580 09:9570: 00        .byte $00   ; end token



_off010_9571_16_casey_нога_сидя:
- D 0 - I - 0x025581 09:9571: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x025583 09:9573: A2        .byte $A2, $04   ; 01
- D 0 - I - 0x025585 09:9575: FF        .byte $FF, con_0552_casey_нога_сидя   ; 02
- D 0 - I - 0x025587 09:9577: 9E        .byte $9E, $07   ; 03
- D 0 - I - 0x025589 09:9579: A2        .byte $A2, $05   ; 04
- D 0 - I - 0x02558B 09:957B: 00        .byte $00   ; end token



_off010_957C_17_casey_нога_антиэйр:
- D 0 - I - 0x02558C 09:957C: FE        .byte $FE, con_075C_04   ; 00
- D 0 - I - 0x02558E 09:957E: A2        .byte $A2, $08   ; 01
- D 0 - I - 0x025590 09:9580: D2        .byte $D2, $04   ; 02
- D 0 - I - 0x025592 09:9582: FF        .byte $FF, con_0552_casey_нога_антиэйр   ; 03
- D 0 - I - 0x025594 09:9584: D3        .byte $D3, $03   ; 04
- D 0 - I - 0x025596 09:9586: D4        .byte $D4, $05   ; 05
- D 0 - I - 0x025598 09:9588: D5        .byte $D5, $08   ; 06
- D 0 - I - 0x02559A 09:958A: A2        .byte $A2, $0E   ; 07
- D 0 - I - 0x02559C 09:958C: 00        .byte $00   ; end token



_off010_958D_18_hot_рука_ближняя:
- D 0 - I - 0x02559D 09:958D: FE        .byte $FE, con_075C_07   ; 00
- D 0 - I - 0x02559F 09:958F: 8D        .byte $8D, $07   ; 01
- D 0 - I - 0x0255A1 09:9591: FF        .byte $FF, con_0552_00   ; 02
- D 0 - I - 0x0255A3 09:9593: FF        .byte $FF, con_0552_hot_рука_ближняя   ; 03
- D 0 - I - 0x0255A5 09:9595: B7        .byte $B7, $08   ; 04
- D 0 - I - 0x0255A7 09:9597: 82        .byte $82, $05   ; 05
- D 0 - I - 0x0255A9 09:9599: 00        .byte $00   ; end token



_off010_959A_19_hot_рука_дальняя:
- D 0 - I - 0x0255AA 09:959A: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x0255AC 09:959C: 8D        .byte $8E, $09   ; 01
- D 0 - I - 0x0255AE 09:959E: FF        .byte $8F, $00   ; 02
- D 0 - I - 0x0255B0 09:95A0: FF        .byte $FF, con_0552_hot_рука_дальняя   ; 03
- D 0 - I - 0x0255B2 09:95A2: B7        .byte $8F, $0A   ; 04
- D 0 - I - 0x0255B4 09:95A4: 82        .byte $80, $0A   ; 05
- D 0 - I - 0x0255B6 09:95A6: 00        .byte $00, $00   ; 06
- - - - - - 0x0255B8 09:95A8: 00        .byte $00   ; end token



_off010_95A9_1A_hot_рука_в_воздухе:
- D 0 - I - 0x0255B9 09:95A9: FE        .byte $FE, con_075C_07   ; 00
- D 0 - I - 0x0255BB 09:95AB: 90        .byte $90, $09   ; 01
- D 0 - I - 0x0255BD 09:95AD: FF        .byte $FF, con_0552_hot_рука_в_воздухе   ; 02
- D 0 - I - 0x0255BF 09:95AF: 91        .byte $91, $0C   ; 03
- D 0 - I - 0x0255C1 09:95B1: 00        .byte $00   ; end token



_off010_95B2_1B_hot_рука_сидя:
- D 0 - I - 0x0255C2 09:95B2: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x0255C4 09:95B4: 92        .byte $92, $07   ; 01
- D 0 - I - 0x0255C6 09:95B6: FF        .byte $FF, con_0552_hot_рука_сидя   ; 02
- D 0 - I - 0x0255C8 09:95B8: 93        .byte $93, $07   ; 03
- D 0 - I - 0x0255CA 09:95BA: 9D        .byte $9D, $04   ; 04
- D 0 - I - 0x0255CC 09:95BC: 00        .byte $00   ; end token



_off010_95BD_1C_hot_нога_ближняя:
- D 0 - I - 0x0255CD 09:95BD: FE        .byte $FE, con_075C_07   ; 00
- D 0 - I - 0x0255CF 09:95BF: 94        .byte $94, $07   ; 01
- D 0 - I - 0x0255D1 09:95C1: FF        .byte $FF, con_0552_hot_нога_ближняя   ; 02
- D 0 - I - 0x0255D3 09:95C3: 95        .byte $95, $08   ; 03
- D 0 - I - 0x0255D5 09:95C5: 8D        .byte $8D, $09   ; 04
- D 0 - I - 0x0255D7 09:95C7: 00        .byte $00   ; end token



_off010_95C8_1D_hot_нога_дальняя:
- D 0 - I - 0x0255D8 09:95C8: FE        .byte $FE, con_075C_04   ; 00
- D 0 - I - 0x0255DA 09:95CA: 92        .byte $92, $05   ; 01
- D 0 - I - 0x0255DC 09:95CC: 94        .byte $94, $06   ; 02
- D 0 - I - 0x0255DE 09:95CE: FF        .byte $FF, con_0552_hot_нога_дальняя   ; 03
- D 0 - I - 0x0255E0 09:95D0: 96        .byte $96, $0C   ; 04
- D 0 - I - 0x0255E2 09:95D2: 8D        .byte $8D, $0C   ; 05
- D 0 - I - 0x0255E4 09:95D4: 00        .byte $00   ; end token



_off010_95D5_1E_hot_нога_в_воздухе:
- D 0 - I - 0x0255E5 09:95D5: FE        .byte $FE, con_075C_05   ; 00
- D 0 - I - 0x0255E7 09:95D7: 97        .byte $97, $08   ; 01
- D 0 - I - 0x0255E9 09:95D9: FF        .byte $FF, con_0552_hot_нога_в_воздухе   ; 02
- D 0 - I - 0x0255EB 09:95DB: 98        .byte $98, $0C   ; 03
- D 0 - I - 0x0255ED 09:95DD: 00        .byte $00   ; end token



_off010_95DE_1F_hot_нога_сидя:
- D 0 - I - 0x0255EE 09:95DE: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x0255F0 09:95E0: 9D        .byte $9D, $08   ; 01
- D 0 - I - 0x0255F2 09:95E2: FF        .byte $FF, con_0552_hot_нога_сидя   ; 02
- D 0 - I - 0x0255F4 09:95E4: 99        .byte $99, $08   ; 03
- D 0 - I - 0x0255F6 09:95E6: 9D        .byte $9D, $05   ; 04
- D 0 - I - 0x0255F8 09:95E8: 00        .byte $00   ; end token



_off010_95E9_20_hot_бабочка:
- D 0 - I - 0x0255F9 09:95E9: FE        .byte $FE, con_dpcm_warcry_hot_1   ; 00
- D 0 - I - 0x0255FB 09:95EB: B5        .byte $B5, $04   ; 01
- D 0 - I - 0x0255FD 09:95ED: FF        .byte $FF, con_0552_hot_бабочка   ; 02
- D 0 - I - 0x0255FF 09:95EF: B5        .byte $B5, $14   ; 03
- D 0 - I - 0x025601 09:95F1: 00        .byte $00   ; end token



_off010_95F2_21_hot_рука_антиэйр:
- D 0 - I - 0x025602 09:95F2: FE        .byte $FE, con_075C_04   ; 00
- D 0 - I - 0x025604 09:95F4: 8B        .byte $8B, $03   ; 01
- D 0 - I - 0x025606 09:95F6: 8E        .byte $8E, $04   ; 02
- D 0 - I - 0x025608 09:95F8: 80        .byte $80, $03   ; 03
- D 0 - I - 0x02560A 09:95FA: B6        .byte $B6, $00   ; 04
- D 0 - I - 0x02560C 09:95FC: FF        .byte $FF, con_0552_hot_рука_антиэйр   ; 05
- D 0 - I - 0x02560E 09:95FE: B6        .byte $B6, $0B   ; 06
- D 0 - I - 0x025610 09:9600: 8E        .byte $8E, $06   ; 07
- D 0 - I - 0x025612 09:9602: 80        .byte $80, $07   ; 08
- D 0 - I - 0x025614 09:9604: 00        .byte $00   ; end token



_off010_9605_22_hot_нога_антиэйр:
- D 0 - I - 0x025615 09:9605: 9D        .byte $9D, $05   ; 00
- D 0 - I - 0x025617 09:9607: 80        .byte $80, $03   ; 01
- D 0 - I - 0x025619 09:9609: C3        .byte $C3, $05   ; 02
- D 0 - I - 0x02561B 09:960B: FF        .byte $FF, con_0552_hot_нога_антиэйр   ; 03
- D 0 - I - 0x02561D 09:960D: C4        .byte $C4, $0A   ; 04
- D 0 - I - 0x02561F 09:960F: 80        .byte $80, $08   ; 05
- D 0 - I - 0x025621 09:9611: 00        .byte $00   ; end token



_off010_9605_2E_hot_ручка_быстрая:
                                        .byte $FE, con_075C_07
                                        .byte $8D, $05
                                        .byte $FF, con_0552_00
                                        .byte $FF, con_0552_hot_ручка_быстрая
                                        .byte $B7, $08
                                        .byte $82, $05
                                        .byte $00



_off010_9612_23_shred_рука_ближняя:
- D 0 - I - 0x025622 09:9612: FE        .byte $FE, con_075C_07   ; 00
- D 0 - I - 0x025624 09:9614: 93        .byte $93, $04   ; 01
- D 0 - I - 0x025626 09:9616: 8E        .byte $8E, $02   ; 02
- D 0 - I - 0x025628 09:9618: FF        .byte $FF, con_0552_shred_рука_ближняя   ; 03
- D 0 - I - 0x02562A 09:961A: 94        .byte $94, $04   ; 04
- D 0 - I - 0x02562C 09:961C: 93        .byte $93, $03   ; 05
- D 0 - I - 0x02562E 09:961E: 00        .byte $00   ; end token



_off010_961F_24_shred_рука_средняя:
- D 0 - I - 0x02562F 09:961F: FE        .byte $FE, con_075C_07   ; 00
- D 0 - I - 0x025631 09:9621: 8E        .byte $8E, $04   ; 01
- D 0 - I - 0x025633 09:9623: FF        .byte $FF, con_0552_shred_рука_средняя   ; 02
- D 0 - I - 0x025635 09:9625: 8F        .byte $8F, $05   ; 03
- D 0 - I - 0x025637 09:9627: 8E        .byte $8E, $02   ; 04
- D 0 - I - 0x025639 09:9629: 00        .byte $00   ; end token



_off010_962A_25_shred_рука_дальняя:
- D 0 - I - 0x02563A 09:962A: FE        .byte $FE, con_075C_04   ; 00
- D 0 - I - 0x02563C 09:962C: 8C        .byte $8C, $05   ; 01
- D 0 - I - 0x02563E 09:962E: FF        .byte $FF, con_0552_shred_рука_дальняя   ; 02
- D 0 - I - 0x025640 09:9630: 8D        .byte $8D, $07   ; 03
- D 0 - I - 0x025642 09:9632: 8C        .byte $8C, $08   ; 04
- D 0 - I - 0x025644 09:9634: 00        .byte $00   ; end token



_off010_9635_26_shred_рука_антиэйр:
- D 0 - I - 0x025645 09:9635: FE        .byte $FE, con_075C_04   ; 00
- D 0 - I - 0x025647 09:9637: 8E        .byte $8E, $04   ; 01
- D 0 - I - 0x025649 09:9639: FF        .byte $FF, con_0552_shred_рука_антиэйр   ; 02
- D 0 - I - 0x02564B 09:963B: 95        .byte $95, $03   ; 03
- D 0 - I - 0x02564D 09:963D: 96        .byte $96, $0A   ; 04
- D 0 - I - 0x02564F 09:963F: 95        .byte $95, $04   ; 05
- D 0 - I - 0x025651 09:9641: 00        .byte $00   ; end token



_off010_9642_27_shred_рука_в_воздухе:
- D 0 - I - 0x025652 09:9642: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x025654 09:9644: 91        .byte $91, $05   ; 01
- D 0 - I - 0x025656 09:9646: FF        .byte $FF, con_0552_shred_рука_в_воздухе   ; 02
- D 0 - I - 0x025658 09:9648: 90        .byte $90, $0C   ; 03
- D 0 - I - 0x02565A 09:964A: 00        .byte $00   ; end token



_off010_964B_28_shred_рука_сидя:
- D 0 - I - 0x02565B 09:964B: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x02565D 09:964D: 91        .byte $91, $04   ; 01
- D 0 - I - 0x02565F 09:964F: FF        .byte $FF, con_0552_shred_рука_сидя   ; 02
- D 0 - I - 0x025661 09:9651: 92        .byte $92, $05   ; 03
- D 0 - I - 0x025663 09:9653: 91        .byte $91, $04   ; 04
- D 0 - I - 0x025665 09:9655: 00        .byte $00   ; end token



_off010_9656_29_shred_нога_ближняя:
- D 0 - I - 0x025666 09:9656: FE        .byte $FE, con_075C_05   ; 00
- D 0 - I - 0x025668 09:9658: 8A        .byte $8A, $03   ; 01
- D 0 - I - 0x02566A 09:965A: 97        .byte $97, $04   ; 02
- D 0 - I - 0x02566C 09:965C: FF        .byte $FF, con_0552_shred_нога_ближняя   ; 03
- D 0 - I - 0x02566E 09:965E: 98        .byte $98, $06   ; 04
- D 0 - I - 0x025670 09:9660: 97        .byte $97, $06   ; 05
- D 0 - I - 0x025672 09:9662: 00        .byte $00   ; end token



_off010_9663_2A_shred_нога_дальняя:
- D 0 - I - 0x025673 09:9663: FE        .byte $FE, con_075C_04   ; 00
- D 0 - I - 0x025675 09:9665: 88        .byte $88, $05   ; 01
- D 0 - I - 0x025677 09:9667: 99        .byte $99, $04   ; 02
- D 0 - I - 0x025679 09:9669: FF        .byte $FF, con_0552_shred_нога_дальняя   ; 03
- D 0 - I - 0x02567B 09:966B: 9A        .byte $9A, $06   ; 04
- D 0 - I - 0x02567D 09:966D: 9B        .byte $9B, $07   ; 05
- D 0 - I - 0x02567F 09:966F: 99        .byte $99, $08   ; 06
- D 0 - I - 0x025681 09:9671: 00        .byte $00   ; end token



_off010_9672_2B_shred_нога_в_воздухе:
- D 0 - I - 0x025682 09:9672: FE        .byte $FE, con_075C_05   ; 00
- D 0 - I - 0x025684 09:9674: FF        .byte $FF, con_0552_shred_нога_в_воздухе   ; 01
- D 0 - I - 0x025686 09:9676: 9C        .byte $9C, $10   ; 02
- D 0 - I - 0x025688 09:9678: 00        .byte $00   ; end token



_off010_9679_2C_shred_нога_сидя:
- D 0 - I - 0x025689 09:9679: FE        .byte $FE, con_075C_06   ; 00
- D 0 - I - 0x02568B 09:967B: 9D        .byte $9D, $04   ; 01
- D 0 - I - 0x02568D 09:967D: FF        .byte $FF, con_0552_shred_нога_сидя   ; 02
- D 0 - I - 0x02568F 09:967F: 9E        .byte $9E, $05   ; 03
- D 0 - I - 0x025691 09:9681: 9D        .byte $9D, $04   ; 04
- D 0 - I - 0x025693 09:9683: 00        .byte $00   ; end token



_off010_9684_2D_shred_нога_антиэйр:
- D 0 - I - 0x025694 09:9684: FE        .byte $FE, con_075C_05   ; 00
- D 0 - I - 0x025696 09:9686: 99        .byte $99, $04   ; 01
- D 0 - I - 0x025698 09:9688: C2        .byte $C2, $04   ; 02
- D 0 - I - 0x02569A 09:968A: FF        .byte $FF, con_0552_shred_нога_антиэйр   ; 03
- D 0 - I - 0x02569C 09:968C: C3        .byte $C3, $0D   ; 04
- D 0 - I - 0x02569E 09:968E: C2        .byte $C2, $04   ; 05
- D 0 - I - 0x0256A0 09:9690: 99        .byte $99, $06   ; 06
- D 0 - I - 0x0256A2 09:9692: 00        .byte $00   ; end token



sub_0x02630E_таблицы:
C - - - - - 0x02630E 09:A2FE: B9 DE A6  LDA tbl_A6DF_рейндж_X_нормалов - $01,Y
C - - - - - 0x026311 09:A301: 9D A0 04  STA ram_obj_spd_Y_hi,X ; 04A2 04A3 
C - - - - - 0x026314 09:A304: B9 0D A7  LDA tbl_A70E_рейндж_Y_нормалов - $01,Y
C - - - - - 0x026317 09:A307: 9D B0 04  STA ram_obj_spd_Y_lo,X ; 04B2 04B3 
C - - - - - 0x02631A 09:A30A: B9 3C A7  LDA tbl_A73D_активные_кадры_ударов - $01,Y
C - - - - - 0x02631D 09:A30D: 20 B6 8B  JSR sub_0x024BC6_уменьшить_на_25_процентов_если_turbo
C - - - - - 0x026320 09:A310: 9D 60 05  STA ram_obj_timer,X ; 0562 0563 
                                        RTS



tbl_A6DF_рейндж_X_нормалов:
- D 1 - - - 0x0266EF 09:A6DF: 1C        .byte $1C   ; 01 con_0552_черепаха_рука_дальняя
- D 1 - - - 0x0266F0 09:A6E0: 1C        .byte $1C   ; 02 con_0552_черепаха_нога_ближняя
- D 1 - - - 0x0266F1 09:A6E1: 17        .byte $17   ; 03 con_0552_черепаха_рука_в_воздухе
- D 1 - - - 0x0266F2 09:A6E2: 18        .byte $18   ; 04 con_0552_черепаха_нога_в_воздухе
- D 1 - - - 0x0266F3 09:A6E3: 16        .byte $16   ; 05 con_0552_черепаха_рука_сидя
- D 1 - - - 0x0266F4 09:A6E4: 1A        .byte $1A   ; 06 con_0552_черепаха_нога_сидя_обычная
- D 1 - - - 0x0266F5 09:A6E5: 1A        .byte $1A   ; 07 con_0552_черепаха_рука_ближняя
- D 1 - - - 0x0266F6 09:A6E6: 1C        .byte $1C   ; 08 con_0552_черепаха_нога_дальняя_обычная
- D 1 - - - 0x0266F7 09:A6E7: 1C        .byte $1C   ; 09 con_0552_черепаха_нога_дальняя_raph
- D 1 - - - 0x0266F8 09:A6E8: 18        .byte $18   ; 0A con_0552_черепаха_нога_сидя_leo
- D 1 - - - 0x0266F9 09:A6E9: 17        .byte $17   ; 0B con_0552_черепаха_деш_локтем
- D 1 - - - 0x0266FA 09:A6EA: 12        .byte $12   ; 0C con_0552_черепаха_нога_антиэйр
- D 1 - - - 0x0266FB 09:A6EB: 16        .byte $16   ; 0D con_0552_черепаха_рука_антиэйр
- D 1 - - - 0x0266FC 09:A6EC: 1C        .byte $1C   ; 0E con_0552_черепаха_деш_ногой
- D 1 - - - 0x0266FD 09:A6ED: 1D        .byte $1D   ; 0F con_0552_casey_рука_дальняя
- D 1 - - - 0x0266FE 09:A6EE: 1F        .byte $1F   ; 10 con_0552_casey_нога_ближняя
- D 1 - - - 0x0266FF 09:A6EF: 18        .byte $18   ; 11 con_0552_casey_рука_сидя
- D 1 - - - 0x026700 09:A6F0: 1D        .byte $1D   ; 12 con_0552_casey_нога_сидя
- D 1 - - - 0x026701 09:A6F1: 1E        .byte $1E   ; 13 con_0552_casey_рука_ближняя
- D 1 - - - 0x026702 09:A6F2: 1E        .byte $1E   ; 14 con_0552_casey_нога_дальняя
- D 1 - - - 0x026703 09:A6F3: 1B        .byte $1B   ; 15 con_0552_casey_рука_антиэйр
- D 1 - - - 0x026704 09:A6F4: 18        .byte $18   ; 16 con_0552_casey_рука_в_воздухе
- D 1 - - - 0x026705 09:A6F5: 1C        .byte $1C   ; 17 con_0552_casey_нога_в_воздухе
- D 1 - - - 0x026706 09:A6F6: 18        .byte $18   ; 18 con_0552_casey_нога_антиэйр
- D 1 - - - 0x026707 09:A6F7: 22        .byte $22   ; 19 con_0552_hot_рука_ближняя
- D 1 - - - 0x026708 09:A6F8: 22        .byte $21   ; 1A con_0552_hot_рука_дальняя
- D 1 - - - 0x026709 09:A6F9: 1F        .byte $1F   ; 1B con_0552_hot_рука_в_воздухе
- D 1 - - - 0x02670A 09:A6FA: 21        .byte $21   ; 1C con_0552_hot_рука_сидя
- D 1 - - - 0x02670B 09:A6FB: 22        .byte $22   ; 1D con_0552_hot_нога_ближняя
- D 1 - - - 0x02670C 09:A6FC: 22        .byte $22   ; 1E con_0552_hot_нога_дальняя
- D 1 - - - 0x02670D 09:A6FD: 1F        .byte $1F   ; 1F con_0552_hot_нога_в_воздухе
- D 1 - - - 0x02670E 09:A6FE: 22        .byte $22   ; 20 con_0552_hot_нога_сидя
- D 1 - - - 0x02670F 09:A6FF: 02        .byte $02   ; 21 con_0552_hot_бабочка
- D 1 - - - 0x026710 09:A700: 26        .byte $26   ; 22 con_0552_hot_рука_антиэйр
- D 1 - - - 0x026711 09:A701: 1A        .byte $1A   ; 23 con_0552_hot_нога_антиэйр
- D 1 - - - 0x026712 09:A702: 18        .byte $18   ; 24 con_0552_shred_рука_ближняя
- D 1 - - - 0x026713 09:A703: 1C        .byte $1C   ; 25 con_0552_shred_рука_средняя
- D 1 - - - 0x026714 09:A704: 1F        .byte $1F   ; 26 con_0552_shred_рука_дальняя
- D 1 - - - 0x026715 09:A705: 18        .byte $18   ; 27 con_0552_shred_рука_антиэйр
- D 1 - - - 0x026716 09:A706: 19        .byte $19   ; 28 con_0552_shred_рука_в_воздухе
- D 1 - - - 0x026717 09:A707: 18        .byte $18   ; 29 con_0552_shred_рука_сидя
- D 1 - - - 0x026718 09:A708: 1E        .byte $1E   ; 2A con_0552_shred_нога_ближняя
- D 1 - - - 0x026719 09:A709: 28        .byte $28   ; 2B con_0552_shred_нога_дальняя
- D 1 - - - 0x02671A 09:A70A: 1D        .byte $1D   ; 2C con_0552_shred_нога_в_воздухе
- D 1 - - - 0x02671B 09:A70B: 25        .byte $26   ; 2D con_0552_shred_нога_сидя
- D 1 - - - 0x02671C 09:A70C: 1E        .byte $1E   ; 2E con_0552_shred_нога_антиэйр
                                        .byte $22   ; 2F con_0552_hot_ручка_быстрая
                                        .byte $00   ; 30 rezerv
                                        .byte $00   ; 31 rezerv
                                        .byte $00   ; 32 rezerv
                                        .byte $00   ; 33 rezerv
                                        .byte $00   ; 34 rezerv
                                        .byte $00   ; 35 rezerv
                                        .byte $00   ; 36 rezerv
                                        .byte $00   ; 37 rezerv
                                        .byte $00   ; 38 rezerv
                                        .byte $00   ; 39 rezerv
                                        .byte $00   ; 3A rezerv
                                        .byte $00   ; 3B rezerv
                                        .byte $00   ; 3C rezerv
                                        .byte $00   ; 3D rezerv
                                        .byte $00   ; 3E rezerv



tbl_A70E_рейндж_Y_нормалов:
- D 1 - - - 0x02671E 09:A70E: DA        .byte $DA   ; 01 con_0552_черепаха_рука_дальняя
- D 1 - - - 0x02671F 09:A70F: DC        .byte $DC   ; 02 con_0552_черепаха_нога_ближняя
- D 1 - - - 0x026720 09:A710: E4        .byte $E4   ; 03 con_0552_черепаха_рука_в_воздухе
- D 1 - - - 0x026721 09:A711: F2        .byte $F2   ; 04 con_0552_черепаха_нога_в_воздухе
- D 1 - - - 0x026722 09:A712: E8        .byte $E8   ; 05 con_0552_черепаха_рука_сидя
- D 1 - - - 0x026723 09:A713: FC        .byte $FC   ; 06 con_0552_черепаха_нога_сидя_обычная
- D 1 - - - 0x026724 09:A714: D8        .byte $D8   ; 07 con_0552_черепаха_рука_ближняя
- D 1 - - - 0x026725 09:A715: DC        .byte $DC   ; 08 con_0552_черепаха_нога_дальняя_обычная
- D 1 - - - 0x026726 09:A716: DC        .byte $DC   ; 09 con_0552_черепаха_нога_дальняя_raph
- D 1 - - - 0x026727 09:A717: FC        .byte $FC   ; 0A con_0552_черепаха_нога_сидя_leo
- D 1 - - - 0x026728 09:A718: DC        .byte $DC   ; 0B con_0552_черепаха_деш_локтем
- D 1 - - - 0x026729 09:A719: D0        .byte $D0   ; 0C con_0552_черепаха_нога_антиэйр
- D 1 - - - 0x02672A 09:A71A: D8        .byte $D8   ; 0D con_0552_черепаха_рука_антиэйр
- D 1 - - - 0x02672B 09:A71B: E0        .byte $E0   ; 0E con_0552_черепаха_деш_ногой
- D 1 - - - 0x02672C 09:A71C: D4        .byte $D4   ; 0F con_0552_casey_рука_дальняя
- D 1 - - - 0x02672D 09:A71D: DC        .byte $DC   ; 10 con_0552_casey_нога_ближняя
- D 1 - - - 0x02672E 09:A71E: E6        .byte $E6   ; 11 con_0552_casey_рука_сидя
- D 1 - - - 0x02672F 09:A71F: FC        .byte $FC   ; 12 con_0552_casey_нога_сидя
- D 1 - - - 0x026730 09:A720: D6        .byte $D6   ; 13 con_0552_casey_рука_ближняя
- D 1 - - - 0x026731 09:A721: DA        .byte $DA   ; 14 con_0552_casey_нога_дальняя
- D 1 - - - 0x026732 09:A722: D5        .byte $D5   ; 15 con_0552_casey_рука_антиэйр
- D 1 - - - 0x026733 09:A723: E0        .byte $E0   ; 16 con_0552_casey_рука_в_воздухе
- D 1 - - - 0x026734 09:A724: EC        .byte $EC   ; 17 con_0552_casey_нога_в_воздухе
- D 1 - - - 0x026735 09:A725: D8        .byte $D8   ; 18 con_0552_casey_нога_антиэйр
- D 1 - - - 0x026736 09:A726: DC        .byte $DC   ; 19 con_0552_hot_рука_ближняя
- D 1 - - - 0x026737 09:A727: DC        .byte $DC   ; 1A con_0552_hot_рука_дальняя
- D 1 - - - 0x026738 09:A728: DD        .byte $DD   ; 1B con_0552_hot_рука_в_воздухе
- D 1 - - - 0x026739 09:A729: E8        .byte $E8   ; 1C con_0552_hot_рука_сидя
- D 1 - - - 0x02673A 09:A72A: E8        .byte $E8   ; 1D con_0552_hot_нога_ближняя
- D 1 - - - 0x02673B 09:A72B: D0        .byte $D0   ; 1E con_0552_hot_нога_дальняя
- D 1 - - - 0x02673C 09:A72C: FC        .byte $FC   ; 1F con_0552_hot_нога_в_воздухе
- D 1 - - - 0x02673D 09:A72D: FC        .byte $FC   ; 20 con_0552_hot_нога_сидя
- D 1 - - - 0x02673E 09:A72E: FC        .byte $FC   ; 21 con_0552_hot_бабочка
- D 1 - - - 0x02673F 09:A72F: BC        .byte $BC   ; 22 con_0552_hot_рука_антиэйр
- D 1 - - - 0x026740 09:A730: B0        .byte $B0   ; 23 con_0552_hot_нога_антиэйр
- D 1 - - - 0x026741 09:A731: D8        .byte $D8   ; 24 con_0552_shred_рука_ближняя
- D 1 - - - 0x026742 09:A732: D4        .byte $D4   ; 25 con_0552_shred_рука_средняя
- D 1 - - - 0x026743 09:A733: D7        .byte $D7   ; 26 con_0552_shred_рука_дальняя
- D 1 - - - 0x026744 09:A734: D0        .byte $D0   ; 27 con_0552_shred_рука_антиэйр
- D 1 - - - 0x026745 09:A735: FC        .byte $FC   ; 28 con_0552_shred_рука_в_воздухе
- D 1 - - - 0x026746 09:A736: E0        .byte $E0   ; 29 con_0552_shred_рука_сидя
- D 1 - - - 0x026747 09:A737: D8        .byte $D8   ; 2A con_0552_shred_нога_ближняя
- D 1 - - - 0x026748 09:A738: CE        .byte $CE   ; 2B con_0552_shred_нога_дальняя
- D 1 - - - 0x026749 09:A739: F6        .byte $F6   ; 2C con_0552_shred_нога_в_воздухе
- D 1 - - - 0x02674A 09:A73A: EF        .byte $EF   ; 2D con_0552_shred_нога_сидя
- D 1 - - - 0x02674B 09:A73B: C0        .byte $C0   ; 2E con_0552_shred_нога_антиэйр
                                        .byte $DC   ; 2F con_0552_hot_ручка_быстрая
                                        .byte $00   ; 30 rezerv
                                        .byte $00   ; 31 rezerv
                                        .byte $00   ; 32 rezerv
                                        .byte $00   ; 33 rezerv
                                        .byte $00   ; 34 rezerv
                                        .byte $00   ; 35 rezerv
                                        .byte $00   ; 36 rezerv
                                        .byte $00   ; 37 rezerv
                                        .byte $00   ; 38 rezerv
                                        .byte $00   ; 39 rezerv
                                        .byte $00   ; 3A rezerv
                                        .byte $00   ; 3B rezerv
                                        .byte $00   ; 3C rezerv
                                        .byte $00   ; 3D rezerv
                                        .byte $00   ; 3E rezerv



tbl_A73D_активные_кадры_ударов:
- D 1 - - - 0x02674D 09:A73D: 06        .byte $06   ; 01 con_0552_черепаха_рука_дальняя
- D 1 - - - 0x02674E 09:A73E: 06        .byte $06   ; 02 con_0552_черепаха_нога_ближняя
- D 1 - - - 0x02674F 09:A73F: 0C        .byte $0C   ; 03 con_0552_черепаха_рука_в_воздухе
- D 1 - - - 0x026750 09:A740: 0D        .byte $0D   ; 04 con_0552_черепаха_нога_в_воздухе
- D 1 - - - 0x026751 09:A741: 0A        .byte $0A   ; 05 con_0552_черепаха_рука_сидя
- D 1 - - - 0x026752 09:A742: 07        .byte $07   ; 06 con_0552_черепаха_нога_сидя_обычная
- D 1 - - - 0x026753 09:A743: 05        .byte $05   ; 07 con_0552_черепаха_рука_ближняя
- D 1 - - - 0x026754 09:A744: 08        .byte $08   ; 08 con_0552_черепаха_нога_дальняя_обычная
- D 1 - - - 0x026755 09:A745: 06        .byte $06   ; 09 con_0552_черепаха_нога_дальняя_raph
- D 1 - - - 0x026756 09:A746: 0C        .byte $0C   ; 0A con_0552_черепаха_нога_сидя_leo
- D 1 - - - 0x026757 09:A747: 0E        .byte $0E   ; 0B con_0552_черепаха_деш_локтем
- D 1 - - - 0x026758 09:A748: 0B        .byte $0B   ; 0C con_0552_черепаха_нога_антиэйр
- D 1 - - - 0x026759 09:A749: 0C        .byte $0A   ; 0D con_0552_черепаха_рука_антиэйр
- D 1 - - - 0x02675A 09:A74A: 0E        .byte $0E   ; 0E con_0552_черепаха_деш_ногой
- D 1 - - - 0x02675B 09:A74B: 07        .byte $07   ; 0F con_0552_casey_рука_дальняя
- D 1 - - - 0x02675C 09:A74C: 05        .byte $05   ; 10 con_0552_casey_нога_ближняя
- D 1 - - - 0x02675D 09:A74D: 07        .byte $07   ; 11 con_0552_casey_рука_сидя
- D 1 - - - 0x02675E 09:A74E: 07        .byte $07   ; 12 con_0552_casey_нога_сидя
- D 1 - - - 0x02675F 09:A74F: 0A        .byte $0A   ; 13 con_0552_casey_рука_ближняя
- D 1 - - - 0x026760 09:A750: 08        .byte $08   ; 14 con_0552_casey_нога_дальняя
- D 1 - - - 0x026761 09:A751: 0D        .byte $0D   ; 15 con_0552_casey_рука_антиэйр
- D 1 - - - 0x026762 09:A752: 0A        .byte $0A   ; 16 con_0552_casey_рука_в_воздухе
- D 1 - - - 0x026763 09:A753: 0A        .byte $0A   ; 17 con_0552_casey_нога_в_воздухе
- D 1 - - - 0x026764 09:A754: 10        .byte $10   ; 18 con_0552_casey_нога_антиэйр
- D 1 - - - 0x026765 09:A755: 08        .byte $08   ; 19 con_0552_hot_рука_ближняя
- D 1 - - - 0x026766 09:A756: 08        .byte $0A   ; 1A con_0552_hot_рука_дальняя
- D 1 - - - 0x026767 09:A757: 0C        .byte $0C   ; 1B con_0552_hot_рука_в_воздухе
- D 1 - - - 0x026768 09:A758: 07        .byte $07   ; 1C con_0552_hot_рука_сидя
- D 1 - - - 0x026769 09:A759: 08        .byte $08   ; 1D con_0552_hot_нога_ближняя
- D 1 - - - 0x02676A 09:A75A: 0B        .byte $0B   ; 1E con_0552_hot_нога_дальняя
- D 1 - - - 0x02676B 09:A75B: 0C        .byte $0C   ; 1F con_0552_hot_нога_в_воздухе
- D 1 - - - 0x02676C 09:A75C: 08        .byte $08   ; 20 con_0552_hot_нога_сидя
- D 1 - - - 0x02676D 09:A75D: 14        .byte $14   ; 21 con_0552_hot_бабочка
- D 1 - - - 0x02676E 09:A75E: 0B        .byte $0B   ; 22 con_0552_hot_рука_антиэйр
- D 1 - - - 0x02676F 09:A75F: 0A        .byte $0A   ; 23 con_0552_hot_нога_антиэйр
- D 1 - - - 0x026770 09:A760: 04        .byte $04   ; 24 con_0552_shred_рука_ближняя
- D 1 - - - 0x026771 09:A761: 05        .byte $05   ; 25 con_0552_shred_рука_средняя
- D 1 - - - 0x026772 09:A762: 07        .byte $07   ; 26 con_0552_shred_рука_дальняя
- D 1 - - - 0x026773 09:A763: 0D        .byte $0D   ; 27 con_0552_shred_рука_антиэйр
- D 1 - - - 0x026774 09:A764: 0C        .byte $0C   ; 28 con_0552_shred_рука_в_воздухе
- D 1 - - - 0x026775 09:A765: 05        .byte $05   ; 29 con_0552_shred_рука_сидя
- D 1 - - - 0x026776 09:A766: 06        .byte $06   ; 2A con_0552_shred_нога_ближняя
- D 1 - - - 0x026777 09:A767: 0D        .byte $0D   ; 2B con_0552_shred_нога_дальняя
- D 1 - - - 0x026778 09:A768: 10        .byte $10   ; 2C con_0552_shred_нога_в_воздухе
- D 1 - - - 0x026779 09:A769: 05        .byte $05   ; 2D con_0552_shred_нога_сидя
- D 1 - - - 0x02677A 09:A76A: 0D        .byte $0D   ; 2E con_0552_shred_нога_антиэйр
                                        .byte $08   ; 2F con_0552_hot_ручка_быстрая
                                        .byte $00   ; 30 rezerv
                                        .byte $00   ; 31 rezerv
                                        .byte $00   ; 32 rezerv
                                        .byte $00   ; 33 rezerv
                                        .byte $00   ; 34 rezerv
                                        .byte $00   ; 35 rezerv
                                        .byte $00   ; 36 rezerv
                                        .byte $00   ; 37 rezerv
                                        .byte $00   ; 38 rezerv
                                        .byte $00   ; 39 rezerv
                                        .byte $00   ; 3A rezerv
                                        .byte $00   ; 3B rezerv
                                        .byte $00   ; 3C rezerv
                                        .byte $00   ; 3D rezerv
                                        .byte $00   ; 3E rezerv



.out .sprintf("Free bytes in bank 0C: %d [%Xh]", ($C000 - *), ($C000 - *))
